{
  "show": "Friends",
  "season": 7,
  "episode": 23,
  "title": "The One With Chandler and Monica’s Wedding",
  "transcript": "The One With Chandler and Monica’s Wedding\nPart I Written by: Greg Malins\nPart II Written by: David Crane & Marta Kauffman\nParts I & II Transcribed by: Eric Aasen\n[Scene: Central Perk, everyone is there.]\nMonica: Do you realize this is probably the last time we’ll all be here in\nthe coffee house as six single people?\nPhoebe: Why?! What’s happening to the coffee house?! (Monica looks at her.)\nOh! (Realizes.)\nChandler: Yep! From now on its gonna be the four of you guys and me and the\nmisses. The little woman. The wife. The old ball and chain.\nMonica: Old?\nChandler: The young hot ball and chain.\nMonica: That’s much better.\nRachel: (checking her watch) Op! We gotta go! (The girls stand up.)\nRoss: Oh, where are you guys going?\nMonica: We’re gonna pick up the wedding dress then we’re gonna have\nlunch with mom. (Joey stands up.)\nRoss: Ah. Joey you’re-you’re having lunch with my mom?\nJoey: No, I-I just heard lunch. But yeah, I can go. Sure! (They all exit.)\nRoss: (To Chandler) Y’know what? Actually I’m kinda glad they’re\nleaving ‘cause uh, I need to talk to you about something.\nChandler: What’s up?\nRoss: Well this uh, this may be a little awkward.\nChandler: Listen, if you want to borrow money, its kind of a bad time. I’m\nbuying dinner for 128 people tomorrow night.\nRoss: No, its…Its not that. Umm, now what I’m going to say to you,\nI’m not saying as your friend. Okay? I’m-I’m saying as it as\nMonica’s older brother.\nChandler: But you’re still my friend?\nRoss: Not for the next few minutes.\nChandler: During this time…are you, are you still my best man?\nRoss: Nope.\nChandler: Do I still call you Ross?\nRoss: Okay! You guys are getting married tomorrow and-and I couldn’t be\nmore thrilled for both of you, but as Monica’s older brother I-I have to tell you\nthis. If you ever hurt my little sister, if you ever cause her any unhappiness of any\nkind, I will hunt you down, and kick your ass! (Chandler laughs.) What?\nI’m-I’m-I’m serious! (Chandler laughs harder.) Come—Hey! Dude! Stop\nit! Okay? I’m-I’m not kidding here!\nChandler: (smiling) Hey, I hear what your saying, okay? And, thanks for the\nwarning.\nRoss: No problem.\nChandler: So are we…friends again?\nRoss: Yeah.\nChandler: Okay. (Pause) You won’t believe what Monica’s older\nbrother just said to me!\nOpening Credits\n[Scene: Monica and Chandler's, the girls are having breakfast.]\nRachel: What ‘cha doing Mon?\nMonica: I’m making a list of all the things that are most likely to go\nwrong at the wedding. Now, that way I can be prepared.\nPhoebe: What are they?\nMonica: Well, so far I have uh, my bride’s maids dresses won’t get\npicked up, my veil gets lost, or I don’t have my something blue.\nRachel: Hey! Those are all the things I’m responsible for!\nMonica: I had to go with the odds Rach.\nJoey: (entering) Hey! You guys! Remember that audition I had a while ago and\ndidn’t get the part?\nRachel: The commercial?\nJoey: No!\nPhoebe: That play?\nJoey: No!\nMonica: That other play?\nJoey: Nooo!\nPhoebe: The movie?\nJoey: Yes!!\nPhoebe: Ohh!\nJoey: Yes that’s the one about the soldiers who fight in World War I!\nPhoebe: Oh, yeah! Back then y’know, we called the Great War. It really was!\nJoey: Well anyway, the guy they wanted backed out and now they want me! I start\nshooting today!\nPhoebe: Congratulations!\nRachel: Oh that’s great!\nMonica: Wait! Wait! Wait! You can’t start today! Today’s the rehearsal\ndinner!\nJoey: Oh no, I’ll be done by then.\nMonica: Oh. Well then way to go you big movie star!\nJoey: I know! All right, I’ll see you guys over there! I’m off to\nfight the Nazis.\nRachel: Oh, wait Joey! We fought the Nazis in World War II, not World War I.\nJoey: Whoa! Okay. Yeah well, who-who was in World War I? (Rachel pauses as she\nthinks.)\nPhoebe: Go ahead.\nRachel: You’re gonna be late! Go! Go! (He runs out.)\nMonica: Who did we fight in World War I?\nRachel: Mexico?\nPhoebe: Yes! Very good.\n[Scene: Pier 59 Studios, Joey is in costume and standing at the craft services table.\nHe checks his pockets and finds some prop coins in a pouch, which he replaces with some\ncookies.]\nThe Assistant Director: (approaching) Hey Joey! We’re ready.\nJoey: Yeah! Me too. (He pats his pocket.)\nThe Assistant Director: (to another actor) Richard? We’re ready for you.\n(Richard approaches.) Joey Tribbiani? This is Richard Crosby he’s playing Vincent.\nJoey: I’m doing my scenes with you?\nRichard: Nice to meet you Joey.\nJoey: Wow! I can’t believe this! This is incredible. I mean you just won an\nOscar!\nRichard: No I didn’t.\nJoey: I think you did.\nRichard: I think I lost. Three times.\nJoey: Uh…Cookie?\nThe Director: (approaching) Okay! We’re about an hour away from getting the\nscene lit. So uh, if you guys don’t mind, can we run it a couple of times?\nRichard: Yeah, sure.\nThe Director: Okay, all right. Let’s do it. (He walks off.)\nAnd…Action!\nJoey: We have to find the rest of the platoon!\nRichard: Forget the platoon! The platoon is gone! (He is spitting on the hard Ps\nand Ts.)\nJoey: (wiping his face) What?!\nRichard: (still spitting) The platoon is dead! Face facts Tony!\nJoey: (wipes face) So what are we gonna do?! We have no reinforcements! No-no\nfood!\nRichard: No, we still have food in the basement! I saw potatoes and some dry\npasta!\n(Joey wipes his eye.)\nThe Director: Hang on a minute! Joey, you keep touching your face. Is something\nwrong?\nJoey: (glances at Richard) No. Nope, I uh…I th—I thought it might be\nkind of a cool character thing. Y’know? He’s uh, he’s a face toucher.\n(Behind his back, Richard is nodding no.)\nThe Director: I don’t think so. Let’s take it back to Richard’s\nlast line. (Walks off.) Action!\nRichard: We may not have any weapons, but we still have food. In the basement I\nsaw potatoes and some dry pasta, and a few tins of tuna! (Joey backs away and wipes his\nface again.)\n[Scene: Monica and Chandler's, Monica is standing in the kitchen ready to leave for the\nrehearsal dinner.]\nMonica: Honey, we gotta go!\nChandler: (entering from the bedroom) Okay. Here’s a question you never\nhave to ask. My dad just called and wanted to know if he could borrow one of your pearl\nnecklaces.\nMonica: (laughs) I don’t have anything like that, but let me go see if\nRachel does.\nChandler: Yes, include more people in this.\nMonica: Hey, do you realize that at this time tomorrow we’ll be getting\nmarried?\nChandler: Wait a minute! I have a date tomorrow night.\nMonica: I just, I can’t believe that we made it!\nChandler: Well you don’t have to sound so surprised.\nMonica: I’m sorry but…nothing.\nChandler: What?\nMonica: Well…honestly ever since we got engaged I have been waiting for\nsomething to, to flip you out.\nChandler: Honestly? Me too.\nMonica: Really?\nChandler: Yeah. Y’know I keep thinking that something stupid is gonna come\nup and I’ll go all…Chandler. But nothing has.\nMonica: Ohh, I’m so glad. Thank you so much for staying so calm during\nthis. I mean it’s really, it’s made me stay calm. (Chandler just looks at her.)\nI coulda been worse!\nChandler: Okay. I’ll be right there.\n(She exits and as Chandler picks up his coat, the phone rings and the answering machine\ngets it.)\nMonica: (voice on answering machine) Hi! If you’re calling before Saturday,\nyou’ve reached Monica and Chandler. But if you’re calling after Saturday,\nyou’ve reached Mr. and Mrs. Bing! Please leave a message for the Bings!\n(Chandler freaks out and loosens his tie.)\n[Scene: The Rehearsal Dinner, Chandler and Monica are greeting guests as they arrive. A\nwoman enters.]\nMonica: Hey Maureen! (They hug.) Gosh! Hey uh, Chandler? This is my cousin\nMaureen.\nChandler: We’re the Bings.\n(Phoebe and Rachel walk up.)\nRachel: Hi! Oh you guys look so beautiful!\nChandler: Mr. and Mrs. Bing! (Walks away.)\nRoss: (walks up) Wow Monica! Hey, just so you know I had my uh, older brother\nchat with Chandler.\nMonica: What is that?\nRoss: Well I…I told him that if he ever hurt you I would hunt him down and\nkick his ass! (The girls all laugh.) What?! What?! What is the matter with everybody?! I\nam serious! I would kick his ass! (The laugh harder.)\nPhoebe: Ross, please! My make-up! (He walks away angrily.)\n(Chandler’s Mom enters and Chandler meets her by the door.)\nChandler: Hi.\nMrs. Bing: Chandler!\nChandler: Mom. Thanks for wearing something. (They hug.) (She’s wearing a\ntight dress with a lot of cleavage showing.)\nMrs. Bing: Oh honey! This is so exciting! I thought we screwed you up so bad\nthis day would never come. Oh and just think. Soon there’ll be lots of little Bings.\n(He freaks out and loosens the tie again.)\n(Monica and her parents walk up.)\nMonica: Mrs. Bing? Here, these are my parents umm, Judy and Jack Geller.\nMrs. Geller: (shaking her hand) It’s lovely to meet you.\nMr. Geller: (shaking her hand) So are you his mother or his father?\nMrs. Geller: Jack!\nMr. Geller: What?! I’ve never seen one before!\nMonica: Dad! There’s Ross (points), why don’t you go talk to him?\n(Mr. and Mrs. Geller start to walk away.)\nMr. Geller: I didn’t even have a chance to act as though I’m okay with\nit!\nMr. Bing: (entering) Hello all!\nChandler: Hi…dad.\nMonica: Hi Mr.…Bing.\nMr. Bing: Nora!\nMrs. Bing: Charles.\nMonica: It-it’s so great to see you both here.\nMr. Bing: Yes! Although, I think we may be seeing a little too much of some\npeople. Aren’t you a little old to be wearing a dress like that?\nMrs. Bing: Don’t you have a little too much penis to be wearing a dress\nlike that?\nChandler: Oh my God! (He and Monica walk away.)\n[Cut to Mr. and Mrs. Geller talking to Ross.]\nMr. Geller: …of course you can kick his ass son.\nMrs. Geller: You could kick anyone’s ass you want too.\nRoss: Thanks you guys. (Walks away happily and his parents smile.)\n[Cut to Monica.]\nMonica: Oh, Rach! Rach! Umm hey, could you do me a favor and would talk to\nChandler’s dad and try to keep him away from Chandler’s mom?\nRachel: Yeah! But I don’t know what he looks like!\nMonica: He is the man in the black dress.\nRachel: Man in the black dress… (Monica walks away and Rachel looks around\nto find a woman in a black dress.) (To her) Hi! I’m Rachel! I’m a friend of\nMonica and Chandler’s!\nWoman: I’m Amanda.\nRachel: Oh I get it! A…man…duh!\nRoss: (clinking a wine glass) Can I have everyone’s attention please?\nI’m uh; I’m Ross Geller.\nMr. Geller: Doctor Ross Geller.\nRoss: Dad…dad, please! As I was saying umm, I’m Dr. Ross Geller. Uhh,\nand I’m the best man. And uh, this marriage is doubly special for me umm, because not\nonly is the groom my best friend but uh, the bride is my little sister. And, she’s\nthe greatest sister a guy could ask for. So if you’d all please join me in raising a\nglass to the, the couple we’re here to celebrate. (Everyone does so.) To the Bings.\nAll: To the Bings!\n(Everyone clinks glasses and Chandler freaks out again.)\n[Scene: Monica and Chandler's, Monica, Phoebe, and Rachel are in the kitchen.]\nMonica: All right, I’m gonna go steam my wedding dress okay? Who wants the\nresponsibility of making sure nothing happens to it?\nRachel: I’ll do it.\nMonica: Who wants it? Anybody?\nRachel: I said I’ll do it!\nMonica: Nobody wants to do it? All right, I’ll do it myself.\nRachel: Monica! I’m not gonna screw it up!\nMonica: Y’know what? You’re right, I’m sorry. Actually you were a\nbig help tonight. Yeah, and thanks for putting my grandmother in the cab and making sure\nshe got to the hotel safely.\nRachel: Well of course that is what I’m here for!\nMonica: Okay. Sorry. (Monica goes into the bathroom.)\nRachel: Ugh! (To Phoebe) What grandmother?\n[Scene: Joey and Rachel's, Joey is wearing sunglasses and as he exits his bedroom, Ross\nenters the apartment.]\nJoey: Hey! Where have you been?\nRoss: Oh, taking my parents back to the hotel.\nJoey: Oh.\nRoss: What? Are you going back to work?\nJoey: Yeah.\nRoss: Nice shades.\nJoey: Thanks. Yeah, I figure if I wear these in my scenes at least I won’t\nget spit in the eyes, y’know?\nRoss: And if I remember correctly, Ray Ban was the official sponsor of\nWorld War I!\nJoey: Great! All right. I’ll see you later. (He starts to leave.)\nRoss: Hey, where’s Chandler?\nJoey: Uh, I think he’s in Rachel’s room. See ya. (Exits.)\nRoss: (going up to Rachel’s closed door) Chandler? (He opens the door and\nlooks inside and doesn’t see him.) Chandler? (He checks the bathroom and still\ndoesn’t find him. He then finds a note on the counter. He picks it up and reads it.)\n[Scene: Monica and Chandler's, Phoebe and Rachel are in the kitchen as there is a knock\non the door. Rachel answers it.]\nRoss: Hey!\nRachel: Hi!\nRoss: Is uh, is Monica here?\nRachel: She’s steaming her dress, why? What’s up?\nRoss: I think Chandler’s gone. (He hands her the note.)\nRachel: What?!\nRoss: He left that.\nRachel: (reading the note) Tell Monica I’m sorry.\nPhoebe: (walking up) What’s up? (Rachel hands her the note and she reads\nit.) Tell Monica I’m sorry. (Pause) Tell her yourself!\nCommercial Break\n[Scene: The Hallway, Ross, Phoebe, and Rachel are discussing the note.]\nPhoebe: Oh my God! Chandler just left though!\nRachel: Yeah but, maybe it’s not what we think. Maybe it’s tell Monica\nI’m sorry I…drank the last of the milk.\nPhoebe: Or maybe he-he was writing to tell her that-that he’s changed his\nname, y’know? Tell Monica I’m sorry.\nRoss: I think it means he freaked out and left!\nPhoebe: Don’t be so negative! Good God! Isn’t it possible that Sorry\nis sitting in there (Joey and Rachel’s apartment) right now?!\nRachel: Okay. Phoebe, I-I think Ross is right. What are we gonna do?\nRoss: Look—Okay, I’m just gonna—I’m gonna have to go find\nhim and bring him back! Okay? You-you make sure Monica does not find out, okay?\nRachel: Okay.\nPhoebe: (pointing at Ross) Okay but if you don’t find him and bring\nhim back, I am gonna hunt you down and kick your ass!\n(Ross laughs and Phoebe points harder.)\nRoss: (scared) I will, I will find him.\n[Scene: The Movie Set, Joey is getting his make-up touched up as Richard approaches.]\nRichard: Hey Joey, could you uh, go through these lines with me? (He’s\nholding a script.)\nJoey: Oh man! They-they just redid my make-up!\nRichard: Just the last two pages.\nJoey: All right.\n(They go onto the set.)\nRichard: I found the picture!\n(He’s still spitting and Joey holds his script in front of his face.)\nJoey: Picture? What picture?\nRichard: Could you uh, could you lower your script? I need to see your face so I\ncan uh, play off your reaction.\nJoey: Okay uh, look I know you’re a great actor, okay? And you play all\nthose Shakespeare guys and stuff…\nRichard: Oh, thanks.\nJoey: But you’re spittin’ all over me man!\nRichard: Well of course I am!\nJoey: You know you’ve been spitting on me?!\nRichard: That’s what real actors do! Annunciation is the mark of a good\nactor! And when you enunciate, you spit! (Spits on the t)\nJoey: (wiping face) Wow! Didn’t know that.\nRichard: Great!\nJoey: Thanks! Okay-okay check it out! (Reading from the script) Picture? What\npicture? (He pauses then spits) Eh?\n[Scene: Central Perk, Gunther is behind the counter as Ross enters looking for\nChandler.]\nRoss: Gunther have you uh, have you seen Chandler?\nGunther: No. No, I haven’t seen him.\nRoss: Oh damn!\nGunther: He’s getting married tomorrow right?\nRoss: Yes. Yes. Don’t worry. Everything’s fine. We’ll uh,\nwe’ll see you tomorrow at the wedding.\nGunther: I wasn’t invited.\nRoss: Well then we’ll-we’ll see you the day after tomorrow. (Walks\naway slowly, but notices something.) Mom?! Dad?! (They’re sitting by the window.)\nWhat-what…what you guys doing here?!\nMr. Geller: Well you kids talk about this place so much, we thought we’d\nsee what all the fuss is about.\nMrs. Geller: I certainly see what the girls like coming here.\nRoss: Why?!\nMrs. Geller: The sexy blonde behind the counter. (She waves at Gunther who waves\nback.)\nRoss: (shocked) Gunther?!\nMr. Geller: Your mother just added him to her list.\nRoss: What? Your-your list?\nMrs. Geller: Yeah, the list that—of people we’re allowed to\nsleep…\nRoss: Yes! No-no! I know, I know what the list is! Mom! Look if you see\nChandler, could you just let him know I’m looking for him?\nMr. Geller: And if you see Rita Moreno, let her know I’m looking for her.\n(Ross points at him and exits.)\n[Scene: The Movie Set, Richard and Joey are doing a scene.]\nThe Director: Action!\nRichard: I found the picture!\nJoey: What picture?!\nRichard: The picture of my wife! In your pack!\nJoey: You went through my personal property?\nRichard: Why do have a picture of Paulette in your pack?!\nJoey: (pause) Because Vincent, we were lovers. (Pause) For two years!\nThe Director: Cut! Wonderful!\n(Joey and Richard both wipe their faces and are given towels.)\nJoey: Great scene yeah?\nRichard: Oh you’re awesome! And, in that last speech? You soaked me.\nJoey: Thanks a lot.\nThe Assistant Director: (To Joey) Here’s your call sheet for tomorrow.\nJoey: Oh, I’m-I’m not working tomorrow.\nThe Assistant Director: You are now.\nJoey: No! No! I can’t! You gotta get me out of it! I’ve got plans!\n(Spits.) Important plans! (Spits on the Ps.)\n(The AD walks away wiping his face.)\n[Scene: Monica and Chandler's, the next morning, Rachel and Phoebe are eating\nbreakfast.]\nRachel: (closing the door) Ross said there’s still no word from Chandler.\nPhoebe: Oh man.\nRachel: Oh but he did say that they found the grandmother wandering down fifth\navenue.\nPhoebe: Okay. Well there’s one down.\nMonica: (entering from her room, excitedly) I’m getting married today!!!\n(She trips and falls.) (Getting up) I think I just cracked a rib. But I don’t care\nbecause today’s my wedding day! My day is finally here!! (Runs back into her room.)\nPhoebe: Y’know she might not even notice he’s gone.\nMonica: (re-entering) I’m gonna start getting ready! (Goes back into her\nroom.)\nRachel: God! Don’t—We can’t let her start getting ready! This is\ntoo awful! Oh God, but wait she’ll be in the gown and then he won’t show up and\nthen she’s gonna have to take off the gown…\nPhoebe: Shhh! Stop it! Stop it Rachel! You can’t do this here! (She drags\nher into the bathroom.)\nRachel: I’m sorry. I’m sorry. It’s just…It’s just so\nsad!\nPhoebe: Yeah, but you’ve got to pull yourself together! Monica can’t\nsee you like this! Then she’ll know something’s wrong!\nRachel: I know. I know. Oh God. (Looking around) There’s no tissue! Can you\ngrab me some toilet paper?\nPhoebe: Yeah. (Looks.) Oh, that’s gone too. This is Monica’s\nbathroom right?!\nRachel: Oh!\nPhoebe: No-no! I-I…I found one.\nRachel: Okay.\n(Phoebe reaches into the trash can, pulls one out, and hands it to Rachel.)\nRachel: Oh thank you! (Wiping her nose.) Oh God! (She throws it out.) Can I have\nanother one?\nPhoebe: (looking into the trash can) Sure. (Reaching into the trash can.) Do you\nneed some floss? (Grabs a piece of it.)\nRachel: Oh God I just can not imagine what is gonna happen if Chandler\ndoesn’t show up!\nPhoebe: Oh here’s a whole bunch.\nRachel: Oh, I mean she’s gonna be at the wedding waiting for him and people\nwill be whispering, \"Oh that poor girl.\" Y’know? Then she’ll have to\ncome back here and live all alone.\nPhoebe: (finding something interesting in the trash can) Oh my God!\nRachel: What?\nPhoebe: There was a pregnancy test in the garbage, and it’s positive.\nMonica’s pregnant. (Rachel covers her mouth.) So I guess she won’t be totally\nalone.\nCommercial Break\n[Scene: Monica and Chandler’s bathroom, the scene is continued from earlier.]\nRachel: Oh my God!\nPhoebe: I know! Monica’s gonna have a baby! Hey, can this count as her\nsomething new?\nRachel: Oh my God!\nPhoebe: Hey, do you think this is why Chandler took off?\nRachel: No, she had to have just taken that test because I took out the trash\nlast night.\nPhoebe: Oh God, this is turning into the worst wedding day ever! The bride is\npregnant. The groom is missing. And I’m still holding this. (She throws the test back\ninto the trash.)\nRachel: Okay Phoebe, we can not tell anyone about this.\nPhoebe: Right.\nRachel: Okay?\nPhoebe: Yeah, okay. Hey, wait. Do you know what kind of birth control she was\nusing?\nRachel: No. Why?\nPhoebe: Just for the future, this is hardly a commercial for it.\n[Scene: Joey and Rachel's, Ross is just hanging up the phone as Rachel and Phoebe\nenter.]\nRachel: Anything?\nRoss: No! I talked to Joey on the set, he hasn’t heard from him. I-I-I\ntalked to Chandler’s parents again!\nPhoebe: You told them he was missing?\nRoss: No! I made it seem like I was just calling to chat. Pretty sure, they both\nthink I’m interested in them.\nRachel: All right, we’ve got to tell her he’s gone. (Starts to leave.)\nRoss: No! Hey! Hey! We can’t!\nRachel: Ross, she’s gonna start getting ready soon!\nRoss: Well, can’t you at least stall her a little? I’ll-I’ll go\nback to some of the places I went last night.\nRachel: All right, well how much time do you need?\nRoss: Well how much time before she absolutely has to start getting ready?\nRachel: One hour.\nRoss: Give me two.\nRachel: Then why do you ask?!\n(They all go into the hallway.)\nRoss: Okay, wish me luck.\nPhoebe: Okay. I’m going with you.\nRoss: Why?!\nPhoebe: Ross, you’re tired. You’ve been looking all night. And clearly\nyou suck at this.\nRachel: All right, I’ll see you guys later.\nPhoebe: Okay. Wait, do you know how you’re going to stall her?\nRachel: I’ll figure something out.\nPhoebe: All right. Good luck.\nRachel: Thanks.\n(Phoebe and Ross go to look for Chandler and Rachel enters Monica and Chandler’s.)\nMonica: Hey! Okay, so I thought we’d start with my make up and then do my\nhair.\nRachel: Okay uh, but before you do that. I-I, I need you to talk to me.\nMonica: About what?\nRachel: Umm… I’m never gonna getting married!\nMonica: Yeah you will! The right guy is just around the corner! Okay, are we\ndone with that?\nRachel: No Monica! I’m serious! Oh, maybe I should just forget about it.\nBecome a lesbian or something.\nMonica: Any woman would be lucky to have ya.\nRachel: Well maybe it would make me feel better if I slept with Joey.\nMonica: (jumping up) Rachel! You okay?\n[Scene: The Movie Set, Joey is reporting for work.]\nJoey: Excuse me, Aaron? (The director turns around.) Hi! Umm, I have a little\nproblem with the schedules. Originally, I wasn’t supposed to work today, and I have\nthis wedding that I really have to be at. It’s my best friend’s, and I’m\nofficiating so I really can’t work past four.\nThe Director: Joey, you gotta stay until the end. We can’t stop filming\njust for you. It’s not like it’s your wedding. (Starts to walk away.)\nJoey: I’m having surgery!\nThe Director: What?!\nJoey: Yeah, I-I just made up the stuff about the wedding because I didn’t\nwant you to worry about me. But, I’m having surgery today.\nThe Director: What kind of surgery?!\nJoey: Transplant.\nThe Director: But you’re supposed to work on Monday.\nJoey: Hair transplant.\nThe Director: But you’re not bald.\nJoey: It’s not on my head.\nThe Director: Look Joey, there’s nothing I can do. Besides, you’re\nprobably gonna be out by four anyway. We’ve just got one short scene. It’s just\nyou and Richard, and God knows he’s a pro. You’ll be fine. (Walks away and sees\nRichard entering.) Morning Richard.\nJoey: Hey! You’re here! Great! Great! Great! Let’s get going buddy,\nwe’ve got a scene to shoot!\nRichard: I’m wearing two belts.\nJoey: Are you drunk?\nRichard: No!\nJoey: Yes you are!\nRichard: All right.\n[Scene: A Street, Phoebe and Ross are exiting a pizza place.]\nRoss: We are never gonna find him! He’s one guy in a huge city!\nPhoebe: Oh my God! Is that him? (She points at someone.)\nRoss: That is an old, Chinese woman!\nPhoebe: He could be in disguise, y’know.\nRoss: Aw, y’know…Y’know, maybe we’re-we’re just\napproaching this all wrong. If you’re Chandler and-and you wanna hide, where is the\nlast place on Earth people would think you’d go?\n[Cut to an office building.]\nRoss: So this is your office?\nChandler: How did you guys find me? I knew I should’ve hid at the gym!\nPhoebe: What the hell are you doing?!\nChandler: Panicking! And using the Internet to try to prove that I’m\nrelated to Monica. How is she?\nRoss: She’s fine. She doesn’t know you’re gone. And she\ndoesn’t have to know, okay? Now come on, we’re going home.\nChandler: No! No! No! I can’t do that!\nPhoebe: Why not?!\nChandler: Because if I go home, we’re gonna become the Bings! I can’t\nbe the Bings!\nRoss: What’s wrong with being the Bings?\nChandler: The Bings have horrible marriages! They yell. They fight. And they use\nthe pool boy as a pawn in their sexual games!\nRoss: Chandler, have you ever put on a black cocktail dress and asked me up to\nyour hotel room?\nChandler: No.\nRoss: Then you are neither of your parents!\nChandler: It’s not just their marriage! I mean, look at yours. Look at\neverybody’s! The only person that can make marriage work is Paul Newman! And\nI’ve met me; I am not Paul Newman. I don’t race cars! I don’t make popcorn!\nNone of my proceeds go to charity.\nPhoebe: But look Chandler, right now, no one has a lower opinion of you than I\ndo. But I totally believe you can do this.\nChandler: I want to. I love her so much, but I’m afr…It’s too\nhuge.\nRoss: Y’know, okay. You’re right. It is huge. So why don’t we\ntake it just a little bit at a time? Okay? Umm, forget getting married for a sec; just\nforget about it. Can you just come home and take a shower?\nChandler: Well yeah, but then…\nRoss: (interrupting him) Yeah—No-but-but-but-but! We’re just gonna go\nhome and take a shower. Now, that’s not scary right?\nChandler: Depends on what you mean by we.\n[Scene: Monica and Chandler's, Rachel is still trying to stall Monica.]\nRachel: The nights are the hardest. (Checks her watch.) But then the day comes!\nAnd that’s every bit as hard as the night. And then the night comes again…\nMonica: (interrupting) The days and nights are hard! I get it! Okay? Look umm,\nRachel I’m sorry! I have to start getting ready! I’m getting married today!\nRachel: I know. At dusk. That’s such a hard time for me.\nMonica: (getting up) I’m gonna go put my make up on, we have to be at the\nhotel in an hour! (Starts for the bathroom.)\nRachel: Okay. But wait!\nMonica: What?!\nRachel: Let’s go to lunch.\nMonica: I can’t go to lunch!!\nRachel: Right.\n(Monica goes into the bathroom and Rachel thinks quickly.)\nRachel: Oh good God! I’ve fallen down! (She trips and falls.)\nMonica: (entering) What’s going on?\nRachel: Okay. All right. (Gets up.) Honey listen. When I tell you what I’m\nabout to tell you, I need you to remember that we are all here for you and that we love\nyou.\nMonica: Okay, you’re-you’re really freaking me out.\nRachel: We can’t find Chandler…(Phoebe sticks her head and motions\nthat they found Chandler)—‘s vest. We can’t find Chandler’s vest.\nMonica: How can that be?! Oh wait! Wait! Are you, are you serious?!\nPhoebe: (entering) Found the vest! I mean we’re gonna have to keep an eye\non it, y’know make sure we don’t lose it again…\nRachel: Oh!\nMonica: Oh wow! Okay. Don’t scare me like that okay? I mean for a minute\nthere I was like, \"Oh my God! The worst has happened!\"\n(Monica goes into the bathroom and Phoebe and Rachel breathe a sigh of relief.)\n[Scene: The Movie Set, Joey and Richard are in the middle of a scene. They are both\nholding swords.]\nJoey: I would sooner die in this hellhole then see her back with you!\nRichard: That can be arranged.\n(Richard thrusts, misses Joey by several feet and Joey screams in pain and drops to his\nknees.)\nThe Director: Let’s reset.\nJoey: What?! He got me! Owwwwww!!!\nThe Director: Let’s take it from there.\nRichard: (To Joey) Are you a little off today? It’s going terribly slowly.\nJoey: Look, my best friends are getting married in like an hour. Okay? And\nI’m the minister. Please! Please! Can you pull it together?\nRichard: Of course! I’m-I’m sorry. I-I’d hate you to miss\nanything like that on account of me. I can do this!\nJoey: Thank you. Thank you.\nThe Director: Still rolling, annnnd action!\nJoey: I would sooner die in this hellhole then see her back with you!\nRichard: Now, that can be arranged! (He brings his sword back and drops it,\ncausing it to fly over the wall.) Slippery little bugger!\n[Scene: The Hotel, Monica’s room, Mr. and Mrs. Bing are staring at each other\nwhile Phoebe looks on.]\nPhoebe: So-so you two were married huh? What happened? You just drift apart?\n(Rachel and Mrs. Geller enter.)\nMrs. Geller: Here comes the bride.\n(Monica enters wearing her wedding dress.)\nPhoebe: Oh my God Monica!\nMonica: I wanna wear this everyday.\nRachel: You look so beautiful.\nMonica: (starting to cry) I’m so happy for me.\n(The phone rings and Rachel answers it.)\nRachel: Hello?\nJoey: (on phone) Hey! Did Chandler show up yet?\nRachel: Yeah, we got him back. Everything’s fine.\nJoey: Damnit!\nRachel: What? Why? Where are you?\nJoey: I’m still on the set!\nRachel: Joey! The wedding is in less than an hour!\nJoey: I know! I’m sorry! The guy’s drunk, they won’t let me go\nuntil we get this.\nRachel: Oh my God! I’m gonna have to find another minister.\nJoey: No! No, I’m the minister! All right, look-look, put ‘em both on\nthe phone, I’ll marry them right now.\nRachel: Ugh! Joey, I have to go.\nJoey: Hey! Don’t you hang up on me! I’ll marry you and me right now! I\nhave the power!\n(She hangs up anyway.)\n[Scene: Chandler’s Hotel Room, Ross is getting Chandler ready.]\nRoss: There you go. You put on a tuxedo! Now that wasn’t so scary, was it?\nChandler: No.\nRoss: I’m telling you, just a little bit at a time.\nChandler: Yeah okay. Well, what’s the next little bit?\nRoss: Getting married. (Chandler panics.) Okay. Okay. You can, you can do that\ntoo! Just like you’ve done everything else!\nChandler: Yeah. You’re right. Hey I-I can do that.\nRoss: Yeah.\nChandler: Okay, excuse me for a minute. (Starts to leave)\nRoss: Wh—Hey—Whoa-whoa, where, where you going?!\nChandler: Ross, I am not gonna run away again! I just want to get a little fresh\nair.\nRoss: Okay.\nChandler: Okay.\n(Chandler goes out into the hall and lights up a cigarette.)\nChandler: Oh fresh air!\n(He hears Phoebe and Rachel coming and hides in the ice machine room.)\nPhoebe: (To Rachel) Wait! Maybe, maybe you’re overreacting! You do that\ny’know.\nRachel: Well Phoebe, we gotta do something! (They turn the corner.) Well,\ny’know. I mean there’s no way Joey’s gonna make it in time. So I’m\ngonna through the hotel and see if there’s any other weddings going on.\nPhoebe: Okay. Oh but don’t tell them Monica’s pregnant because, they\nfrown on that.\nRachel: Okay.\nPhoebe: Okay.\n(They head in separate directions and Chandler emerges and he’s so shocked that\nhis cigarette is hanging from his lip.)\nCommercial Break\n[Scene: The Hotel, Rachel is walking through the ballroom area and comes upon the sign\nfor the Anastassakis/Papasifakis wedding.]\nRachel: Anastassakis/Papasifakis wedding, excellent! {It’s a good thing\nJennifer Aniston is Greek, because she had to pronounce those names. Luckily for me, they\nwere written on a sign.}(The happy couple emerges.) Congratulations. (To the best man and\nmaid of honor) Mazel Tov! (The rabbi emerges.) Hi! Oh, great hat. (He’s wearing an\ninteresting hat and she takes him over to talk.) Listen umm, I need you to perform another\nwedding. Can you do that?\nThe Rabbi: I don’t know. Are they Greek Orthodox?\nRachel: Yeah! Yeah. They’re…they’re-they’re my friends, uh,\nMonica Stephanopolus and uh, and Chandler Acidofolus.\n[Scene: Monica’s Hotel Room, Chandler and Monica’s parents and Phoebe are\nthere as Ross enters.]\nRoss: Hi! (To Mrs. Bing) Hi! (Mr. Bing starts rubbing his arm.) Hi. Has umm,\nanyone seen Chandler?\nMr. Geller: I thought he was with you.\nRoss: He-he was with me umm, we’re playing a little game, y’know? Hide\nand seek.\nMr. Geller: You can’t ask us son, that’s cheating.\nRoss: (pause) You’re right, thanks for keeping me honest dad.\nMrs. Geller: Well, he better not come by here. He can’t see the bride in\nthe wedding dress.\nMrs. Bing: As I recall when we got married, I saw the groom in the wedding\ndress.\nMr. Bing: But that was after the wedding, it’s not bad luck then.\nMrs. Bing: Honey, it isn’t good luck.\n(Monica enters.)\nRoss: Oh my God! Monica!\nMonica: I know! Hey, how’s Chandler doin’?\nRoss: Great. He’s doing great. Don’t you worry about Chandler.\nMonica: Are you okay?\nRoss: Uh-huh.\nMonica: Well, you’re-you’re sweating.\nRoss: These-these are beads of joy.\nMonica: Oh that’s sweet. Don’t touch me.\nRoss: Uh Phoebe, can I see you for a second?\nPhoebe: Yeah!\n(They both go out into the hall.)\nPhoebe: What’s going on?\nRoss: Chandler’s gone again!\nPhoebe: Oh my God! Why would you play hide and seek with someone you know is a\nflight risk?!\n(Ross just glares at her.)\n[Scene: The Movie Set, Joey is walking up to the director, pleading with him to let him\ngo.]\nJoey: Aaron! You gotta let me go. The guy’s hammered!\nThe Director: I’m sorry Joey, as long as he’s here and he’s\nconscious we’re still shooting.\n(He walks away and Joey does Ross’s fist thing. He then enters Richard’s\ndressing room, to find Richard cutting his steak with his sword.)\nRichard: You wouldn’t happen to have a very big fork?\nJoey: So I uh, I just talked to the director. That’s it, we’re done\nfor the day.\nRichard: Well have we finished the scene?\nJoey: Yeah! You…you were wonderful.\nRichard: As were you.\nJoey: So I got your car, it’s right outside.\nRichard: Why? Are we done for the day?\nJoey: That’s what you told me.\nRichard: Oh, thank you. You’re welcome. (He stands up, staggers to the\ncouch, and starts to lie down.)\nJoey: No-no-no! We gotta go! Come on! (Joey picks him up in a fireman’s\ncarry and carries him out.) Here we go.\nRichard: Is that my ass? (He’s looking at Joey’s.)\n(And as Joey walks out the door, Richard grabs a bottle of Scotch, just as the door\ncloses and carries it with him.)\n[Scene: The Hotel, Phoebe and Ross are looking for Chandler.]\nRoss: (turning a corner) There he is!!\nChandler: What?\n(Ross runs over and tackles him.)\nPhoebe: Hey! Oh!\nRoss: You’re not getting away this time mister! Unless you want that ass\nkicking we talked about!\nChandler: Ross! (He starts to get up.)\nRoss: Hiiii-Ya!! (Chandler lies back down.) I’m serious! You’re not\nwalking out on my sister!\nChandler: (standing up) That’s right! I’m not!\nRoss: Then where the hell have you been?!\nChandler: I know about Monica.\nPhoebe: You know?!\nRoss: What?\nChandler: Yeah, I heard you and Rachel talking.\nRoss: What?! What?! Talking about what?!\nChandler: You don’t know?\nRoss: Know what—If somebody doesn’t tell me what’s going on right\nnow…\nPhoebe: What? You’ll hi-ya?\nChandler: Monica’s pregnant.\nRoss: Oh my God. Oh my God! And you’re-you’re…you’re not\nfreaking out?\nChandler: Well I was! Then I went down to the gift shop because I was out of\ncigarettes…\nPhoebe and Ross: Cigarettes?!!\nChandler: Big picture please! So I was in the gift shop, and that’s when I\nuh, saw this. (He holds up a little, tiny baby jumper that reads I (heart) New York.)\nYeah, y’know what? I thought anything that can fit into this, can’t be scary.\nPhoebe: Well you obviously didn’t see Chucky 3.\nChandler: But come on, look at how cute and small this is! So I got it to give\nMonica so she’d know I was okay.\nRoss: Dude. (Hugs him.)\n(Mr. Geller turns the corner.)\nMr. Geller: Way to go son! I knew you’d find him!\n[Scene: The moment we waited for has finally arrived. It’s time for Monica and\nChandler’s wedding. We’ve got violins playing Every Breath You Take,\nwe’ve got guests seated, and Chandler starts walking down the aisle with his parents\non either arm.]\nMr. Bing: Our little boy is getting married.\nMrs. Bing: Oh look at you! So handsome!\nChandler: You look beautiful mom. (His dad clears his throat.) You look\nbeautiful too dad. I love you both. (He kisses his dad on the cheek) I’m so glad you\nhere. (He kisses his mom.)\n(He walks up onto the altar and notices the rabbi.)\nThe Rabbi: Are you Chandler?\nChandler: Are you Joey?\n(Ross walks down the aisle with Phoebe and Rachel on his arms.)\nRoss: Huh. This is nice.\nPhoebe: What?\nRoss: I’ve never walked down the aisle knowing it can’t end in\ndivorce.\n(Finally, Monica with her parents on her arms start down the aisle.)\nMrs. Geller: Oh I wish you’re grandmother had lived to see this.\nMonica: She’s right there.\nMrs. Geller: Not that old crow, my mother. (They stop and she kisses Monica on\nthe cheek.) Congratulations darling.\nMr. Geller: I love you sweetheart. (He kisses her and they sit down.)\n(Chandler steps off the altar to greet his bride-to-be.)\nChandler: You look beautiful. Is this new? (Her dress.)\nMonica: Not now.\nChandler: Okay.\n(They both step up onto the altar and she notices the rabbi.)\nMonica: (To Chandler) Who is this?\nThe Rabbi: I am Father Kalebasous.\nChandler: (in Monica’s ear) He’s Greek Orthodox.\nRachel: (leaning in) As are you…\nThe Rabbi: Let us begin. Dearly beloved…\nJoey: (entering) That’s my line! (He walks up the aisle and to the rabbi) I\ncan take it from here, thanks. (To all) Dearly beloved, I’m sorry I’m a little\nlate. You may be confused by this now, (He’s still in costume) but you won’t be\nMemorial Day weekend 2002. Well, let’s get started before the groom takes off again.\nHuh? (Monica is shocked and looks around.) We are gathered here today, to join this man\nand this woman in the bonds of holy matrimony. I’ve known Monica and Chandler for a\nlong time, and I can not imagine two people more perfect for each other. And now,\nas I’ve left my notes in my dressing room. We shall proceed to the vows. Monica?\n(She turns to get her vows from Rachel.)\nMonica: (To Rachel) He took off?\nRachel: Go on! Go on. (She turns back to Chandler.)\nMonica: Chandler, for so long I…I wondered if I would ever find my prince,\nmy soul mate. Then three years ago, at another wedding I turned to a friend for comfort.\nAnd in stead, I found everything that I’d ever been looking for my whole life. And\nnow…here we are…with our future before us…and I only want to spend it with\nyou, my prince, my soul mate, my friend. Unless you don’t want to. You go!\nJoey: Chandler?\n(Ross leans in to give Chandler his vows.)\nChandler: (To Ross) No, that’s okay. (Ross nods and retreats.) Monica I\nthought this was going to be the most difficult thing I ever gonna had to do. But when I\nsaw you walking down that aisle I realized how simple it was. I love you. Any surprises\nthat come our way it’s okay, because I will always love you. You are the person I was\nmeant to spend the rest of my life with. You wanna know if I’m sure? (He leans in and\nkisses her.)\nJoey: You may not kiss the bride. So, I guess by the powers vested in my by the\nstate of New York and the Internet guys, I now pronounce you husband and wife. Oh wait! Do\nyou take each other?\nChandler: I do.\nMonica: I do.\nJoey: Yeah you do!\nRoss: Rings?\nJoey: Aw crap! Okay—uh…uh let’s-let’s do the rings.\n(Chandler and Monica both turn, take the rings from Ross and Rachel respectively, and\nplace them on each other’s fingers.)\nJoey: We good? Yeah? Good? Once again, I pronounce you husband and wife. (To\nChandler) Now kiss her again.\n(They kiss and everyone applauds.)\nChandler: (To Monica) I love you. And I know about the baby.\nMonica: What baby?\nChandler: Our baby.\nMonica: We have a baby?\nChandler: Phoebe found your pregnancy test in the trash.\nMonica: I didn’t take a pregnancy test.\nChandler: Then…who did?\n[Cut to Phoebe and Rachel.]\nPhoebe: Oh and they’re gonna have a baby.\nRachel: Uh-huh.\n(The camera zooms in on Rachel who has a very worried and frightened look on her face\nand she slowly takes a deep breath.)\n[Fade to black.]\nEnding Credits\n{Transcriber’s Note: There was no trailer for this episode. See you in season 8;\nwhich will start this fall.}\nEnd",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0723.html",
  "scrapedAt": "2025-12-17T14:32:59.990Z",
  "wordCount": 7029,
  "hasCharacterNames": true
}