[
  "What is Phoebe looking at out the window at the beginning of the episode?",
  "What did Monica and Rachel give the super as a gift?",
  "Who did Ross give a Slinky to?",
  "What is the gift that Ross got for his mom?",
  "What did Phoebe discover about the picture of her father?",
  "Why did Phoebe's grandmother not tell her the truth about her father?",
  "Where does Phoebe's father allegedly live?",
  "What is the reason for the heat in Monica and Rachel's apartment?",
  "What does Ross offer Mr. Treeger to fix the radiator?",
  "What is the final outcome of Phoebe's attempt to meet her father?",
  "What gift does Joey give to Rachel?",
  "What is the explanation for Mr. Treeger's ability to stay cool in the hot apartment?",
  "What is the reason for Phoebe's hesitation to meet her father?",
  "What is the outcome of Ross's attempt to 'seize the day' with Mr. Treeger?",
  "What is the significance of the picture frame that Ross bought?",
  "What is the reason for the party at Monica and Rachel's apartment?",
  "What is the gift that Chandler and Joey give to Monica?",
  "What is the final scene of the episode?",
  "What is the reason for Phoebe's grandmother's initial hesitation to tell Phoebe the truth about her father?",
  "What is the significance of the cab that Phoebe's grandmother gives her?",
  "What is the gift that Ross gives to Rachel at the beginning of the episode?",
  "What is the reason for Ross's obsession with the list that Rachel made about him?",
  "What is the significance of the scene where Ross is talking to the girl at the party?",
  "What is the reason for Joey's comment about the outlet stores closing at 7?",
  "What is the significance of the scene where Phoebe is running back to the cab?",
  "What is the reason for Chandler's comment about the paramedics cutting through the seat belt?",
  "What is the significance of the scene where Ross and Monica are talking about the radiator?",
  "What is the reason for Phoebe's grandmother's comment about the phonebook?",
  "What is the significance of the scene where Joey is giving out gifts?"
]