[
  "What is the name of Ross's pet monkey?",
  "Where did Ross get his pet monkey?",
  "Why did Joey not get the job as Santa?",
  "What is the name of the song Phoebe sings about her mother's suicide?",
  "Why did Phoebe stop singing at Central Perk?",
  "What does David tell Phoebe he wants to do to her?",
  "Why does David decide not to go to Minsk?",
  "What happens to Rachel at the airport?",
  "Who does Joey end up kissing at midnight?",
  "Why is Fun Bobby sad at the party?",
  "What is the name of the woman who hits Rachel at the airport?",
  "What does Ross do when he realizes Marcel is not loving him back?",
  "What is the name of the holiday that Chandler hates?",
  "Who does Phoebe ask to the New Year's party?",
  "What does Janice say to Chandler when he tries to break up with her?",
  "Why does Max decide to go to Minsk without David?",
  "What does Phoebe tell David to do when he is deciding whether to go to Minsk?",
  "What is the name of the woman that Joey meets at the store?",
  "Why does Ross's monkey, Marcel, keep shutting him out?",
  "What is the name of the TV host who is counting down to midnight?",
  "What does Rachel say when she arrives at the party?",
  "What does Chandler do when he realizes he is alone at midnight?",
  "Who does Sandy end up with at the party?",
  "What is the reason for the party at Monica and Rachel's apartment?",
  "What does Phoebe do when David tells her he has to go to Minsk?",
  "What is the name of the grant that Max and David receive?",
  "What does Ross do when he realizes Marcel is playing with his spatulas?",
  "What is the reason for Fun Bobby's sadness at the party?",
  "What does Janice do when Chandler tries to break up with her?",
  "What does David write on the whiteboard when Phoebe asks him if he plans to kiss her?",
  "What is the name of the city where Max and David are supposed to go for their grant?",
  "What does Phoebe tell David to say to her when he breaks up with her?",
  "What does David do when he decides to stay with Phoebe?"
]