[
  "What is Phoebe watching at the beginning of the episode with Monica, Rachel, Ross, and Richard?",
  "Why does Phoebe think Old Yeller is a happy movie?",
  "What is wrong with the friend Eric Prower that Chandler and Joey are considering bringing to the Knicks game?",
  "Why does Ross want to spend more time with Ben?",
  "What is the name of the book that Ross read which made him think of the name Emily for a future child?",
  "Why does Rachel get upset with Ross?",
  "What movie does Phoebe watch after talking to her grandma about Old Yeller?",
  "What does Joey try to do to look like Richard?",
  "Why does Monica get upset with Richard?",
  "What game are Chandler and Joey playing with Richard?",
  "What is Ben's first word?",
  "What does Phoebe watch at the end of the episode with Ben?",
  "Why does Phoebe's mom not show her the ends of sad movies?",
  "What is the name of the disease that Lou Gehrig had?",
  "What does Chandler say about Richard's age?",
  "What does Joey say about Richard?",
  "What does Phoebe say about the movie 'It's a Wonderful Life'?",
  "Why does Ross want to have two babies?",
  "What does Rachel say about Ross's plans for their future?",
  "What does Ross say about his future with Rachel?",
  "What is the first word that Ben says to Ross?",
  "What does Phoebe say about her mom's method of shielding her from sad movies?",
  "Why does Monica get upset with Chandler and Joey?",
  "What does Richard say about his age?",
  "What does Phoebe watch with Ben at the end of the episode?",
  "Why does Ross want to spend more time with Ben?",
  "What does Chandler say about Richard's age?",
  "What does Joey say about Richard?",
  "What does Phoebe say about the movie 'It's a Wonderful Life'?",
  "Why does Ross want to have two babies?",
  "What does Rachel say about Ross's plans for their future?",
  "What does Ross say about his future with Rachel?",
  "What is the first word that Ben says to Ross?",
  "Why does Phoebe say that her mom used to shield her from sad movies?"
]