[
  "What tea flavors does Rachel list to a customer at Central Perk?",
  "What is the name of the man Rachel almost married?",
  "What does Ross ask Marcel to bring him?",
  "What type of monkey is Marcel?",
  "Why does Ross go to pick up a bottle of wine?",
  "What does Marcel do in Monica's shoe?",
  "What is the name of the woman from Rachel and Monica's high school?",
  "Why does Ross not want Animal Control to find Marcel?",
  "What is Mr. Heckles using the bananas for?",
  "Why does Phoebe jump towards Marcel when Luisa fires the tranquilizer gun?",
  "What does Rachel offer to do to make up for losing Marcel?",
  "What is Ross's excuse for why he and Rachel should drink the wine at home?",
  "Who bursts into Rachel's apartment near the end of the episode?",
  "What is the name of the school that Rachel, Monica, and Luisa attended?",
  "What does Phoebe do when her butt cheek wakes up?",
  "What type of school did Chandler attend?",
  "What does Rachel list as the tea flavors available at Central Perk, in order?",
  "What is the name of the play that Monica was in during high school?",
  "What does Joey claim he can do to help the sweaty women?",
  "What does Luisa use to try to sedate Marcel?",
  "What does Rachel tell Luisa she will do if she takes Marcel away?",
  "What is the name of the animal that Ross says he should have started Rachel with instead of a monkey?",
  "What does Mr. Heckles claim the monkey's name is?",
  "What is the reason for Rachel's emotional reaction to Barry and Mindy's engagement?",
  "What does Chandler say Ross should do instead of trying to woo Rachel with wine?",
  "What is the name of the pizza place where the guys are hanging out?",
  "What does Phoebe do when she notices the tranquilizer dart in her butt?",
  "What does Ross say he wants to do with the bottle of wine?",
  "What is the reason for Ross's broken foot?",
  "What does Rachel say she will do if Luisa takes Marcel away?",
  "What does Mr. Heckles claim the bananas are for?",
  "What does Phoebe do when she feels her butt cheek waking up?"
]