{
  "show": "Friends",
  "season": 10,
  "episode": 7,
  "title": "Friends - 10.07 The One With The Home Study",
  "transcript": "Friends\n1007 - The One With The Home Study\nWritten by: Mark Kunerth\nProduced by: Robert Carlock and Wendy Knoller\nTranscribed by: Coffee Mug, Eleonora, Sebastiano & Vanessa\nFinal check by Kim\n[Scene: Central Perk]\n(Joey and Ross enter. Phoebe and Mike are sitting on the couch, reading a magazine.)\nRoss: Hey you guys!\nPhoebe: Hey!\nRoss: Hey, what are you doing?\nMike: Oh, figuring out our wedding plans.\nChandler: That's funny, we were doing the same thing!\nRoss: Yeah!\nPhoebe: It's really crazy! The hall, the dress, the food... I-I had no idea\nhow expensive this stuff was!\nChandler: Yeah it is really pricey. I mean, I freaked when I first heard the\nnumbers.\nPhoebe: So what did you two do about it?\nChandler: It was pretty simple actually, I came up with a couple of cost-cutting\nsolutions, wrote out a list and Monica told me to go to hell.\nRoss: There's no way around it Pheebs, you just gonna have to accept the fact\nthat this is gonna cost you a lot of money.\nMike: I heard that weddings are like a 40 billion dollar a year industry.\nRoss: Yeah, and I'm responsible for just like half of that.\nPhoebe: But really, it does seem like this money could be put to better use?\nMike: Are you serious?\nPhoebe: Yeah! Now, how would you feel if we gave all the wedding money to charity\nand we just got married at City Hall?\nMike: I think it would make me wanna marry you even more. (he kisses her)\nRoss: I've got to say you guys, that's an incredible gesture!\nChandler: (to Ross) Maybe you do that next time you get married!\nRoss: No, no, no. The next time it's gonna be a Hawaii at sunset. [pause] But\nmaybe the time after that!\nOpening Credits\n[Scene: Monica and Chandler's apartment]\n(Monica is cleaning the table, Chandler is sitting on the sofa. Joey enters.)\nJoey: Hey!\nChandler: Hey!\nJoey: What's going on?\nChandler: Our adoption social worker is coming by today so we are cleaning\nthe apartment.\nMonica: (sarcastically) We?\nChandler: You know you don't want me to help. You can't have it both ways!\nJoey: Hey, is this person who decides whether or not you... get a baby?\nChandler: Kind of. She's coming by to interview us and see where we live.\nMonica: And it has to go perfectly, because if she doesn't like something about\nus she can keep us off every adoption list in the state.\nJoey: Hey, maybe I should stop by! She could be a soap opera fan! It's very\nimpressive when the little people know a celebrity.\nChandler: (pointing at himself) Little people?\nJoey: (pointing at himself) Celebrity.\nMonica: Ok, so I think I'm just about done here, unless you have any bad stuff\nhidden somewhere, like... porn or cigarettes?\nChandler: What...? NO!\nMonica: Chandler?\nChandler: (he stands up and he feels very offended) I don't, and I'm offended\nby the insinuation!\nMonica: Ok, so there's not a magazine under the couch, or a pack of cigarettes\ntaped to the back of the toilet tank, or a filthy video in the VCR?\nChandler: I'll admit to the cigarettes and the magazine, but that tape is not\nmine.\nMonica: It isn't mine!\nJoey: (going out with the VCR in his hand) Well, I guess we'll never know whose\nit is!\n[Scene: The New York City Children's fund hallway.]\nCharity guy: May I help you?\nPhoebe: Yes. We're here to make a rather sizeable donation to the children.\nCharity guy: Well, any contribution, large or small, is always appreciated.\nPhoebe: Well, I think you're gonna appreciate it the crap out of this one (she\ngives him a check)\nCharity guy: Well, this is very generous!\nPhoebe: And we don't want any recognition. This is completely anonymous.\nMike: Completely anonymous. From two kind strangers.\nPhoebe: Mr. X and Phoebe Buffay.\nCharity guy: Well if you like, we can include your names in our newsletter.\nMike: Not necessary.\nPhoebe: Buffay is spelled B-U-F-F-A-Y.\nMike: And \"X\" is spelled uhm... \"Mike Hannigan\".\nCharity guy: Right. Well, on behalf of the children: thank you both very much.\nPhoebe: Sure, I so glad we did this. It feels so good!\nMike: It does. It feels really good!\nPhoebe: Oh, look! And we get these free t-shirts! (she takes a t-shirt which\nwas on the counter)\nCharity guy: Oh, actually, that's the shirt I wore to the gym.\nPhoebe: Mhm... it's moist.\n[Scene: Joey and Rachel's apartment.]\nRoss: (he enters) Hi!\nRachel: Hi! Emma will be up in a minute!\nRoss: Oh, good!\nRachel: Oh hey Ross... Listen, I heard about you and Charlie. I'm really sorry.\nRoss: Oh, that's OK. I'm sure there are tons of other beautiful paleontologists\nout there.\nRachel: Absolutely.\nRoss: There was one! She's it! All the rest look like they should live under\na bridge!\nRachel: So, uhm... what are you gonna do today?\nRoss: Well, I was thinking of taking Emma to the playground!\nRachel: Oh my God, what!?\nRoss: Like I said I was thinking of taking Emma to the museum of knives and\nfire!\nRachel: Ok, look, Ross. I do not want Emma going to the playground.\nRoss: Be-caaauuuse...\nRachel: (upset) All right, well, if you must know... I had a traumatic... swing\nincident... when I was little.\nRoss: Seriously?\nRachel: Yes, I was 4 years old and I was on the swing and then all of a sudden\nmy hair got tangled in the chain. And to get me out my mom had to-had to cut\na big chunk of my hair! (crying) And it was uneven for weeks!\nRoss: (sarcastic) And you made it through that? I wonder who's gonna play you\nin the movie!\nRachel: Ok, fine! You can make fun of me. I do not want Emma going there. And\nI was thinking Claire Danes.\nRoss: Look, I'm sorry to hear about your tragedy, ok? But the swings are perfectly\nsafe, and besides Emma loves them. You know what, you should come with us and\nyou'll see!\nRachel: Ross, those things go like 40 miles an hour! Ok? When you're... and\nthere is that moment when you are at the top, when you just don't know if you're\ngonna return back to earth!\nRoss: Space is filled with orbiting children. (pause) Look, please, just come\non, you know, when you’ll see the look on Emma’s face, I swear you\nwon’t regret it.\nRachel: All right!\nRoss: Good, you don’t want to be one of those mothers who pass on their\nirrational fears on their children, do you?\nRachel: Irrational, huh? All right, well, I’ll remember that the next\ntime you freak out about a spider in your apartment!\nRoss: Oh, yeah, that’s the same, I am sure there are thirty different\nspecies of poisonous swings!\n[Scene: Monica’s apartment. Somebody knocks the door]\nMonica: Oh my God, the adoption lady is early!\nChandler: Ok, ok, here we go.\nMonica: Ok.\nChandler: Here we go. Stand up straight. (smiling) Big smile. (opens the door\nand both are smiling exaggeratedly)\nPhoebe: Hello, is this the creepy residence?\nMonica: We’re waiting for the adoption lady, but, hey, I’m glad\nyou’re here. I was cleaning this morning and I found this (she puts a\nbox on the table and opens it). I don’t know if you wanna use it, but…\nPhoebe: Awe, this is so sweet of you! But you know what? I won’t be needing\na veil, I actually won’t be wearing a dress at all!\nMonica: I told you! I am not coming to a naked wedding!\nPhoebe: No, no, no, we’re not having a big reception, we took the money\nwe were gonna spend on a wedding and we donate them to the children charity.\nMonica: That’s crazy! (Phoebe looks bewildered). I am sorry. I just can’t\nimagine giving up my one wedding day like that!\nPhoebe: We, you know, we’re different! We don’t care about having\na huge party. (She picks up the veil) This is really nice for you, but, oh,\nplease, I put this on? (she puts it on) And, ow, I look (she looks her reflex\nimage on a toaster), why, well, radiant. (pause) All right, well, who cares,\nI don’t need a pretty veil and a fancy dress.\nMonica: That’s right. You’re making a commitment and that’s\nthe same, whether you do that at the Plaza or, where are you gonna do it?\nPhoebe: City Hall.\nMonica: Ow! (Chandler slaps her on her back) Oh, that sounds nice! I am just\nthere for jury duty. They really spruce that place up!\nPhoebe: It’s ok, it’s ok. I made my decision. What I really want\nis a great big wedding (she covers her mouth)\nMonica: Yay!\nChandler: But you already gave all your money to charity!\nPhoebe: Well, I’ll just ask for it back!\nChandler: I don’t think you can do that!\nMonica: Why not! This is her wedding day, this is way more important than some\nstupid kids!\nChandler: That’s sweet, honey, but save something for the adoption Lady.\n[Scene: The playground. Ross put Emma on the swing and they’re\nready to play]\nRachel: Ok, careful.\nRoss: Ok.\nRachel: Careful, watch her hair. WATCH HER HAIR!\nRoss: Rach, she’s got like three hairs!\nRachel: I know (she touches Emma’s head) but they’re just so beautiful!\nOh, my God, I just pulled one out.\nRoss: I promise you she’s safe! No watch how much she loves this.\nRachel: Ok.\nRoss (to Emma): Ready sweety?\nRachel: Ok.\nRoss: Here we go! (He starts pushing Emma)\nRachel: Ok, careful, ok. (Emma giggles) Oh, she’s smiling! Oh my God,\nshe does like it!\nRoss: See, I told you!\nRachel: Awe! (Emma laughs) Oh my God! Looks, she’s a little dare-devil!\nOh, let me push, can I push?\nRoss: Oh, absolutely!\nRachel: Ok. Oh God. (To Ross) Get the camera, it’s in the diaper bag.\nRoss: Ok! (he takes the camera and walks backwards to take a shot) See? Scared\nof swings, I bet you feel pretty silly (a swinging boy knocks him down) Ow!\n[Scene: The New York City Children's fund ]\nMike: We’re seriously asking for our money back?\nPhoebe: It’s for our wedding day! Right, now, is this guy gay or straight,\nbecause one of us gonna have to start flirting.\nCharity guy: Wow! Are you here to make another donation the same day? I don’t\nthink that that’s ever happened before.\nPhoebe (to Mike): Gay, go.\nMike (to the charity guy): Oh my God, I love your shirt!\nPhoebe: The donation we made earlier, we k…, we w…, we want it\nback.\nCharity guy: Excuse me?\nPhoebe: Yeah. See, that money was for a big wedding, that we thought we didn’t\nwant, but it turns out we do.\nCharity guy: So you’re asking us to refund your donation to the children?\nMike: Yeah! This feels really good.\nPhoebe: I am sorry. I am, but this wedding is just really important to me.\nCharity guy: Hey, it’s not my business, (he takes their check from a\ndrawer) besides it’s probably a good thing. We really would have been\nspoiling the children, all those food, and warm clothing…\nPhoebe: Hey, that’s not fair! A person’s wedding is important!\nAnd especially to me! Ok? I didn’t have a graduation party! And I didn’t\ngo to Prom. And I spent my sweet sixteen being chased round a tire yard by an\nescaped mental patient who is his own words wanted to “kill me”\nor whatever. So I deserve a real celebration and I am not gonna let some sweaty\nlittle man make me feel badly about it.( She storms out)\nMike: She could have been talking about either one of us.\n[Scene: Monica’s apartment. Somebody knocks the door]\nLaura: Hi, I am Laura, I am here for your adoption interview.\nMonica: Hi, I am Monica and this is Chandler. Please come in.\nLaura: Thank you!\nMonica: Would you like something to drink?\nLaura: Oh, water would be fine.\nMonica: Ok. Great. I am so glad that you are here. We’re really excited\nabout getting this process started.\nChandler: Oh, because we love kids. Love ‘em to death.Well, not actually\nto death, that's just a figure of speech - we love kids the appropriate amount...\nas allowed by law.\nLaura: Your place is just lovely.\nMonica: Ah, thank you. This building does have a wholesome family feel to it.\nLaura: You know, I... I feel like I've been here before. Are any other couples\nin the\nbuilding adopting?\nMonica: Is that that couple on the first floor? Because we should get a baby\nbefore\nthem. Yeah! That guy tried to sell me drugs. (Laura looks shocked)\nChandler: But other than that... wholesome, wholesome building.\nLaura: Oh...\nChandler: What?\nLaura: I just realized why I remember this place.\nMonica: Really? What is it?\nLaura: Oh, it's nothing. I went on a date with a guy who lived in this building\nand it\ndidn't end very well.\nMonica: Ohh... that wouldn't by any chance be... Joey Tribbiani?\nLaura: Yes!\nChandler: Of course it was!\nLaura: Yeah, we had a really great night and in the morning he promised he\nwould call\nme and he didn't.\nChandler: RAT BASTARD!\nLaura: So you're not friends with him?\nMonica and Chandler: OH GOD NO! Nope, no, no, no. No! No, no. Nope! No, no,\nno, no, no, no, no, no, no. NO! (finally Monica concludes) No!\nLaura: Well, I'm sorry I brought it up. So, are either one of you planning\non staying at\nhome with your child... (someone knocks on the door)\nJoey: (form the other side of the door) Hellooo? Anybody in there order a celebrity?\n(He starts to enter the apartment and Chandler runs to the door and shuts it\nback in\nhis face) OW!\nLaura: What was that?\nChandler: Oh, it's just some crazy guy who roams the halls here. He's great\nwith\nkids though.\n[Scene: Ross and Rachel are at the playground with Emma. Rachel\nin putting her back in the stroller and Ross is tending to his wound]\nRachel: Oh, oh Ross, oh my God, are you okay?\nRoss: SON OF A BITCH! (turns to his right to see three kids staring at him)\n(To the\nkids) Oh relax! I didn't say the 'F' word! (They go away)\nRachel: Ross, see! I told you, those swings are evil! Alright, that is it.\nThat is\nthe last time Emma is getting on one of those things for her entire life.\nRoss: No! No, no, no, no, okay, it wasn't the swing's fault. It was my fault\nand kind\nof that (point to the kid that kicked him) kids fault. Who is still laughing.\nNice.\nRachel: Ross, c'mon, please. Can we just get out of here, before somebody else\ngets\nhurt?\nRoss: No wait, okay, okay, I have an idea. I want you to get on the swing,\nokay? And\nyou'll see that there's nothing to be afraid of.\nRachel: (looks at him suspiciously) I know what this is all about... You've\nalways been\njealous of my hair.\nRoss: Look, I just think you're an adult, okay? And you should get over your\nsilly\nfears.\nRachel: Alright fine. I'll do it.\nRoss: Good.\nRachel: If you hold a spider.\nRoss: (He freaks out and starts jumping around brushing his sweater) WHAT?\nWHERE? WHERE?\nRachel: IF you hold a spider.\nRoss: I know. (Rachel bends down to Emma and Ross looks over his shoulder again,\nafraid)\n[Scene: Chandler and Monica's apartment. Chandler is still leaning\nagainst the door, keeping Joey out, who is still banging and shouting on the\nother side.]\nJoey: Guys? Everything ok? It's me, Joe...\nChandler: (Screams to interrupt Joey) AAAAAAAAAAAAAAAAAAAAA......AAAaaa-doption!!\nLaura: What's going on?\nChandler: Oh, just like I said. That crazy... Bert... roaming the halls. (Joey\nbangs on\nthe door again)\nJoey: Guys!?\nMonica: Keep on roaming Bert! We don't want any crazy today!\nJoey: What's going on?\nChandler: WE'LL TALK TO YOU LATER, BERT. EVERYTHNG'S FINE!!\n(cut to Joey on the other side, who finally leaves the door and goes to his\napartment)\nJoey: Everything doesn't sound fine!\nLaura: Is he alright out there by himself?\nChandler: Oh yeah! He has a caretaker. His older brother... Ernie.\nLaura: Bert and Ernie!\nChandler: (nervous smile) You can't make this stuff up!\n[Scene: Central Perk. Phoebe and Mike enter]\nMike: You never told me about that guy on your sweet sixteen. Oh, ugh. I'm\nsorry about\nthat.\nPhoebe: (Lightly) Oh! It ended okay. One of my friends shot him.\nMike: Well, hey, at least you're getting a proper wedding. I mean, you really\ndeserve that.\nPhoebe: Yeah, I really do. You know, I had nothing growing up. (thinks for\na few\nseconds) Just like the kids I took the money from.\nMike: No! No, no. I see where this is going. Don't make me go back there.\nPhoebe: Look, I can't have a wedding with this money now. It's tainted.\nMike: Alright, fine. We'll give the money back.\nPhoebe: And if that guy at the charity gives us a hard time, my friend hasn't\nshot\nanyone in a really long time.\n[Scene: Monica and Chandler's. They are preparing\nto show Laura around. Laura is standing with her back to the window, Chandler\nand Monica are standing on either side of her, facing each other.\nLaura: Well, I must say, this seems like a lovely environment to raise a child\nin.\nMonica: Oh, by the way, you are more than welcome to look under any of the\nfurniture,\nbecause, believe me, you won't find any porn or cigarettes under there!\nLaura: Oh! Well, actually, before we look around, let me make sure I have everything\nI need\nup to here...\n(She starts checking her form. Chandler sees movement near the window from\nthe corner of his eye and when he looks he spots Joey climbing up the fire escape\nand\nonto their balcony. He warns Monica silently.)\nMonica: (Pulls Laura into the spare room) Why don't I show you the baby's room?\n(Joey enters through the side window and jogs towards the kitchen holding a\nbaseball bat)\nChandler: What the hell are you doing?\nJoey: Well, you wouldn't let me in, so I thought you were in trouble.\nChandler: Well, we're not.\nJoey: But you called me 'Bert'!? That's our code word for danger!\nChandler: We don't have a code word.\nJoey: We don't? We really should. From now on, 'Bert' will be our code word\nfor danger.\n(Monica talks loudly in the baby's room)\nMonica: So that was the baby's room. (They come out and Chandler throws Joey\nbehind\nthe couch and puts his foot on him. Monica looks at Chandler)\nMonica: (To Chandler) What room should we see next?\nChandler: Any room that isn't behind this couch! (laughs nervously)\nMonica: (laughs nervously as well, Laura looks confused) (To Laura) Some people\ndon't\nget him, but I think he's really funny! (She takes Laura to their own bedroom).\n(Joey gets up and look annoyed)\nJoey: (quivering with anger) I did not care for that!\nChandler: (escorting Joey to the door) You have to get out of here. You slept\nwith\nour social worker and you never called her back and she is still pissed, so\nshe can't\nsee you.\nJoey: Ok, ok! (He leaves)\nChandler: Ok!\n(Joey leaves and closes the door behind him. Chandler walks towards the living\nroom, but then Joey enters again.)\nChandler: What?\nJoey: I forgot my bat.\n(He picks up his bat and holds it up, but then Monica and Laura enter the living\nroom again. When Laura sees Joey, she freezes...)\nLaura: Oh my God!\nChandler: And for the last time, we do not want to be friends with you! And\nwe don't want to buy your bat! (Joey lowers his bat)\nLaura: What are you doing here?\nJoey: (to Chandler) Bert! Bert! Bert! Bert!\nLaura: Are you friends with him?\nChandler: I can explain... Joey...\nJoey: Uhm... ok... uhm... Well, yeah... You have got some nerve, coming back\nhere. I can't believe you never called me.\nLaura: Excuse me?\nJoey: Oh... yeah... Probably you don't even remember my name. It's Joey, by\nthe way. And don't bother telling me yours, because I totally remember it...\nlady. Yeah! I waited weeks for you to call me.\nLaura: I gave you my number, you never called me.\nJoey: No, no! Don't try to turn this around on me, ok? I'm not some kind of...\nsocial work, ok, that you can just... do.\nLaura: (embarrassed towards Chandler and Monica) Well, I'm pretty sure I gave\nyou my number.\nJoey: Really? Think about it. Come on! You're a beautiful woman, smart, funny,\nwe had a really good time, huh? If I had your number, why wouldn't I call you?\nLaura: I don't know... Well, maybe I'm wrong... I'm sorry...\nJoey: No, no, hey, no! Too late for apologies... ok? You broke my heart. You\nknow how many women I had to sleep with to get over you? (and he leaves the\napartment, leaving her shocked)\nLaura: Joey, wait!\nJoey: (acting sad) NO! I waited a long time, I can't wait anymore... (and closes\nthe door behind him)\nLaura: (laughing nervously) I'm sorry that you had to see that. I'm so embarrassed...\nChandler: Oh, that's really ok.\nMonica: Yeah, that we totally understand. Dating is hard.\nLaura: Boy, you people are nice... And I've got to say... I think you're going\nto make excellent parents.\n(Chandler and Monica hug each other, and then Joey enters the apartment again.)\nJoey: LAURA! (and points to her, very confident)\n[Scene: The New York City Children's Fund building. Phoebe and\nMike are entering.]\nPhoebe: (to the Charity guy) We're back!\nCharity guy: Are you here to take more money? Because, I think what you're\nlooking for is an ATM.\nMike: No, no, we're here to give the money back.\nPhoebe: Yeah, because you know what, it's... it's all about the children.\n(the Charity guy smiles wanting to take the check, but Phoebe pulls it back\nagain. His smile fades.)\nPhoebe: Although... it's also about the wedding... Ugh, alright... here. (she\ngives the check and pulls it back again) No... Oh God... Oh!\nCharity guy: If I haven't said so already sir, (sarcastically pointing to Phoebe)\ncongratulations!\nMike: (takes the check from Phoebe) Ok, look! Enough! Alright? I'm stepping\nin. I'm putting my foot down! As your future husband I'm going to make this\ndecision for us. (thinking) Now... what do you think we should do?\nCharity guy: You know what? It's not your decision anymore.\nMike: What?\nCharity guy: On behalf of the Children of New York, I reject your money.\nPhoebe: But... but... but we're giving you this!\nCharity guy: Yeah... And I'm giving it back to you... Come on! Consider it\na contribution. (gives the check to Phoebe)\nPhoebe: (looks at the amount on the check, and gasps) Well, this is very generous!\nCharity guy: Please, take the check, go have a great wedding and a wonderful\nlife together.\nMike: Well, I mean... It sounds good to me. And that way we can save up, come\nback in a few years and make an even bigger donation.\nCharity guy: Absolutely! And when you do, make sure you ask for Brian.\nPhoebe: Oh, is that you?\nCharity guy: No!\n[Scene: Chandler and Monica's apartment. They are sitting in\ntheir living room when the phone rings.]\nMonica: Hello...? Oh hi... Oh my God...! Really...? I can't wait to tell Chandler...\nOk, goodbye. (hangs up)\nChandler: Wrong number?\nMonica: It was Laura... She gave us a great report and we are officially on\nthe waiting list.\nChandler: That's great!\nMonica: Now we just have to wait for a call and... and someone tells us there's\na baby waiting for us. Oh...\n(Chandler and Monica hug and after a while the telephone rings again... Monica's\neyes get bigger. Chandler answers.)\nChandler: Hello...? Have you seen Joey's bat?\nCOMMERCIAL BREAK\n[Scene: The playground. Ross, Rachel and Emma are still there.\nRachel comes walking to Ross and Emma with something between her hands.]\nRachel: Ok... I got a spider. There were two, I picked the bigger one.\nRoss: (nervously) Ok...\nRachel: Ok... (and passes the spider to Ross who holds it in between his hands)\nRoss: (Gasps and speaks at a higher pitch) This feels perfectly normal. Ok,\nget on the swing!\nRachel: (reluctantly) Ok... O-k...\n(She slowly grabs the chains of the swing, swings her hair back, and sits down.)\nRachel: (more confident) Ok...\n(She slowly walks forward and backward, to gain speed...)\nRachel: whoo... ok... wow... ok... OH!\nRoss: See?\nRachel: A-alright! I can do this.\nRoss: There you go! Good for you! And you know what, I'm actually getting used\nto this little guy. I don't really even feel him in here anymore.\nRachel: That's because he's on your neck.\nRoss: Well... (realizes, screaming like a little girl, trying to get rid of\nthe spider) Whaa... aaah... aaahhh...\n(Ross is now preoccupied with the spider, and forgets that Rachel is still\nusing the swing. While trying to get rid of the spider, he stands in front of\nRachel, who bumps into him, throwing him on the ground again.)\nRachel: ROSS!\n(Rachel tries to stop mid-swing, and the swing starts to turn from side to\nside)\nend",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/1007.html",
  "scrapedAt": "2025-12-17T14:34:02.002Z",
  "wordCount": 4252,
  "hasCharacterNames": true
}