{
  "show": "Friends",
  "season": 9,
  "episode": 6,
  "title": "Untitled Document",
  "transcript": "906 - The One With The Male Nanny (200th episode)\nWritten by: Marta Kauffman & David Crane\nTranscribed by: Coffee Mug\nRussian to Roman alphabet: Gabriela Horber\nDedicated to the great work of Eric Aasen, Guineapig and many, many more\n[Scene: Chandler's hotel room in Tulsa. He's fast asleep when the telephone\nrings.]\nChandler: (picking up the telephone, answering it with a frog\nin his throat) Hello? (he clears his throat, but he still has the same frog\nin his throat when he speaks again) Hello?\nMonica: (in her apartment, screaming) I LOVE MY NEW JOB!\nChandler: Honey, you're screaming.\nMonica: YOU BET YOUR ASS I AM! I just had the best first day\never! The kitchen: twice as big as Allessandro's.\nChandler: (yawning) Oh, that's great.\nMonica: Yeah, a-a-and clean. Not just health department clean...\nMonica clean.\nChandler: (clearly not so interested) Awesome.\nMonica: Oh, and the people are so nice. There's this one guy,\nGeoffrey, he's the Maitre D., Chandler, you will love him. He is without a doubt,\nthe funniest guy I have ever met. (Chandler, who was almost asleep again, sits\nup straight in bed in an instant and can't believe what he just heard.)\nOPENING CREDITS\n[Scene: Central Perk. Phoebe and Mike are on the couch, holding hands, while\nPhoebe puts milk in her coffee.]\nMike: This is nice.\nPhoebe: I know! (Phoebe picks up a little packet of sugar,\nshakes it, and then realises she can't open it with one hand, but doesn't want\nto let go of Mike's hand. She tries to tear open the packet with one hand.)\nMike: You need both hands for that?\nPhoebe: Yeah, I kinda do. (Mike lets go of her hand) Well,\nhow's this? (she takes Mike's hand and puts it on her breast, she tears open\nthe sugar and puts it in her coffee. Mike thinks it over and nods appreciative.\nAfter that, they hold hands again. Joey now enters, and sees the two sitting\non the couch, holding hands.)\nJoey: (in a very aaaaahhhhh sweeeeeet voice) Aaahhh, look\nat you two... holding hands... huh is this getting serious? (Phoebe and Mike,\nembarrassed, start babbling and look away.) Have you not talked about it yet?\n(They say nothing now, but smile) Am I making you uncomfortable? (smiles are\nbecoming forced now, and he speaks to Mike) If you were bigger you'd hit me,\nhuh...? Aaaaaahhhhhh (he turns away to the bar)\nPhoebe: I'm sorry... I'm sorry. It's obviously way too early\nfor us to be... having that conversation.\nMike: Is it?\nPhoebe: (in a flash she answers) Maybe not, is it?\nMike: Okay, when I got divorced, I didn't think I'd feel this\nway about someone for a really long time... Then again, I didn't think I'd meet\nsomeone like you... and... this may be crazy soon, but... I want you to have\nthis... (He tries to get something from his pocket, but it's not that easy...\nPhoebe looks in a \"what's happening\" face to him. He finally has found\nsomething) No, not... that's gum. (He digs in a little more.) Ooh, five bucks...\nI love it when that happens, you know... Think no note's there...\nPhoebe: (impatient) I know Mike, why don't you keep digging?\nMike: Oh, sorry. (He digs in again and finally finds what\nhe's been looking for. A key.)\nPhoebe: Oh, it's a key. To be honest, I think I'd prefer the\nfive dollars.\nMike: It's to my apartment.\nPhoebe: (really surprised) Oh wow, ooh! Ooh, big step for\nPhoebe and Mike.\nMike: Yeah, look, and I don't want you to feel like you have\nto give me your key just because...\nPhoebe: Oh no, I want to.\nMike: Oh, thank God. (he laughs nervously, and Phoebe gets\nher keychain from her bag.)\nPhoebe: Yeah... ooh... wow... Even started to think I'd never\nmeet someone that, you know, I wanted to... do this with. Here you go. (Both\nPhoebe and Mike look really proud.)\nMike: Is this cool, huh?\nPhoebe: It really is.\nJoey: (sitting at his table) Oh, I know it... It\nis amazing these little things open doors... huh! (mimes opening a door with\nhis own keys, Phoebe looks at him in a \"yeah, yeah, yeah\" way.)\n[Scene: Ross and Rachel's apartment. Both of them sitting on the couch, interviewing\na nanny candidate.]\nRachel: So I don't go back to work for another four weeks,\nbut we would like our nanny to start right away, so that Emma could get a chance\nto know her.\nProspective nanny: (in a sweet, caring voice) I think that's\nreally smart. The easier we can make the transition for her, the better. (Ross\nand Rachel seem pleased with the answer.)\nRachel: That's great, great. So do you have any questions\nfor us?\nProspective nanny: Not really.\nRachel: Allright. Well thank you so much for coming... (they're\nstanding up and make their way to the door)\nRoss: Thank you.\nRachel: Really nice to meet you... and we'll call you.\nProspective nanny: Oh, you know, wait. I do have\none question. (she starts playing with her hair) Do you guys do random drug\ntesting?\nRoss: Boy, we uhm... hadn't really thought of that.\nProspective nanny: That's cool. But... but if you do, I'm\ngonna need three days notice.\nRachel: Okidoki! (and she slams the door in the nanny's face\nwhile Ross crumples up the application form) Wow! We're never gonna find a nanny.\nRoss: Oh, come on Rach, we will. I promise. We have more interviews\n(They sit down and Rachel sighs) And worse comes to worse, we can always reconsider\nthe uhm... the first one we met with.\nRachel: (indignant) What, the blonde with no bra?\nRoss: She was blonde? (he looks surprised for a while, but\nthen gets a \"gotcha\" expression on his face... There's knocking at\nthe door.) Just a sec.! Okay, okay. This one's name is Sandy. She's got a degree\nin early childhood education, uhm... she worked for her last family for three\nyears.\nRachel: Okay... (Ross opens the door.)\nSandy: (a guy) Hi... I'm Sandy.\nRoss: And she's a little mannish...\n[Scene: Phoebe's apartment. There's a knock on the door, and Phoebe opens it.]\nPhoebe: (gasps) Oh my God! David!\nDavid: Hi! I-i-is this a bad time?\nPhoebe: (excited) No! It's a great time, come in...! WOW,\nhi... Oh my gosh! What are you doing here? Are you back from Minsk?\nDavid: Well, just for a couple of days, uhm... I'm here to\nexplain to the people who gave us our grant, why it's a positive thing that\nwe spent all their money and uhm... accomplished uhm... nothing.\nPhoebe: Who cares, it got you here.\nDavid: Well, it got me to New York anyway, and then I got\non a cab at the airport, and the guy said where to? and I just... gave him your\naddress I... I... I didn't even think about it.\nPhoebe: Wow. Where is your luggage? (David thinks for a while)\nDavid: Damn it!\nPhoebe: A-Allright, well... I'll call the cab company.\nDavid: Wa... wa... wait! We can... call them later. Can you\njust... just stand there f-f-for a moment? Boy! There's an old Russian expression,\nuhm... it goes: Schto ya ztez vigul... ui! Roughly translated that\nmeans uhm... This thing that I'm looking at: wow!\nPhoebe: Thank you! God, no! You should see me when... Oh actually,\nno, I look pretty good.\nDavid: Are... are you kidding? You know, when you don't see\nsomeone for a long time, a-a-and you kind of build them up in your head and\nyou start thinking about: Come on, don't be crazy. Nobody is that beautiful,\nbut... well, you are. (Phoebe seems very charmed) Well, so, uhm... are you seeing...\nanyone? (Phoebe is still up on a cloud from what David just said)\nPhoebe: No...\n[Scene: Monica and Chandler's apartment. Monica sits on the couch and Phoebe\nis pacing up and down the room.]\nPhoebe: I'm... I'm just... I'm the worst person ever. How\ncan I not tell David that I'm seeing Mike?\nMonica: Maybe he didn't give you a chance.\nPhoebe: He said: Are you seeing someone? And I said no...\nMonica: Oh, well... That had been your window.\nPhoebe: Yeah! I mean, I don't know. I was just , I was looking,\nI was looking in his eyes and I was just thinking: Oh my God! It's David. David's\nhere. He's just, he's so irresistible.\nMonica: Really? The scientist guy?\nPhoebe: Really? Chandler?\nMonica: Continue...\nPhoebe: Oh.Okay, then it gets worse, 'cause then I told him\nthat I would see him tomorrow night.\nMonica: Phoebe!\nPhoebe: I know! (points at herself) Evil! And... and... and...\nI like Mike so much, you know. It's just going really well. Oh my God!\nMonica: Wow, isn't it ironic that David would show up on the\nsame day that you and Mike exchange keys?\nPhoebe: (sarcastically) Uhuh... Yeah...!, you know. And given\nmy life long search for irony, you can imagine how happy I am.\nMonica: What are you gonna do?\nPhoebe: I mean I guess, I just have to... tell David that\nnothing can happen between us. Unless I don't... You know, complicated\nmoral situation, no right, no wrong...\nMonica: You have to tell David!\nPhoebe: Okay, I knew I should have had this conversation\nwith Joey.\n[Scene: The hallway between the two apartments. Chandler comes home.]\nChandler: (angry) Funniest guy she's ever met! (to the door)\nI'm funny, right...? What do you know, you're a door... You just like knock-knock\njokes... (laughs about himself, but then gets determined again) Save it for\ninside! (he enters)\nMonica: Heeeeeey!\nChandler: Hey!\nPhoebe: Hey!\nChandler: So... Oklahoma is a crazy place. You know, they\ncall it the Sooner state. Frankly I'd sooner be in any other state. (Monica\nlooks at Phoebe, who also doesn't know what to say.) And what's with Oklahoma\nhaving a pan handle? Can all states have stuff like that? Hey yeah, I'm from\nthe waistband, Wyoming. But when I was seven, we headed over to the crotch.\nMonica: (Doesn't believe what she's hearing) Was your cabin\npressurised?\nChandler: (laughs, but then moves to Phoebe) And don't get\nme started on the way that people from Tulsa talk.\nPhoebe: Okay. (and she walks away)\nChandler: What's with the word y'all? You know, just... two\nwords just... pushed together... Are we all allowed to do that, because if so,\nI say why stop there? You know, your new poodle could be your noodle. And fried\nchicken? Could be fricken.Waiter, waiter excuse me, I'll have the fricken? (Monica\nlaughs) See, that's... that's funny with the fricken, right?\nMonica: No, it just remind me of something this guy did today\nat work. I told you about that funny guy, Geoffrey, right?\nChandler: Yeah, he came up...\nMonica: Well, he did this bit... You probably had to be there,\nbut it was Liza Minelli locked in our freezer, eating a raw chicken. (Phoebe\nbursts out in a laugh)\nChandler: (to Phoebe) Were you there?\nPhoebe: No, but it sounds like it was fricken funny...\n[Scene: Ross and Rachel's apartment. They're interviewing Sandy.]\nSandy: I really do understand how hard it's gotta be to leave\nyour child with another person. I mean, it's leaving behind a piece of your\nheart... (Ross has got that bored/angry/skeptic look and Rachel is very emotional)\nRachel: Sandy, that's exactly what it is...\nRoss: Are you gay? (Rachel turns to Ross in an embarrassed\nway)\nRachel: Ross!\nSandy: It's okay. I get that a lot doing what I do. But I\nam straight. I-I'm engaged actually.\nRachel: Oh!\nSandy: Her name is Deliah.\nRachel: Oh, that's pretty.\nRoss: (skeptic) So you're just like a... guy who's a nanny?\nSandy: I realise how it's... a bit unorthodox for some people,\nbut I really believe, the most satisfying thing you can do with your life, is\ntake care of a child.\nRoss: (on a yeah, right tone) Okay.\nSandy: Like in my last job, I met Daniel when he was three\nweeks old. And I got to watch him grow into this awesome person...\nWhen I left, I said: I'll see you soon... And he said to me: Skdandy... (Ross\nand Rachel look puzzled) That was his name for me... I'll see you every day...\nright in... (points at his heart, but starts to cry before he can finish his\nsentence. Rachel tries to comfort him, but Ross has this \"you've got to\nbe kidding me\" look all over him)\nRoss: Yeah, kids say all kinds of crap. (In the other room\nEmma starts to cry.)\nRachel: Oh God, she mu... she must need her diaper changed.\nSandy: Oh, oh, I can do it for her, if you want...\nRachel: Oh, that would be great! (Sandy leaves for Emma's\nroom) I love him, I love him, I love him...\nRoss: Oh, come on, Rach, he's a guy!\nRachel: So wh..? He's smart, he's qualified. Give me one good\nreason we shouldn't try him out.\nRoss: Because, it's weird!\nRachel: Why?\nRoss: What kind of job is that for a man? A nanny? I-It's\nlike if a woman wanted to be...\nRachel: (she's got that \"yeah, try to say it\" look\non her face) Yes?\nRoss: King?\nSandy: I er... I hope you don't mind. I used some of my home-made\nlotion on Emma. It's a mixture of calendula and honey cream. It'll dry that\nrash right up. Plus... It keeps the hands young... (it makes Rachel smile)\nRachel: (whispering and begging) Please? (Ross makes a \"whatever\"\ngesture) YES! Sandy you're hired.\nSandy: That's great! (He gets emotional again and waves his\nhand in front of his face in a feminine way, like trying to dry his tears) I'm\nsorry. It's just... such an emotional thing when you're welcomed into a new\nfamily...\nRachel: Oooh... ***I really can't hear what she says*** come here.\nRoss: You gotta be at least bi...\nCOMMERCIAL BREAK\n[Scene: Joey's apartment. Joey is reading a 'Busty Ladies' magazine when Chandler\nenters.]\nChandler: Hey! (Joey doesn't look up, but gestures 'wait a\nminute' with his finger while he finishes reading the article. Chandler waits\nfor Joey to finish.) I need you to set me up for a joke. Later, when Monica\nis around, I need you to ask me about fire trucks.\nJoey: Ooh. I-I don't know Chan. I'm not so good with remembering\nlines.\nChandler: (Can't believe what he hears) Well, thank God your\nlivelihood doesn't depend on it.\nJoey: I know, right? (Chandler has really big eyes, and nods)\nWh... Wh... Why are we doing this?\nChandler: Monica says that her Maitre D. is the funniest guy\nshe's ever met.\nJoey: Seriously? She actually said that?\nChandler: Yes! Am I crazy to be this upset?\nJoey: Nooooo! Being funny is your thing!\nChandler: Yeah!\nJoey: Without that, you just got \"lame with women\".\nChandler: Ye.... (stops because he realises what Joey just\nsaid, and stares at him. At this moment Monica enters)\nMonica: Hi! There you are.\nJoey: (sees Monica) Fire trucks! (Chandlers eyes double in\nsize and he turns to Monica who doesn't understand what's happening. Then he\nturns back to Joey, who says \"you're welcome\" without a sound)\n[Scene: Phoebe's apartment. Phoebe just let David in who brought a bottle of\nwine.]\nDavid: Wow, you look even... more beautiful than you did yesterday.\nPhoebe: Oof...\nDavid: In fact, ehm... I going to kiss you now. (David holds\nPhoebe and wants to kiss her.)\nPhoebe: Oh, wait, wait!\nDavid: Yeah, I-I don't, I can't get away with stuff like that.\nI-I-It sounded sexy in my head, so I...\nPhoebe: No, no, it's not that. (they go sit on the couch)\nUhm... Remember when you asked me if I was seeing someone and I said no? Well,\nuhm... I am. His ... his name is Mike.\nDavid: Oh... oh...\nPhoebe: Yeah, I should have told you.\nDavid: No... well, yeah.\nPhoebe: I'm sorry, I'm sorry.\nDavid: Well, i-it's okay. I-I-I understand... Well, s... well,\nare you happy with this guy?\nPhoebe: I am happy.\nDavid: Damn it! I-I'm sorry. I-I don't mean that. I-I want\nyou to be happy... But only with me. No, uhm... that's not fair. Uh, who cares,\nleave him!. Oh, I don't mean that. Yes I do... I'm sorry Uhm, I... I think I\nshould probably uhm... go...\nPhoebe: Well... but David, just... I just want you to know\nthat... that... you know... telling you this... is one of the hardest things\nI've ever had to do.\nDavid: Well... just so you know... hearing it wasn't exactly\na Vladnik carnival either... Can we at least hug goodbye?\nPhoebe: Of course, yeah.(they hug and Phoebe sighs... a little\nafter that also David sighs and makes his way to the door) You know, a kiss\non the cheek wouldn't be totally inappropriate...\nDavid: No... no...\nPhoebe: I mean... (David kisses Phoebe on the cheek, makes\nhis way to the door and turns around again)\nDavid: In Minsk...\nPhoebe: Yeah?\nDavid: ...it's uhm... i-it's two on each cheek and uhm...\nand one on the lips.\nPhoebe: Well, if that's what they do in Minsk... (They kiss\n2 on each cheek... and then they pause... David turns to the door) In New York...\nit's... (and then David grabs her by her neck and kisses her full on the lips...\nThey kiss passionately and cannot seem to stop.)\n[Scene: Ross and Rachel's apartment. Rachel and Sandy sit on the couch. Sandy\nholds Emma. Ross enters the apartment. Sandy and Rachel wipe their tears away\nwith handkerchiefs]\nRachel: (in a tearful voice) Oh... Oh boy... (she turns around\nand sees Ross) Hi...\nRoss: (very worried) Is everything allright?\nRachel: Oh yeah, it's fine, it's fine. Sandy was just... was\njust telling me about how he proposed to his fiancée and it was just\nsooo beautiful.\nSandy: Well, her favourite flower is the camellia. From the\npoem...\nRachel: I can't... I can't hear it again.\nSandy: You know, I can't tell it again... (wipes his tears\nagain)\nRoss: And I'm fine never having heard it... (Rachel looks\nat Ross in a \"why do you say that\" manner) Rach, can I... can I see\nyou for a sec?\nRachel: Yeah! (to Sandy) Excuse me... (She walks to the kitchen\nwith Ross and sighs)\nRoss: Do you realise that man has cried in our apartment three\ntimes...? Huh? I haven't cried that many times since I moved in.\nRachel: Look, Ross, he's just... Sandy is just sensitive,\nthat's all.\nRoss: (picks up a cookie) Okay, okay, see... that... that\nis the problem. He is too sensitive. (takes a bite from the cookie)\nRachel: What...? Too sensitive to take care of our baby?\nRoss: (speaking with his mouth full) Yeah, I mean, all things\nthat guy... (looks at the cookie) These are amazing!\nRachel: Sandy made Madeleines.\nRoss: This... this is exactly what I'm talking about. What\nkind of a guy makes... makes... delicate French cookies, huh? They're not even...\nbutch, manly cookies with... with... you know with... with chunks. (takes a\ncareful bite from the cookie)\nRachel: Well, I... you know, I-I-I don't know what to say...\nI mean, I never thought of you as a guy who needed his men to be men.\nYou know, 'cause I gotta tell you Ross, it not like you just came in\nfrom branding cattle.\nRoss: Hey... there's sensitive... and there is too sensitive.\nRachel: Okay, what? What is too sensitive? (There's\nmusic coming from the living room. Ross opens the door to the living room and\nhe and Rachel see Sandy play a song for Emma on his recorder. Rachel is moved\nby this, but Ross only sees his point proven again, and walks back into the\nkitchen, angrily. The door he was holding, swings back and hits Rachel.)\n[Scene: Phoebe's apartment. She and David are still kissing each other in the\nliving room.]\nPhoebe: Hmmm... No, no... No, I can't do this. It's bad.\nDavid: But... I-I-It's nice... A-a-and... nice is good. A-a-and\ngood is not bad, ergo, w-w-we should keep kissing.\nPhoebe: No, no. No.\nDavid: But... ergo...\nPhoebe: Look David, if... if you had never left, then... yeah,\nwe'd probably still be together right now, but... you did leave, and I-I'm with\nMike and I really care about him...\nDavid: Uhm... uhm... Goodbye... Uh... Schto ya ztez vigul...\nui... (David holds his hands gently on the back of Phoebe's neck. There's\na sound of a a bunch of keys rattling, and the door opens... It's Mike)\nMike: Well... hey, the key works...! (he looks as if he doesn't\nwant to believe what's happening)\nPhoebe: (points to David) And you thanks for the\nface massage. Thank you.\n[Scene: Monica and Chandler's apartment. Monica is in the kitchen and Ross\nenters.]\nRoss: Did Rachel tell you we hired a male nanny?\nMonica: Yeah! I think that's great!\nRoss: Oh really? Did she tell you he plays the recorder, recites\npoetry and bakes Madeleines?\nMonica: Oh... How are they?\nRoss: (looks like in heaven) Lighter than air... (changes\nback to serious) But that's not the point. (Joey now also enters)\nJoey: Hey!\nRoss: Hey...! Rachel and I hired a male nanny.\nJoey: (looks surprised) Really...? Guys do that...? That's...\nweird...\nRoss: Thank you!\nJoey: That's like a woman wanting to be a...\nRoss: ...a what? A what? What's the end of that sentence?\nMonica: Yes... What is the end of that sentence?\nJoey: Uhm... A penis model. (Monica can't believe what's she's\nhearing and Ross pats Joey on the back.) Anyway, hey... Did you tell Chandler\nthat some guy from work is the funniest guy you've ever met?\nMonica: Yeah, so?\nRoss: Wow!\nJoey: Really? Do you not know Chandler?\nMonica: Is that why he's acting so weird...? He's jealous...?\nOh my God, that is crazy. It's not like I'm attracted to Geoffrey...\nJoey: So what? Being funny is Chandler's thing...\nYou know, like Ross's thing is... (he can't come up with anything)\nRoss: Science...? Academia...? Being a good father...?\nJoey: ...No... (he just can't seem to grasp it)\nMonica: I can't believe he's that upset about this...\nJoey: Monica, you have to do some damage control here, okay.\n'Cause he's feeling like... (the door opens and Chandler walks in with a pizza)\nChandler: Hey!\nJoey: Heeeyy! Hey!\nChandler: What are you guys talking about?\nRoss: Uhm... Rachel and I hired a male nanny. (Joey makes\na gesture and sound like \"Can you believe that?\")\nChandler: You got a man who's a nanny...? You got a manny...?\n(Monica starts laughing, but very exaggerated. Joey realises they also should\nlaugh and punches Ross. Now all three of them laugh, but very fake. Chandler\nseems happy again.)\nChandler: You know, I don't mind a... male nanny, but I do\ndraw the line at a male wetnurse. (again they laugh, even more fake than before)\nMonica: Ohhh, ooohhh... you are on a roll, mister!\nChandler: If I'd known you guys were coming over, I would\nhave brought more pizza. (they all burst out in a thundering laugh)\nMonica: Okay, okay... Chandler you... you stop it! (Monica\nwipes away tears)\nChandler: What is so funny about that? (they realise\nit wasn't a joke)\nMonica: Well, I don't know... I-It's... just the way you say\nit... I mean, you're funny... You have that funny thing. You're a funny guy!\n(Chandler turns to Joey)\nChandler: Did you tell her what we talked about? (Joey starts\nlaughing hysterically, but then gets serious again...)\nJoey: Yeah....\nChandler: So those were pity laughs? PITY LAUGHS? (Joey and\nRoss walk away from the kitchen)\nMonica: Honey, listen... You have nothing to worry about with\nGeoffrey.\nChandler: Oh yeah? Is he funnier than me?\nMonica: Well, you're... you're different funny... I mean,\nyou're... you're more sarcastic a-a-and... well, he does... bits... and impressions...\nand... and limericks...\nChandler: I do limericks... uhm... There once was a man named\nChandler, whose wife made him die inside.\nMonica: Honey, you know I think you're hilarious! Come on,\nyou know that joke you told me last week? The one about Jerry Lewis and the\ngirl with the lazy eye...? (he laughs) That slayed me.\nRoss: Hey... I made up that joke and told it to you! (He points\nat Chandler. Joey gestures to Ross \"What are you doing?)\nJoey: Not knowing when to shut up...\nRoss: Yep! That's my thing...\nCOMMERCIAL BREAK\n[Scene: Phoebe's apartment. David is still there. Mike closes the door.]\nMike: So... how many guys have your key?\nPhoebe: No, no, no, no, no... It's not... it's not... i'ts\nnot as bad as it looks... really. I was just saying goodbye to an old friend.\nMike: Your lipstick's on his mouth.\nDavid: Oh, uh... we just uh... happen to wear the same shade.\nPhoebe: No, uhm... David and I did use to go out... but years\nago, and he lives in Minsk. He's only... he's only in town for a couple of days.\nMike: Did you uhm...\nPhoebe: No, no...\nMike: ...kiss him?\nPhoebe: Oh, well, yeah...\nDavid: Yes, but uhm... You should know... she really likes\nyou. I-In fact I-I-I don't think you realise j-just how lucky you are fella.\n(he points at Mike)\nMike: Don't point your finger at me.\nDavid: Why? Wh-What are you going to do about it?\nMike: Well... I'll... just show you what I'm gonna do about\nit... (he hits David's finger with his finger and they start to finger-fight\nusing their fingers as swords saying all kinds of macho crap)\nPhoebe: Stop it! Stop it, before someone gets really hurt!\n(they stop and Phoebe gets David's jacket and gives it to him) Here David, you\nshould just go.\nDavid: Allright... But... if I ever do come back\nfrom Minsk... (points at Mike) well, you just better watch out.\nMike: Well, if I ever goto Minsk, you'd\nbetter watch out.\nDavid: Oh, you're going to Minsk?\nMike: Well, I might.\nDavid: Really? Well, if you do, come in the spring. It's just\nlovely there.\nPhoebe: Okay, well... guys?\nDavid: Right... Goodbye Phoebe. (Makes a move to kiss her.)\nMike: Hey, what are you kidding me?\nDavid: Right-o, right-o... (to Mike) Take good care of her.\n(and he leaves)\nPhoebe: I'm sorry, I'm so sorry. If you... If you want your\nkey back, I totally understand.\nMike: It's never gonna happen again right?\nPhoebe: Right! Never! Never! I swear! (They kiss... The door\nopens and David comes in again.)\nDavid: I-I... Oh I...I just wanna say uhm... if you do ever\ncome to Minsk, that's my number (gives Mike a business card) We'll uhm... we'll\nparty up Vladnik style. (He leaves again)\n[Scene: Ross walks in the hallway to his apartment and stops in front of his\nown door. Now he hears two recorders playing a song. When he enters, Sandy and\nJoey are playing the recorder and Rachel listens.]\nJoey: Yeah! Allright! Hey, hey Ross. Check it out! Sandy taught\nme Hot-cross Buns.\nRoss: Really? Sounded like Three Blind Mice.\nJoey: Noooo... Three Blind Mice goes like this... (he puts\nhis fingers in position on the recorder)\nRoss: (looks angrily at Joey and points at him) I swear to\nGod...! (Joey is in shock)\nSandy: Who's up for puppets?\nJoey: Me! I'm up for puppets!\nSandy: Well, please welcome... The Snufflebumps... Who wants\nto be mr. Wigglemunch and who's gonna be the Grumpus?\nRoss: Okay, okay... How exactly is a two month old supposed\nto appreciate puppets?\nSandy: Actually studies have shown that the movement and colours\nhelp their cerebral development... The whimsical characters are just for us.\n(He winks to Joey and Rachel. Ross's face says he disapproves. Joey sees that\nand kind of angrily says...)\nJoey: I wanna be mr. Wigglemunch. (and makes a \"there\"\nnod to Ross)\nRoss: (shakes his head) Oh my God!\nSandy: Well, I guess we know who's gonna be the Grumpus...\n(Ross goes to the kitchen)\n[Scene: Ross and Rachel's kitchen. Ross got a beer from the refrigerator and\nopens the bottle. Rachel now also enters the kitchen.]\nRachel: That was kind of rude!\nRoss: Oh, I'm sorry. Please apologise to Sandy and the Snufflebumps\nfor me.\nRachel: You know, he was just doing his job...\nRoss: Well, you know what... I-I'm sorry I'm the only one\nwho isn't in love with Gary Poppins out there... But I just... I can't... I\ncan't go through with this.\nRachel: Oh, come on Ross...\nRoss: No! Hey, you know what? I'm sorry. I would never force\nyou... to hire someone you were this uncomfortable with...\nRachel: (sighs) Oh... That's true.\nRoss: Thank you!\nRachel: Well, you're the one who wants to fire him, so you're\ngonna have to do it. (Ross walks to the living room determined to fire Sandy)\n[Scene: Living room. Joey and Sandy are talking with the Snufflebumps.]\nSandy: (In a puppet voice) So you see Wigglemunch, that's\nwhy it's important to shaaaaaaare...\nJoey: (kind of emotional) I am learning so much from you.\n[Scene: Monica and Chandler's apartment. Monica and Joey are sitting at the\ndinner table. Chandler comes from the bedroom with his suitcase.]\nChandler: Well, I'm off to Tulsa, so if your Maitre D. friend\nhas any funny Oklahoma jokes, tell him to e-mail me at www.hahanotsomuch.com.\nMonica: Honey, you can relax. Last night at work, Geoffrey\ntold this really sexist joke. After that, not so funny anymore.\nChandler: Really...? See... that's the thing: you gotta keep\nit smart, people!\nMonica: Okay, don't miss that flight. You know I love you.\nChandler: I love you too. (Monica and Chandler kiss. He turns\nto Joey.) And... I like you as a friend. (They hug and pat each other on the\nback.)\nJoey: Allright. See you later!\nChandler: See ya! (he leaves the apartment)\nJoey: (to Monica) Did that guy really make that joke?\nMonica: Naaaa... He still kills me. Last night he had me laughing\nso hard, I swear... a little pee came out.\n[Scene: Ross and Rachel's apartment. Sandy is knitting baby clothes. Ross and\nRachel walk into the living room.]\nRoss: Here goes...\nRachel: I can't watch. It's like firing Elmo. (Ross walks\nto the couch where Sandy sits)\nRoss: Sandy... Hi, we uhm... we kinda need to talk. I'm afraid\nit's not working out.\nSandy: (surprised) Oh...\nRoss: Yeah, uhm... I mean, Rachel and I, think you are great...\nwith Emma... uhm... We just feel...\nRachel: (from behind the bedroom door) YOU! You feel!\nRoss: I... just feel that the... the chemistry isn't right.\nI'm sorry. We're... we're more than happy to give you good recommendation...\nSandy: Oh, no, no, no... That's okay. I got a lot of offers\nfrom other families. I just picked you guys because... I liked you the best.\nRachel: (from bedroom) Oh, damn you Geller!\nRoss: Anyway, uhm...Well, I'm glad there's no hard feelings.\nSandy: No, none at all. You need to be happy with whoever\nis in your home... Although if you don't mind telling me, what was your problem?\nMaybe it's something I can work on in the future.\nRoss: No, you know, it's uhm... nothing you did, it's... it's\nuhm... my issue.\nSandy: What is it...? (Ross hesitates) Please...? (he tilts\nhis head)\nRoss: You know, I'm just not uhm... that comfortable with\na guy who's as sensitive as you.\nSandy: That's fair... Although, can I ask... why do you think\nthat is?\nRoss: Why... I... I don't know. (Sandy tilts his head again)\nUhm... errrr... maybe... maybe because of my father?\nSandy: hmmm... (and shakes his head)\nRoss: I mean, uhm... you know when I was growing up he was\nkind of a tough guy... You know a-a-and as a kid I wasn't the athlete I am now.\nRachel: (from the bedroom) Huh ha ha!\nRoss: I play squash...! Anyway, uhm... I uhm... I always get\nthe feeling he thought I was too sensitive.\nSandy: That must have been hard.\nRoss: It was hard... I remember... I was in my bedroom...\nplaying with my dinosaurs... playing and learning... and my father\nwalks in and says... he says... \"What are you doing with those things?\nWhat's wrong with you, why aren't you... why aren't you outside playing like\na... like a real boy?\nSandy: But you are a real boy!\nRoss: I know I am! (Ross now starts to cry) ...And when it's\nsummer, and it's hot, why can't you wear a tank top?\nSandy: It's allright! Crying is good. It lets the boo-hoos\nout.\nRoss: Here come some more...\nCOMMERCIAL BREAK\n[Scene: Joey's apartment. Joey and Sandy are sitting at the kitchen counter.\nJoey is holding mr. Wigglemunch, and Sandy holds the Grumpus.]\nSandy/Grumpus: And what's the one kind of boat that can never,\never sink?\nJoey/Wigglemunch: What kind?\nSandy/Grumpus: A friend-ship...\nJoey: Wow! You blow my mind...\nSandy: Oh, I gotta go.\nJoey: Aaahh... How much do I owe you?\nSandy: Twenty bucks.\nJoey: It's like the cheapest college ever.\nEND",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0906.html",
  "scrapedAt": "2025-12-17T14:33:24.535Z",
  "wordCount": 5516,
  "hasCharacterNames": true
}