[
  "What does Ross say nobody is allowed to climb on at work?",
  "What is Rachel's initial impression of Ross when she imagines him as Alan Alda?",
  "What is the name of the superhero that Chandler would like to be?",
  "What is the reaction of the gang when Joey announces he has a new gig?",
  "What is the name of the character Joey is auditioning for in the soap opera?",
  "Why does Ross agree to go to dinner with Rachel's father?",
  "What is Dr. Green's nickname for Ross?",
  "What is the reason for Ross's allergy to lobster?",
  "What does Phoebe do when she tries to hide the race car bed from Monica?",
  "Why does Joey advise his student to play the role of Nick the boxer 'supergay'?",
  "What is the name of the doctor that Rachel sees for her alignment issues?",
  "What is the reason for Monica's distress when she sees the race car bed in her bedroom?",
  "What is the reaction of Joey's students when he tells them about his experience with the audition for Nick the boxer?",
  "What is the name of the soap opera that Joey is teaching his students about?",
  "What is the reason for Chandler's surprise when he sees the race car bed in Monica's bedroom?",
  "What does Ross do when he sees the bill for dinner with Dr. Green?",
  "What is the name of the restaurant where Ross and Rachel have dinner with Dr. Green?",
  "What is the reason for Phoebe's apology to Joey after their boxing match?",
  "What is the reaction of Dr. Green when he finds out that Ross added a large tip to the bill?",
  "What is the reason for Monica's distress when Chandler sees the race car bed in her bedroom?",
  "What does Joey do when he finds out that his student got the role of Nick the boxer?",
  "What is the reason for Ross's frustration with Dr. Green?",
  "What does Phoebe do when she is trying to hide the race car bed from Monica?",
  "What is the reason for Chandler's surprise when he sees the race car bed in Monica's bedroom?",
  "What does Ross do when he sees the bill for dinner with Dr. Green?",
  "What is the name of the character that Joey is auditioning for in the soap opera?",
  "What is the reason for Phoebe's apology to Joey after their boxing match?",
  "What is the reaction of Dr. Green when he finds out that Ross added a large tip to the bill?",
  "What does Joey do when he finds out that his student got the role of Nick the boxer?",
  "What is the reason for Ross's frustration with Dr. Green?",
  "What does Phoebe do when she is trying to hide the race car bed from Monica?",
  "What is the reason for Chandler's surprise when he sees the race car bed in Monica's bedroom?"
]