[
  "What product does Joey advertise in the info-mercial?",
  "Why did Phoebe take the blame for Joey missing his audition?",
  "What is the name of the doll that Ben is attached to?",
  "Why did Chandler give Janice a drawer?",
  "What advice do Rachel and Monica give Chandler about how to deal with Janice?",
  "What is the name of the accent that Joey tries to use when he says 'I canna work on a new accent'?",
  "Why did Phoebe pretend to be Joey's agent?",
  "What is the reason for Chandler's British accent when he runs into Janice at the grocery store?",
  "What is the outcome of Chandler's conversation with Janice after he pretends to be British?",
  "What is the advice that Rachel and Monica give Chandler when Janice calls him?",
  "What is the outcome of Chandler's conversation with Janice after he pretends to be asleep and grumpy?",
  "What toy does Ross try to get Ben to play with instead of the Barbi doll?",
  "Why does Ross want Ben to play with G.I. Joe instead of the Barbi doll?",
  "What is the reaction of Carol and Susan when they find out that Ben is playing with a Barbi doll?",
  "What is the name of the product that Joey advertises in the info-mercial, which is used to open milk cartons?",
  "Why does Phoebe pretend to be a agent on the phone?",
  "What is the result of Phoebe's phone call to the casting director?",
  "Why does Joey want Phoebe to continue pretending to be his agent?",
  "What is the reason for Chandler's fear of commitment?",
  "What is the advice that Joey gives Chandler about how to deal with his fear of commitment?",
  "What is the outcome of Chandler's attempt to face his fear of commitment?",
  "What is the reason for Janice's initial reaction to Chandler's attempt to face his fear of commitment?",
  "What is the outcome of Phoebe's decision to pretend to be Joey's agent?",
  "What is the reason for Ross's initial reaction to Ben's attachment to the Barbi doll?",
  "What is the outcome of Ross's attempt to get Ben to play with G.I. Joe instead of the Barbi doll?"
]