[
  "What does Chandler say Snoopy should not be allowed to do?",
  "Why does Ross want to sell Brown Bird cookies?",
  "What is Phoebe's objection to Joey's job selling Christmas trees?",
  "What does Rachel decide to do after talking to Chandler and Joey about her job?",
  "What is the name of the company where Rachel gets a job interview?",
  "Why does Ross sell a large number of Brown Bird cookies?",
  "What is the outcome of the Brown Bird cookie sales contest?",
  "What does Rachel do on her last night working at Central Perk?",
  "What is the name of the little girl whose leg Ross breaks?",
  "What is the 'tray spot' that Gunther mentions to Rachel?",
  "What does Ross create for Sarah after she doesn't get to go to Spacecamp?",
  "What does Phoebe see happening to the old Christmas trees at Joey's work?",
  "Why does Monica start eating the Brown Bird cookies?",
  "What does Joey use to decorate Monica's window for Christmas?",
  "What does Rachel finally get at the end of the episode?",
  "What is Ross's excuse for buying a large number of Brown Bird cookies?",
  "What is the name of the drink that Mr. Kaplan Sr. likes strong?",
  "What is the reaction of the gang when Rachel announces she got the job at Fortunata Fashions?",
  "What does Gunther do when Rachel announces she is quitting her job?",
  "What is the reason for Phoebe's emotional reaction to the Christmas trees?",
  "What does Joey try to do to help Rachel after she quits her job?",
  "What is the result of Ross's attempt to sell Brown Bird cookies to a woman in the hallway?",
  "What does Monica try to do when she finds out that Ross has sold all the mint treasure cookies?",
  "What is the name of the planetarium where Ross has success selling Brown Bird cookies?",
  "What is the reaction of the gang when they see the old Christmas trees in Monica and Rachel's apartment?",
  "What does Chandler do when Rachel is upset about not getting the job at Fortunata Fashions?",
  "What is the name of the boss who tells Rachel how to make coffee at her new job?",
  "What does Phoebe try to do to help the old Christmas tree at Joey's work?"
]