[
  "What does Rachel dream that she and Chandler are doing on the table at Central Perk?",
  "Why does Phoebe want to operate a drill press?",
  "What is the reason for Ross's beeper going off?",
  "How old does Monica claim to be when she meets Young Ethan?",
  "What is the job that Chandler's secretary is having done?",
  "What does Phoebe discover about the employees at Chandler's workplace?",
  "What does Young Ethan reveal to Monica about his age?",
  "What is the reason for Monica breaking up with Young Ethan?",
  "What does Ross do when his beeper goes off and he thinks Carol is in labor?",
  "What is the reason for Phoebe telling Chandler that his employees don't like him?",
  "What does Phoebe suggest Chandler do to improve his relationship with his employees?",
  "What does Ross do when he is waiting for the others to get ready to go to the hospital?",
  "What is the reason for Rachel bringing a mirror and lipstick to the hospital?",
  "What does Joey bring with him to the hospital?",
  "What is Monica's reaction to becoming an aunt?",
  "What does Chandler do when he finds out that his employees make fun of him?",
  "What is the name of the phone number that Ross gives to people who call him by mistake?",
  "What does Phoebe tell Chandler about his employees' impressions of him?",
  "What is the reason for Ross's excitement when his beeper goes off?",
  "What does Rachel do when Ross starts dancing on the coffee table?",
  "What is the name of the character who is having a baby?",
  "What does Chandler do when he overhears his employees making fun of him?",
  "What is the reason for Monica's emotional state at the end of the episode?",
  "What does Ross do when he slips and falls on the floor?",
  "What is the final scene of the episode?",
  "What is the reason for Phoebe's suggestion to Chandler to attend a work party?",
  "What does Joey ask Monica to ask Young Ethan?",
  "What is the reason for Rachel's laughter when she is talking to Ross?",
  "What does Phoebe tell Chandler about his employees' behavior towards him?",
  "What is the reason for Monica's initial attraction to Young Ethan?"
]