{
  "show": "Friends",
  "season": 6,
  "episode": 20,
  "title": "The One With Mac and C.H.E.E.S.E.",
  "transcript": "The One With Mac and C.H.E.E.S.E.\nWritten by: Doty Abrams\nTranscribed by: Eric Aasen\nWith Scenes Taken From Episodes Transcribed by: Mindy\nMattingly Phillips, guineapig, Ruth\nCurran, Josh Hodge, and Me.\n[Scene: Joey and Rachel's apartment, Phoebe is helping Joey rehearse for an audition.\nPhoebe is overacting her part.]\nJoey: The reactor’s gonna blow in three seconds, we’re never gonna\nmake it!\nPhoebe: You’ve got to get out of here! Save yourself!\nJoey: No! I won’t leave you!\nPhoebe: Don’t worry about me, I’m a robot! I’m just a machine!!\nJoey: No you’re not! Not to me!\nPhoebe: (she stops reading from the script) Oh my God.\nJoey: What?\nPhoebe: I am extremely talented!\nJoey: Yeah, you’re great! Okay, let’s take it from…\nPhoebe: (interrupting) No, I mean I was really acting my ass off.\nJoey: Yeah, I thought I was pretty good too.\nPhoebe: Oh yeah, you’re solid. Yeah, you’re just no me.\nJoey: Y’know what? I think that’s enough for now. Yeah. I don’t\nwant to be over rehearsed.\nPhoebe: (tremendously overacting) Fine! I’ll do it without you! (Joey gives\nher thumbs up) I don’t need you or anybody else! I’m gonna make it on my own!\n(Joey closes the door to his bedroom.) You’ll see!! You’ll all see!!\nOpening Credits\n[Scene: Joey and Rachel's apartment, Joey is memorizing his lines. Chandler, Rachel,\nand Phoebe are there as well.]\nChandler: (To Joey) So uh, what’s this thing you’re auditioning for?\nJoey: Oh, it’s a new TV show. Yeah. I’m up for the part of Mac\nMacaveli or \"Mac.\" Yeah, I’m a detective and I solve crimes with the help\nof my robot partner. He’s a, he’s a Computerized Humanoid Electronically\nEnhanced Secret Enforcer or-or \"C.H.E.E.S.E.\"\nRachel: So Mac and C.H.E.E.S.E.\nJoey: That’s the title! Yeah! Y’know they really lucked out that the\ninitials spell cheese.\nChandler: That is lucky.\nRachel: Huh—Wait so Joey if you get this, you’re gonna be like the\nstar of your own TV show! I mean you’ll be like the Big Cheese! (To Phoebe) Or the\nBig Mac—Hey! You love those!\nJoey: Well, don’t get your hopes up, because probably not gonna happen.\nChandler: Now-now, why would you say that Joseph?\nJoey: I mean come on you guys! My own TV show? I just don’t know if\nI’m good enough.\nPhoebe: I am.\nRachel: Joey, what are you talking about? You’re a terrific actor.\nJoey: You really think so?\nRachel: Ugh, how can you even ask that question?!\n[And with that we go into the save the budget portion of the show, which features\nflashbacks from previous episodes. The first set of auditions feature high lights or low\nlights of Joey’s acting career. The first flashback is from The One With The Lesbian Wedding.]\n[Scene: Monica and Rachel's, everyone is there to watch Joey's first scene as Dr. Drake\nRemoray.]\nChandler:  Whoa, she's pretty. (Mentioning the girl on TV)\nJoey:  Yeah, and oh she's really nice too. She taught me all about how to\nwork the cameras, and smell-the-fart acting.\nRachel:  I'm sorry, what?\nMonica:  What?\nRoss:  Excuse me?\nJoey:  It's like, you got so many lines to learn so fast, that sometimes\nyou need a minute to remember your next one. So while you're thinkin' of it, you take this\nbig pause where you look all intense, you know, like this. (Does this intense look where\nit looks like he's smelling a fart.)\nChandler:  Oh, ok.\nJoey: (there's a gunshot on TV) There's my scene, there's my scene. [Joey on\ntv] \"Mrs. Wallace, I'm Dr. Drake Ramoray, your sister's neurosurgeon.  I'm\nafraid the situation is much worse than we expected. Your sister is suffering from\na...\" (Does the smell-the-fart look.)\n[The next flashback is from The One With The Butt.\nThe gang is watching Joey in Freud!]\nJoey: (on stage in an Austrian accent) Vell, Eva, ve've done some excellent vork\nhere, and I vould have to say, your pwoblem is qviiite clear. (He goes into a song and\ndance number.)\nAll you want is a dingle,\nWhat you envy's a schwang,\nA thing through which you can tinkle,\nOr play with, or simply let hang...\n[The next flashback is also from The One With The Butt\nand it's also on the soundtrack.  He's Joey telling everyone about his big break in\nMonica and Rachel's apartment.]\nJoey:  I play Al Pacino's butt. All right? He goes into the shower, and\nthen- I'm his butt.\nMonica: (trying not to laugh) Oh my God.\nJoey:  C'mon, you guys. This is a real movie, and Al Pacino's in it, and\nthat's big!\nChandler: Oh no, it's terrific, it's- it's- y'know, you deserve this, after all\nyour years of struggling, you've finally been able to crack your way into show business.\nJoey: Okay, okay, fine! Make jokes, I don't care! This is a big break for me!\nRoss: You're right, you're right, it is.\nMonica:  Yes.\nRoss:  So you gonna invite us all to the big opening?\n[Cut back to Joey about to leave for his audition for Mac and C.H.E.E.S.E.]\nJoey: All right well, I’m outta here. Wish me luck.\nPhoebe: (overacting with a song this time) (singing) Gooood luck! Gooood\nluck! We all wish you good luuuuuuuuck!!!\nJoey: Yeah, whatever. (Exits.)\n[Scene: Central Perk, Chandler and Ross are playing chess and are both studying the\nboard intently.]\nRoss: It’s your turn.\nChandler: Oh, are we playing this?!\nJoey: (entering, dejectedly) Hey.\nChandler: Hey! How’d the audition go?\nJoey: Terrible! I messed up every line! I shouldn’t even be\nan actor!\nRoss: Wait a minute, are you doing that thing where you pretend it didn’t\ngo well but it really did go well?\nJoey: Yeah, did I fool ya?\nRoss: Totally!\nChandler: So it did go well.\nJoey: Oh, it went amazingly well!\nRoss: Great!\nChandler: Oh that’s great!\nJoey: Yeah-yeah, it’s down to me and two other guys.\nChandler: Oh my God!\nRoss: Wow!\nJoey: And I know both of them, they’re really good. One of them is the guy\nfrom those allergy commercials who’s always getting chased by those big flowers…\nRoss: Oh, I love that guy! (Laughs.)\nChandler: Oh-oh, what are you doing?\nRoss: (stops laughing) What am I doing?\nJoey: I’m just so nervous! Y’know? The callback isn’t until\ntomorrow at five. I feel like my head is going to explode!\nChandler: Well, it is overdue.\nRoss: Look, don’t worry. Okay? You’re gonna be fine.\nJoey: There’s just so much pressure. I mean no offense, but what you guys\ndo is very different. I don’t know if you’d understand.\nRoss: Yeah, none of us have to deal with pressure at our jobs.\n[Thus starts another series of flashbacks all dealing with the pressure the rest of the\nFriends have to deal with in their jobs. The first flashback is from The One With The Stoned Guy.]\n[Scene: Chandler's office. He's on the phone, agitated.]\nChandler: (on phone) Yes, Fran. I know what time it is, but I'm looking at the\nWENUS and I'm not happy!\n[The next flashback is from The One With The Prom Video.\nMonica is at a job interview at a new restaurant.]\nMonica:  Alright, well I'm tearing the lettuce.\nInterviewer:  Uh-huh. Is it dirty?\nMonica:  Oh-oh, no no don't worry, I'm gonna wash it.\nInterviewer:  Don't, I like it dirty.\nMonica:  That's your call.\nInterviewer:  So, uh, what are you going to do next?\nMonica:  Well, I thought that I would cut up the tomatos.\nInterviewer:  Are they, uh, firm?\nMonica:  They'r alright.\nInterviewer:  You sure they haven't gone bad? You're sure they're not very,\nvery bad?\nMonica:  No really, they're OK.\nInterviewer:  You gonna slice them up real nice?\nMonica:  Actually, I was gonna do them jullienne.\nInterviewer:  Aaaahhhhhhh.\nMonica:  I'm outa here. [Monica leaves]\n[The next flashback is from The One With Rachel's Crush.]\n[Scene: Bloomingdale’s, Rachel’s new job.]\nRachel:  (on the phone) Monica, I’m quitting! I just helped an 81 year\nold woman put on a thong and she didn’t even buy it! (Pause) I’m telling you\nI’m quitting! That’s it! I’m talking to my boss right now! (Pause) Yes I\nam! (Pause) Yes I am! Yes I am! Yes I am! Yes I am! Yes I am! Okay bye, call me when you\nget this message. (Hangs up.)\n[The next flashback is from The One With The Dozen Lasagnas, Phoebe is telling everyone\nbut Rachel about the pass Paulo made on her.]\nMonica:  Well, what happened?\nPhoebe:  Well, he came in for a massage and everything was fine until...\n(The flashback shows Paulo lying face down on the massage table and slowly moving his\nhands up Phoebe's legs and grabbing her butt.)\nAll:  Ohhhhhh!\nRoss:  Oh my God!\nPhoebe:  And all of the sudden his hands weren't the problem anymore. (The\nflashback shows Paulo rolling over and showing Phoebe his equipment.)\nMonica:  Was it...\nPhoebe:  Oh, Boy Scouts could've camped under it!\n[The next flashback is from The One With Ross's Sandwich,\nRoss his confronting his boss about him eating Ross's sandwich.]\nRoss: You ate my sandwich?\nDr. Leedbetter: It was a simple mistake. It could happen to anyone.\nRoss: (getting upset) Oh-oh really?\nDr. Leedbetter: Now-now calm down. Come look in my office, some of it my still\nbe in the trash.\nRoss: (jumping to his feet in anger) What?\nDr. Leedbetter: Well, it was quite large. I-I-I-I-I had to throw most of it\naway.\nRoss: You-you-you-you (trying to remain in control) threw my sandwich away!\n[Cut to an outside shot of the museum.]\nRoss:  (losing control, we hear him shout outside) MY SANDWICH?!!!\n[Cut to a shot of a park.]\nRoss: MY SANDWICH!!!!!! (Ross's scream scares a flight of pigeons away.)\n[Cut back to Central Perk.]\nJoey: I want this part so much! Y’know? If I don’t get this part\nI’m never gonna eat Macaroni and Cheese again!—No, I didn’t say\nthat! That’s a lie.\n[Scene: Joey and Rachel's apartment, Chandler is there talking to the chick and duck.]\nChandler: Oh come on guys, it’s not like I moved to Europe! I just moved\nacross the hall! And we would have you over all the time if it weren’t for\n(struggles to get this out) Monica’s allergies. (The duck quacks.) You’re right,\nI could never lie to you. She hates you. (The phone rings.) Should I get that? (Laughs,\nthen answers the phone.) Hello? (Listens) Uh no, Joey’s not here right now. Can I\ntake a message? (Listens) Yeah, okay so the audition has been moved from 5:00 to 2:30?\n(Listens) Okay great. (Listens.) Bye. (Hangs up the phone and goes to write the message on\nthe Magna-Doodle on the door but Monica walks in and forces him to jump out of the\nway.)\nMonica: (startled) Ahh! Aren’t you dressed yet?\nChandler: (looks down at his clothes) Am I naked again?!\nMonica: We’re supposed to meet my parents in 15 minutes.\nChandler: Yeah okay, I was just talking to the guys. Just look at them I mean,\nis it okay if they come visit?\nMonica: Wh?! What about my allergies?!\nChandler: Oh right, your allergies. (Monica leaves and to the chick and duck)\nAll her, she hates you. (Chandler leaves without finishing the message for Joey.)\n[Scene: Joey and Rachel's apartment, Joey and Chandler are playing foosball and Joey\nscores a goal.]\nJoey: Yes!! Ha-ha!! All right! Hey! How cool would it be if you could watch like\na real life-sized version of this? Huh? I mean how crazy would that be?\nChandler: As crazy as soccer?\n(The phone rings and Joey answers it.)\nJoey: (on phone) Hello? (Listens) What are you talking about? The\naudition’s not ‘til 5:00! (Chandler suddenly remembers and looks at the\nunfinished message then tries to sneak over and finish it as Joey listens.) Well, nobody\ntold me! (Listens) Who’d you talk to? (Listens and turns around to see Chandler\ntrying to finish the message.) Nevermind! (Hangs up.)\nChandler: You mean you didn’t get it from this?\nJoey: The allergy guy got the part! Thanks!\nChandler: Well, maybe we can fix it y’know? Maybe we can send him some-some\nbig-big flowers and scare him!\nJoey: How could you do this to me Chandler?! This part could’ve turned my\nwhole career around!\nChandler: I messed up. Okay? I’m sorry, I really messed up.\nJoey: Hey, you don’t even live here anymore! What are you doing answering\nmy phone? I have my machine!\nChandler: Which I bought for ya. Taught ya how to use it. You thought it was a\ncopier. Look, if there was anything I could do, I would do it. Okay? But everybody’s\nallowed one mistake, right?\n[Joey just laughs as a third set of flashbacks featuring Chandler’s mistakes\nstarts. The first flashback is from The One With The Prom\nVideo.  It's Chandler telling Phoebe how much he hates the bracelet Joey bought\nhim.  They're both at Central Perk.]\nChandler:  You know he coulda gotten me a VCR, he coulda gotten me a set of\ngolf clubs, but no, he has to get me the woman repeller!  The eyesore from the\nLiberace house of crap!\nPhoebe:  It's not that bad.\nChandler:  Oh, yeah, easy for you to say, you don't have to walk around\nsporting some reject from the Mr. T collection. [Joey walks in behind Chandler]\nPhoebe:  Chandler, Chandler.\nChandler:  I pity the fool who puts on my jewelry, I do, I do. I pity the\nfool that. . . [turns around and sees Joey] Hi!\n[The next flashback is from The One Where Chandler\nCrosses The Line.  He's telling Joey that he kissed Cathy.]\nChandler:  Yeah, I mean when you were late last night, Kathy and I got to\ntalking, and one thing to another and…\nJoey:  And what?! Did you sleep with her?!\nChandler:  No! No! No! I just kissed her.\nJoey:  What?!! That’s even worse!!\nChandler:  How is that worse?!\nJoey:  I don’t know! But it’s the same!\nChandler:  You’re right, I have no excuses! I was totally over the\nline.\nJoey:  Over the line?! You-you’re-you’re so far past the line,\nthat you-you can’t even see the line! The line is a dot to you!\n[Cut back to Joey and Rachel’s apartment.]\nChandler: Look, I’m not saying that you should magically forgive me! But\nyou’re not perfect! You’ve made some errors in judgment too!\nJoey: Name one!\n[Chandler proceeds to point out Joey’s errors in this forth set of flashbacks. The\nfirst flashback is from The One With The Cat.\nChandler has just returned home to see that their apartment has been cleaned out and finds\nJoey trapped in the entertainment center.]\nChandler: (lets him out) What happened?!!\nJoey: (getting out) Awww, man! He promised he wouldn’t take the chairs!!\nChandler:  What the hell happened?!! How were you locked in?!! And where\nthe hell is all of our stuff?!!\nJoey:  Well, this guy came by to look at the unit and-and he said he\ndidn’t think big enough to fit a grown man!\nChandler:  So--You got in voluntarily?!\nJoey:  I was tryin’ to make a sale!! Oh, man, if I ever run into that\nguy again, do you know what I’m gonna do?\nChandler:  BEND OVER?!!!\n[The next flashback is from The One With The Candy Hearts.  Joey and Chandler are\nwaiting at a restaurant as Lorraine and her friend arrive.]\nChandler: Ok, now, remember, no trading. You get the pretty one, I get the mess.\nLorraine: Hi, Joey. (Sees Chandler.) Well well, look what you brought.\nChandler: ...And what did you bring?\nLorraine: She's checking the coats. Joey, I'm gonna go wash the cab\nsmell off my hands. Will you get me a white Zinfandel, and a glass of red for Janice.\nChandler: Janice?\n(Lorraine leaves. Joey shakes his head as though to say, 'It can't be the same Janice.'\nJanice enters.)\nChandler: Janice?!\nJanice: Oh.... my.... God.\n[The next flashback is from The One With Ross's New\nGirlfriend.  Chandler is telling Ross and Joey that Joey's tailor took advantage\nof him.]\nChandler: Joey's tailor...took advantage of me.\nRoss: What?\nJoey: No way!  I've been going to the guy for 12 years.\nChandler: Oh come on!  He said he was going to do my inseam, and he ran his\nhand up my leg, and then, there was definite...\nRoss: What?\nChandler: Cupping.\nJoey: That's how they do pants!  Ross, will you tell him? Isn't that how\nthey measure pants?\nRoss: Yes, yes it is. In prison!\n[Cut back to the present.]\nJoey: I said name one!\nCommercial Break\n[Scene: Monica, Chandler, and Phoebe's, Monica and Rachel are consoling Chandler.]\nChandler: I can’t believe I did this! What an idiot!\nMonica: Oh, stop beating yourself up! People make mistakes! These things happen!\nThere aren’t any message you’ve forgotten to give me are there? (Chandler has a\ndisgusted look on his face.) Apparently you’re not very good at it! I…\nChandler: Do you think he’ll ever forgive me?\nRachel: Of course he will! But Chandler the most important thing is you forgive\nyourself!\nChandler: Y’know what? I-I kinda have.\nRachel: Already? That’s pretty bad what you did.\nMonica: Y’know what? He will forgive you. And I like to bring a pad\nwith me when I go answer the phone just in case… (Chandler gets that disgusted look\nback.) Okay…\nChandler: You didn’t see how mad he was, y’know?\nRachel: I’m sure he will forgive you. Look, we have all been there!\nY’know, you fight, you make up, it’s just the way it works.\n[We then go into another set of flashbacks of famous fights. The first is the second\nbreakup of Ross and Rachel from The One With The Jellyfish.]\nRoss: It took two people to break up this relationship!!\nRachel: Yeah! You and that girl from that copy place, which yesterday you took\nfull responsibility for!!\nRoss: I didn’t know what I was taking full responsibility for! Okay?! I\ndidn’t finish the whole letter!\nRachel: What?!!\nRoss: I fell asleep!\nRachel: (mocking him) You fell asleep?!\nRoss: It was 5:30 in the morning, and you had rambled on for 18 pages. Front and\nback!! (they go into the living room, trapping Monica, Chandler, and Joey in the kitchen)\n(to Rachel) Oh-oh-oh, and by the way, Y-O-U-apostrophe-R-E means ‘you are,’\nY-O-U-R means ‘your!’\nRachel: Y'know I can’t believe I even thought about getting back\ntogether again! We are so over!!\nRoss: (starts to cry) FINE BY ME!! (he opens the door and traps Chandler behind\nit)\nRachel: And hey! Just so you know, it’s not that common! It doesn’t\nhappen to every guy! And it is a big deal!!\nChandler: (coming out from behind the door) I KNEW IT!!!!\n[The next flashback is from The One After The Superbowl,\nPart II.  Monica and Rachel are fighting over who gets to see Jean-Claude Van\nDamme.]\nMonica: You had no right to go out with him.\nRachel: That is the most ridiculous...\nMonica: You sold me out.\nRachel: I did not sell you out.\nMonica: Yes you did.  You absolutely sold me...\nRachel: Would you let me talk. [flicks Monica on the forehead]\nMonica: Did you just flick me?\nRachel: OK, well, you wouldn't let me finish and I was jus- [Monica flicks her\nback] Ow. That hurt [flicks Monica]\n(They keep flicking each other. This turns into slapping each other.)\nPhoebe: Oh!  All right.  Now, let's not do this!\n(Rachel tackles Monica onto the couch.)\nPhoebe: Happy thoughts!  Happy thoughts!\n(They wrestle on the couch for a little while until Monica gets the upper hand and\npulls Rachel off of the couch by her sock.  Monica removes Rachel's sock and starts\nbeating her with it.)This leads to wrestling on the floor. This finally angers Phoebe.)\nPhoebe: OK, now I'm gonna kick some ass.\n(Phoebe grabs each of them by an ear.)\nMonica and Rachel: Ow! Ow! Ow!\nPhoebe: I know!  I know!  I know!\nPhoebe: Alright, now I will let go if you both stop.\nRachel: Fine!\nMonica: Fine!\nPhoebe: There we go.You know what, if we were in prison, you guys would be,\nlike, my bitches.\n[The next flashback is from The One Where No One's Ready.\nJoey is retaliating against Chandler hiding his underwear by wearing a whole bunch of\nclothes.]\nJoey: Okay, buddy-boy. Here it is. You hide my clothes, I'm wearing everything\nyou own.\nChandler: Oh my God!\nJoey: Look at me! I'm Chandler! Could I be wearing any more clothes?\nMaybe if I wasn't going commando...\n(Chandler does this throat sound.)\nJoey: Yeah. Whew, it's hot with all of this stuff on. I ah, I better not do any,\nI don't know, lunges. (starts doing lunges)\n[The next flashback is from The One Where Eddie Moves In.\nIt's the sequence where Joey and Chandler are both saddened that they're not living\ntogether anymore. All By Myself is playing in the background.]\n[Joey's place. He goes to say something to Chandler in the other chair but no one's\nthere. He goes to call Chandler but decides not to and throws the phone back down.]\n[Chandler's. He's playing foosball by himself.]\n[Joey's. Playing ping pong by himself.]\n[Chandler is sitting in front of a window while it's raining outside. We see Joey\nthrough a rainy window. The camera zooms out to show it's just his tabletop water\nsculpture.]\n[Scene: Joey and Rachel's apartment, Chandler is entering with a peace offering of a\nJoey Special, two pizzas.]\nChandler: Joey? Got you a Joey Special, two pizzas! Joe? (The phone rings\nand he answers it) (On phone) Hello? (Takes the phone away from his mouth when he realizes\nwhat he just did and yells.) Damnit! (Back on phone.) Hello? (Listens.) No, Joey’s\nnot here right now, but I can take a message I think. (Listens) He’s still got a\nchance for the part?! Oh, that’s great news! (Listens) Well no obviously not for the\nactor who was mauled by his dog. (Listens) Oh well, that’s great. I will give Joey\nthe message. Thank you! (Hangs up and goes to write the message on the Magna-Doodle.)\nYes! (Reading what he’s writing) Okay, Mac audition at 2:00. Allergy actor attacked.\n(Pause) By dog not flowers.\n[Scene: Joey and Rachel's apartment, Joey is entering to find Chandler waiting\npatiently for him.]\nJoey: Hey!\nChandler: Please tell me you got the message!\nJoey: What message?\nChandler: The actor playing Mac couldn’t do it, they needed to see you at 2\no’clock.\nJoey: What?! It’s 6 o’clock!\nChandler: Du-du-I wrote it, I wrote it on the board! I wrote it on the board,\nthen I went all over New York City looking for ya! I went to Ross’s! I went to the\ncoffeehouse! I went to any place that they made sandwiches!\nJoey: I can’t believe this Chandler!\nChandler: Sorry! I-I-I don’t know what to say.\nJoey: Well you-you-you-you might say congratulations! I saw the board! I went to\nthe audition! I got the part!!\nChandler: (angrily) Is that supposed to be funny! I was really worried over\nhere!\nJoey: Oh, well I’m uh…\nChandler: Y’know, sometimes that fake out thing is just mean!\nJoey: Oh wow! Okay man, I’m sorry. I did not mean to make you feel bad.\nChandler: Well that’s good. Because you didn’t! And I’m\nincredibly happy for ya!!\nJoey: (shocked) That’s mean! You really had me going there!\nChandler: Oh, we could do this all day.\nJoey: Yeah, you’re right. Okay look, listen, let’s talk about what a\nhuge star I’m gonna be!\nChandler: You are gonna be a huge star! I’m gonna hug ya!\nJoey: You hug me!\nChandler: All right!\n[What follows is the final set of flashbacks that feature a whole lot of lovin’\nbetween Chandler and Joey. There’s no words, just hugs and even the kiss from The One\nWith The Monkey. All of this is set to the song, You’ve Really Got a Hold on Me!]\n[Cut back to the present, they are still in each other’s embrace.]\nJoey: Hey, do we do this too much?\nChandler: I think so. Yeah, get off me.\nJoey: Yeah.\n(They separate.)\nEnding Credits\n[Scene: Joey and Rachel's apartment, Joey and Phoebe are reading a scene from Mac and\nC.H.E.E.S.E.]\nJoey: Come on C.H.E.E.S.E., I’m not leaving without you! Try routing your\nbackup source through your primary CPU.\nPhoebe: (overacting badly) I can’t! My circuits are fried! They’re\nfried I tell you!!\nJoey: Wow! (Back to reading the scene.) Well then I’ll just have to carry\nyou.\n(Suddenly Ross jumps up from behind the counter armed with a plastic gun. By the way,\nhe’s overacting too.)\nRoss: That’ll be a neat trick, when you’re, (looks at the script) when\nyou’re dead!\nJoey: Ross, you don’t have to yell.\nRoss: There was just an explosion, okay? My hearing would be impaired.\nPhoebe: I thought you were excellent! In fact for a minute there I was like,\n\"Ooh, where’d Ross go?\"\nRoss: Thank you! And I have to say that first scene when you meet Mac…\nPhoebe: Yeah?\nRoss: Oh my God. I mean…\nJoey: Y’know what? I think that’s enough for today. Thanks for your\nhelp! (He grabs their scripts and heads for his room.)\nPhoebe: (To Ross) He’s holding us back.\nRoss: Totally.\nEnd",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0620.html",
  "scrapedAt": "2025-12-17T14:32:37.363Z",
  "wordCount": 4212,
  "hasCharacterNames": true
}