{
  "show": "Friends",
  "season": 10,
  "episode": 3,
  "title": "Friends - 1003 - The One With Ross' Tan",
  "transcript": "Friends\n1003 - The One With Ross' Tan\nWritten by: Brian Buckner\nProduced by: Robert Carlock and Wendy Knoller\nTranscribed by: Coffee Mug, Eleonora, Sebastiano & Vanessa\n[Scene: Joey and Rachel's apartment]\nChandler: So, you and Rachel tonight, huh?\nJoey: Yeah. It's actually our first official date\nChandler: Wow! So tonight may be the night! You're nervous?\nJoey: Naa, no. This is the part I'm actually good at.\nChandler: What must it be like not to be crippled by fear\nand self-loathing.\nJoey: (pause) It's OK!\nChandler: How can you be so confident?\nJoey: Well, I... I know exactly what I'm gonna do!\nChandler: Really? Like you have a routine?\nJoey: No, no no no no. See. Each woman is different.You have\nto appreciate their uniqueness.\nChandler: Really?\nJoey: No, I do six things! First, I look deep in her eyes.\nThen, I kiss her. Next I take my hand and I softly graze her thigh.\nChandler: You mean like this? (he starts touching his thigh\nin a funny and awkard way)\nJoey: NO! Not like that, no no. No, like this. (He starts\nlightly grazing Chandler's thigh)\nChandler: Oh, I see what you mean, that's quite nice. (They\nlook at each other, both embarassed)\nJoey: More foosball?\nChandler: ...and beer!!\nOPENING CREDITS\n[Scene:Central Perk. Ross and Chandler are on the couch]\nMonica: (entering) Hey!\nRoss and Chandler: Hey!\nMonica: (to Chandler) Hey sweetie! (they\nkiss)\nRoss: (looking at Monica's legs) WOW!\nChandler: Hey! Stop staring at my wife's legs! No no! Stop\nstaring at your sister's legs!\nRoss: I'm sorry, it's just... how did you get so tan?\nChandler: She went on one of those spray-on tan places.\nRoss: Eh, you got a spray-on tan?\nMonica: Chandler gets pedicures!\nRoss: (laughing) Why, why you do, like with the-the toe separators?\nChandler: (To Monica) Why...why?\nRoss: Still, I can't believe that's sprayed on... I mean,\nit looks really good. I wonder if I should get one!\nChandler: Sure, then you should get a mini skirt so you can\nreally show it off.\nRoss: So, do you get colours or just French tips?\nMonica: There. Here's their card.\nRoss: Thanks. (he takes the card) Hey, I know where this\nplace is! It used to be an X-rated video... (pauses when he realizes what he\nis saying) florist. (he goes away)\n(Phoebe enters)\nPhoebe: Hey!\nChandler: Hey Pheebs!\nMonica: Hey Phoebe!\nPhoebe: Oh, you won't believe who moved back to town.\nMonica: I know, Amanda! Ah! She called me\ntoo! She's the worst!\nChandler: Who's Amanda?\nMonica: She's this girl who used to live\nin the building before you did. Then she moved to England and she picked up\nthis fake British accent. On the machine this is her message. (she apes Amanda\nusing an awful British accent) \"Monica, darling! It's Amanda calling!\"\nChandler: Are you trying to do a British accent?\nMonica: (pause) (to Phoebe) Chandler gets\npedicures!\nChandler: Just so I know, how many more of those can I expect?\nPhoebe: You know what Amanda said to me when she got me on\nthe phone? (apes Amanda in a british accent) \"Oh, so sorry to catch you\non your Mo-Bile!\" If-if you don't wanna get me on my mo-Bile, don't call\nme on my mo-Bile!\"\nMonica: I know, and she's always bragging\nabout all the famous people she's met.\nPhoebe: Oh, I know! \"Oh...I slept with Billy Joel\".\nAll right, who hasn't?\nMonica: Oh, what are we gonna do! I don't\nwanna see her!!\nPhoebe: Ugh, Let's just cut her out!\nMonica: What?\nPhoebe: Cut her out of our lives! Just ignore her calls and\ndodge her 'till she gets the point!\nMonica: Oh, I guess we could try that, but...\nit seems so harsh! (to Chandler) Have you ever done that?\nChandler: No, had it done to me though. Feels good !\n[Scene: At the tanning salon. Ross and a male assistant are\nwalking through a hall]\nAssistant: Alright Mr. Geller! Right this way!\nSo, how dark do you wanna be? We\nhave one, two or three.\nRoss: Well... I like how you look, what are you?\nAssistant: Puerto Rican.\nRoss: Two, I think a two.\nAssistant: You've got to face the red light.\nWhen the red light goes on the spraying is about to start so close your eyes.\nWhen the spraying stops, count to five. Pat yourself down to avoid drip marks\nthen turn around so we can get your back. Got it?\nRoss: Spray, count, pat, then turn, spray, count and pat.\nAssistant: Wow, you catch on quick.\nRoss: Well, I have a PhD, so... (assistant walk out, not\nimpressed by this statement)\n(Ross takes his bathrobe off and he enters the tanning booth. He stands up\nin front of the red light and the sprayer starts and sprays his face and torso)\nRoss: One Mississipi, two Mississipi, Three Mis...(the sprayer\nstarts again, spraying him in the face and torso again) WAIT! WAIT! I'm not-I've\nnot finished counting!! (he leaves the booth) (the assistant enters the room)\nRoss: You sprayed my front twice!\nAssistant: You've never turned?\nRoss: No, I barely even\ngot to three Mississippi.\nAssistant: Mississippi? I said count to\nfive'!\nRoss: Mississippilesly? (pause) Well, how\nbad is it?\nAssistant: Ain't that bad yet, but it keeps\ngetting darker for the next four hours.\nRoss: So, how dark is it\ngonna get?\nAssistant: You got sprayed with two two'\ns and...\nRoss: I'm a four?\nAssistant: Yeah, but you're back's a zero.\nYou're gonna wanna even that out.\nRoss: (sarcastically) Really!\nAssistant: You might wanna get back in there.\nRoss: (annoyed) Ok!\n(The assistant leaves and Ross goes back in the spray-on tan booth and turns\nhis back to the spray nozzles, facing the back wall)\nRoss: Wait, wait a minute, there's no light\non the back wall! How do I know when it's gonna start? Hello? (he slowly turns\nand the spraying begins, on his face) Ah, oh, ah! (he turns, but then he turns\nagain and is sprayed in the front again) Ah! (he spits and angrily goes out\nof the spray-on tan booth and the assistant enters the room) The same thing\nhappened again!\nAssistant: You got two more twos?\nRoss: (hysterically) I'm an eight!\n[Scene: Joey’s apartment. Joey and Rachel enter the room]\nRachel: Thanks for dinner.\nJoey: I thought you paid. (Rachel does not answer and seems\npuzzled) Ha, guess we won’t be going back there!\nRachel: So.\nJoey: Yeah.\n(Joey and Rachel start kissing)\nJoey: Hey what do you say, we move this onto the likes of\nthe couch?\nRachel: I say ‘cheesy line’, but ok.\n(They move on the couch and start kissing again. Joey does his grazing on\nRachel’s thigh and she slaps his hand)\nJoey: What’s the matter?\nRachel: I am sorry, I don’t know, I am sorry, I don’t\nknow why I did that!\nJoey and Rachel: Okay\nRachel: Ok, so sorry.\n(They start kissing again and, when Joey grazes her thigh, she slaps him on\nhis hand again)\nRachel: I am sorry! Again... I don't know, I don’t\nknow what happened, I must be nervous!\nJoey: I don’t get it, Chandler loved it!\nRachel: Ok, ok, ok. I promise, I promise, I promise, I won’t\ndo it again. I really do. I promise. This is gonna be great.\nJoey: Ok.\n(They start kissing again and when Joey grazes, she slaps him three times,\non the hand, and on both cheeks)\nJoey: (a little giddy) Uh, was that good for you?\n[Scene: Monica’s apartment. Monica and Phoebe are reading\nmagazines when the phone rings and Phoebe reaches to pick it up]\nMonica: (to Phoebe) No, no, don’t get it. Let the machine\npick up.\nPhoebe: Oh, yeah. Could be Rachel asking if someone could\nbaby-sit again.\nMonica: It could be Amanda!\nPhoebe: Oh, you’re right! I was just kidding about\nRachel. Babysitting is a gas!\n(The machine picks up the phone)\nAmanda: Hello Monica. It’s Amanda calling again. I\nam in the neighborhood hoping I can pop by your flat!\nMonica: You're from Yonkers! Your last name\nis Buffo-Martisis!\nAmanda: Let’s see.. to assure you get this directly,\nring me back on my mobile.\nPhoebe: Ok, don’t hold thy breath!\n(Sound of dialing numbers is heard from the speaker of the machine)\nChandler: Hello? Is someone on the line?\nAmanda: Yes, I was looking for Monica.\nChandler: Hang on, she’s right here. (he enters the\nliving room and hands the phone to Monica) Someone's on the phone, for ya.\nMonica: We weren’t picking up, it’s\nAmanda!\nChandler: (to Amanda) I get pedicures!\nMonica: Hi Amanda! Actually now... it’s...\nis not a good time. Dinner tomorrow night? (Phoebe mouths 'no') Ok, Phoebe\nand I will see you then!\nPhoebe: Why, why, why didn’t you just say no!\nMonica: Well, I said 'no' to her coming\nover now! I couldn’t say 'no' twice! I get this uncontrollable need to\nplease people!\nPhoebe: (leaving) Fine, fine! You would not hold up well\nunder torture!\nMonica: And you would?\nPhoebe: I did!\n[scene: Joey’s apartment. Joey and Rachel are sitting\non the couch]\nJoey: Rach, you sure you wanna do this?\nRachel: Absolutely! Absolutely. I d... it’s just a\nlittle weird, it’s you, and it’s me, it's just gonna take some\ngetting used to.\nJoey: Ok. Well, how, how can we make it easier?\nRachel: Ok, let’s work from the top down! (Joey nods,\nbut then puzzled because he does not get it) Just work the bra, Joe!\nJoey: Ok, yeah, got it.\nRachel and Joey: Okay.\n(They start kissing and Joey starts to undo her bra, but fails completely)\nJoey: This thing welded shut?!\nRachel: Okay.\nJoey: All right, turn around, I got to get a look at this\nthing.\nRachel: Oh!\n(Joey starts trying to undo her bra, but it won’t go.The elastic band\nsnaps back, hurting Rachel.)\nRachel: Ow!\nJoey: Sorry!\nRachel: Well this is romantic!\nJoey: I'm sorry! (He stands up) This never happened to me\nbefore! I'm an expert at taking off bras! I can do it with one hand! I can\ndo it with my eyes closed! One time I just looked at one, and it popped open!\nI blame your bra!\nRachel: It’s a standard issue bra clasp!\nJoey: Then I blame you! Yeah! That's right! You threw me\noff with all your slapping!\nRachel: Ok well, well I'm really, I'm sorry about that Joey,\nbut do you think that maybe on some level, you don't want to take\noff my bra?\nJoey: (contemplates for a few moments what Rachel just said)\nNAH! I don't have another level!!\n[Scene: Monica and Chandler's apartment]\n(Chandler is at the table reading; Monica puts some food for him on the table.\nRoss walks in looking very tanned. Chandler and Monica look up at him\nsmiling.)\nChandler: Hold on! There is something different.\nRoss: I went to that tanning place your wife suggested.\nChandler: Was that place... The Sun?\nRoss: Oh! And it gets worse! (Turns his side to Chandler\nand Monica and pulls up his shirt. There's a distinct line across his body,\nwhere his belly is very tanned and his back is very pale.)\nChandler: Oh My God! You can do a duet of Ebony and Ivory\nall by yourself!\nMonica: How could you mess this up? It's\nso easy? You go into the booth, you count to five and you turn around!!\nRoss: (looks at her suspiciously) How do you count to five?\nMonica: One Two Three...\nRoss: (Yells) Damnit! (Goes to the door to leave. Rachel\njust enters, sees him and starts laughing)\nRachel: (laughing) oooh! Oh oh!\nRoss: (Still yelling) I Know!\nRachel: oh oh! What is up with Miss Hawaiian Tropic?\nChandler: How was your date with Joey?\nRachel: Well, it was good.. until we got back to our apartment,\nand then we were fooling around and he started to put his hand up my leg and\nI kept slapping it away!\nChandler: You didn't like that?\nRachel: Well, it wasn't just me, alright? He freaked out\ntoo! He couldn't even undo my bra!\nMonica: Wow, really? One time he just looked\nat my bra and it popped open.\n(Chandler starts looking at her bra)\nRachel: I do not know what's wrong with us, I mean, we have\nkissed before and that's been great! But this time it was leading somewhere\nand I was very aware of the fact that it was Joey touching me.\nMonica: Well, you guys have been friends\nforever. Remember the first time that you kissed Ross? How weird that was?\nYou couldn't stop laughing? You got through that.\nRachel: (looking thoughtful) Ok, that's true. That's true,\nwe can do this. You're right, you're right, we can do this. We're just gonna\npower through!\n(Joey walks in)\nJoey: Hey Chandler can I talk to you for a second (points\nto the hall).\nRachel: (To Joey) No need!! Problem solved, we are powering through\n(At which point she grabs his hand and pulls him back to their apartment).\n(Chandler resumes staring at Monica's bra)\nMonica: (sees what he is doing) Chandler,\nstop! It is not going to pop open!\nChandler: (without taking his eyes off the bra) You don't\nknow! (Monica just smiles)\n[Scene: Central Perk.]\n(Phoebe is sitting on the couch. Monica walks in.)\nMonica: Hey Phoebe!\nPhoebe: Hey!\nMonica: Is Amanda here yet?\nPhoebe: No.\nMonica: (sits down) Oh good. Good, look\nI'm so sorry, for screwing up that cutting-her-out plan. But I have a new plan.\nChandler agreed to call here in a few minutes with an emergency.\nPhoebe: Oh! Well, what kind of emergency that gets us both\nout of here?\nMonica: Well, what do you think of Mike\nand Chandler being in a car accident?\nPhoebe: (makes a face) Are you kidding, I love it!\n(A blonde woman walks in. Supposedly Amanda)\nPhoebe: Hi!\nMonica: Hi!\nAmanda: Hi! (Phoebe and Amanda hug)\nAmanda: (To Monica) Hello!\n(Monica holds her hands out for a hug, but instead of hugging her, Amanda\nhangs her purse on one of Monica's extended arms.)\nAmanda: (In a fake British accent) It's so nice to see you!\nBoth of you! Look at me. Look how young I look! (gives her coat to Monica as\nwell) Oh gosh! We have so much to catch up on! But first things first: touch\nmy abs (at which point she grabs both Phoebe and Monica's hands and places\nthem both on her stomach) I don't exercise at all! (she pulls them down to\nsit.) Oh gosh, so Monica, you're married!\nMonica: (beaming) Yeah! Yeah! His name is\nChandler and...\nAmanda: (To Phoebe) Smell my neck! (Phoebe does so) It's\nnot perfume! It's me! It's my natural scent!\n(Monica looks shocked)\nPhoebe: Musty!\nAmanda: Oh! Gosh! This is brilliant. Gosh, it's just like\nold times. I'm so happy you two are friends again!\nMonica: When were we not friends?\nAmanda: Well, it was 1992, and I remember because that was\nthe year I had sex with Evil Knievel (She starts laughing very proudly).\nMonica: Ehm, we were friends in 1992.\nAmanda: (to Phoebe) No I distinctly remember you were dodging\nher (points at Monica) calls and trying to avoid seeing her.\nMonica: (To Phoebe) You were going to cut\nme out?\nPhoebe: Well...kinda.\nMonica: Oh My God!\nAmanda: Oh! Bugger. Should I not have said that? I feel like\na perfect arse!\nPhoebe: Yeah well, in America you're just an \"ass\".\n(Monica's mobile starts ringing. She picks it up.)\nMonica: (Into the phone) Hello? Chandler,\nwhat's wrong? (She listens) Oh my God, are you alright? (listens some more)\nYeah, I'll be right there. (She hangs up and speaks to Amanda) I'm so sorry,\nbut Chandler was in a car accident. (She gets up)\nPhoebe: (Also gets up and starts taking her purse) Oh my\nGod. Was Mike with him?\nMonica: Nope! (She turns and leaves)\n[Scene: Joey and Rachel's apartment.]\n(Joey comes running in.)\nJoey: (To Rachel) Hey!\nRachel: Hey! Got champagne?\nJoey: Yes ma'am, ready to Power through!\nRachel: Excellent! Stick it in the ice bucket, the phone\nis off the hook, and in the interest of powering through (Starts to remove\nher bra from under her clothes)...\nJoey: Uh! (When she's done she throws her bra at him)\nRachel: Ok (starts to light some candles) Sexy, sexy, very\nsexy, sexy. (Claps her hands and jumps at Joey, clearly very excited) Alright!\nLets do it!\nJoey: Ok, you're scaring me a little bit.\nRachel: Oh! Get over it soldier, we've gotta do this! (She\npulls him towards her and throws him onto the barcalounger) Ok. Aha! You like\nthat huh?\nJoey: Oh! yeah!\nRachel: You like that? (She climbs on the barcalounger seductively,\nputting her knees next to Joey's hips.) Let's take this into high gear (She\npulls the barcalounger lever and seat reclines. She puts one of her knees between\nhis legs and begins to kiss his neck.)\nJoey: uh uh!\nRachel: Yeah baby, I'll show you how we do it!\nJoey: No, no, no! You kneed me in my misters!\nRachel: What? Oh my God! I'm so sorry. Joey? Are you ok?\nJoey: (He just sits there, legs very close together with\na painful look on his face) Soldier down!\n[Monica and Chandlers apartment.]\n(Chandler is sitting on the couch reading. Monica walks in.)\nMonica: We are not friends with Phoebe anymore.\nChandler: If she asks, I protested a little, but ok!\n(Phoebe and Amanda walk in)\nPhoebe: Oh Chandler! Thank God you're alive. Monica, can\nI talk to you outside for a minute?\nMonica: I have nothing to say to\nyou.\nAmanda: (announces more to herself than anyone else) Wow,\nmy flat is twice this size!\nPhoebe: Please, Monica? In the hall?\n(They both walk to the door and enter the hallway.)\nAmanda: Ooh, that accident must have been terrible. You look\npositively ghastly.\nChandler: Well, aren't you a treat.\n[Scene: The hallway]\nMonica: I can't believe you tried to cut\nme out. Why Phoebe, why?\nPhoebe: It was right after we were living together and you\nwere driving me crazy, okay? You were really controlling and compulsive and\nshrill.\nMonica: I'm still all those things!\nPhoebe: You're also so generous and kind and scrappy!\nMonica: (starts smiling) I am scrappy.\nPhoebe: Exactly! Look, no matter what I tried to do, I couldn't\nkeep you out of my life. Of all the people I have cut out, you were the only\none who ever clawed her way back in.\nMonica: It's because I'm scrappy.\nPhoebe: Yeah, you are. And I'm so glad that you fought your\nway back in, because I don't know what I would do without you.\nMonica: I won't know what I would do without\nyou.\n(They hug)\nMonica: Well, I guess we should go back\nin. When you gave me another chance, I guess we should do the same for Amanda.\nPhoebe: Yeah, I guess you're right.\n(They both enter the apartment again, where Amanda is \"dancing\" for\nChandler, but she's really terrible at it)\nAmanda: Can you believe it. I've never had any professional\ndance training.\n(Monica and Phoebe look at each other and leave the apartment again)\n[Scene: A different spray-on tan center]\n(Glenda, who works here, and Ross are walking to the room with the spray-on tan\nbooth.)\nGlenda: Now, let me explain how this works. You go into the\nbooth, and...\nRoss: I'm gonna stop you right there, Glenda. Okay? Does\nit look like this is my first time, huh? Now I want 4 two's... and I want them\nall on my back.\nGlenda: (quietly) Okay...\n(Ross enters the room, takes off his robe and enters the booth. He stands\nwith his back to the nozzles and then realises that this booth has nozzles\nat both sides of the wall)\nRoss: Wait a minute, there's two sets of nozzles, which one\nis it?\n(He turns around frantically from side to side.)\nRoss: Which... which... which... Which one is it?\n(He then stops turning, facing one of the nozzles, which starts spraying in\nthis face and front again.)\nRoss: OH! SON OF A BITCH!\n(He now turns to the other side, which also starts spraying his face and front.)\n[Scene: Joey and Rachel's]\n(Joey and Rachel are both sitting on the couch. Joey keeping his knees pressed\nagainst each other)\nRachel: What is the matter with us?\nJoey: Well, I know what's the matter with me.\nRachel: No, I mean with us, you know. I mean, is it supposed\nto be this... difficult?\nJoey: I don't know.\n(Chandler enters the apartment)\nChandler: That fake British woman is a real bitch, but she\nsure can dance... Hey!\nRachel: Hi! Hey, listen, can we ask you a question? When\nyou and Monica first hooked up, was it weird going from friends to... more\nthan that?\nChandler: Kinda... you know, sneaking around, having to hide\nfrom you guys...\nRachel: No, no, no... No, I mean... se-x-u-ally...\nJoey: Yeah, was there a part of you that... felt like it\nwas... really wrong?\nChandler: Actually, no. No, it felt right. You know, it felt\nlike uhm... I can't believe we haven't been doing this the whole time.\n(Rachel and Joey are still looking at Chandler, slowly letting his words get\nto them)\nChandler: I can tell from your expressions that that's the\ngood news you were hoping for... Well, I'm gonna go continue to... spread the\njoy.(Chandler leaves the apartment. Joey sighs)\nRachel: Well, just because it happened that way for them\ndoesn't mean it has to happen that way for us.\nJoey: Yeah, yeah... Absolutely. I mean, just because something's\ndifficult doesn't mean that you quit.\nRachel: Right, totally.\nJoey: Yeah, so we just keep trying and trying until we...\ndo it.\nRachel: Yeah, and if doesn't work, then we'll be just one\nof those couples that never have sex.\nJoey: That's a... pla-an.\n(They both stare for a while, and then look at each other)\nJoey: (sighs) Wow... I did not see this coming.\nRachel: I know.\nJoey: I don't get it. I mean, I was so sure this was what\nI wanted.\nRachel: Hmmm... Me too...\n(She puts her head on Joey's shoulder and Joey kisses her on her head.)\nRachel: I wonder how Monica and Chandler could do it?\nJoey: I guess they weren't as good friends as we are.\n(Lifts her head from Joey's shoulder)\nRachel: Aah... I bet you're right.\n(They look at each other for a while)\nJoey: So...\nRachel: Yeah.\nJoey: I love ya.\nRachel: Love you too... Alright, I'm going to bed.\nJoey: Yeah, me too.\n(Rachel gets up, and Joey tries to get up, but halfway up he sits down again.)\nJoey: Ooh, yeah, I'm not going anywhere for a while.\n(Joey takes the ice-bucket with the champagne bottle in it and puts it on\nhis sore spot)\nENDING CREDITS\n[Scene: Ross's apartment.]\n(Ross is reading a National Geographic on his sofa when Chandler knocks on the\ndoor.)\nChandler: Dude, it's Chandler. Let me in.\n(Ross's face is now a VERY dark shade of brown.)\nRoss: Go away! I don't want to see anybody.\nChandler: I know, I went to the tanning place and the same\nthing happened to me. You have to let me in.\nRoss: Really? Did you count Mississipily?\n(Ross walks to the door and opens it.)\nRoss: Dude, you're not tanned.\nChandler: No, I just had to get a picture of this.\n(Chandler holds up a camera and takes Ross's picture.)\nChandler: I see you later!\n(Ross closes the door)\nend",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/1003.html",
  "scrapedAt": "2025-12-17T14:33:58.828Z",
  "wordCount": 3949,
  "hasCharacterNames": true
}