{
  "title": "Cricket World Cups",
  "content": "## Cricket World Cup\n\nThe ICC Men's Cricket World Cup is a quadrennial world cup for cricket in One Day International (ODI) format, organised by the International Cricket Council (ICC). The tournament is one of the world's most viewed sporting events and considered the flagship event of the international cricket calendar by the ICC.\n\n---\n\n## ICC Cricket World Cup\n\nThe ICC Men's Cricket World Cup is a quadrennial world cup for cricket in One Day International (ODI) format, organised by the International Cricket Council (ICC). The tournament is one of the world's most viewed sporting events and considered the flagship event of the international cricket calendar by the ICC.\n\n---\n\n## List of Cricket World Cup finals\n\nThe ICC Men's Cricket World Cup is an international cricket competition established in 1975. It is contested by the men's national teams of the members of the International Cricket Council (ICC), the sport's global governing body. The tournament generally takes place every four years. Most recently, the 2023 Cricket World Cup, hosted by India, was won by Australia, who beat India. The current trophy was instituted in 1999. It always remains with the ICC, and a replica is awarded to the winning team.\nFor the 2019 and 2023 World Cups, the host nation and the seven other highest-ranked nations automatically qualify for the World Cup, while other nations including associate and affiliate ICC members play in a qualification tournament, the World Cup Qualifier. Though an associate member is yet to reach the final, Kenya did reach the semi-finals in 2003. Australia is the most successful team in the competition's history, winning six tournaments and finishing as runner-up twice. Twice, teams have won successive tournaments: the West Indies won the first two editions and Australia won three in a row. Australia has played in the most finals. England has lost the most World Cup finals, ending as runner-up in all three final appearances before their victory in the 2019 tournament.",
  "source": "Wikipedia (Sports)",
  "sourceUrl": "https://en.wikipedia.org/wiki/Cricket%20World%20Cup",
  "fetchedAt": "2025-12-20T12:10:38.700Z",
  "citations": [
    {
      "text": "Cricket World Cup",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Cricket_World_Cup"
    },
    {
      "text": "ICC Cricket World Cup",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Cricket_World_Cup"
    },
    {
      "text": "List of Cricket World Cup finals",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/List_of_Cricket_World_Cup_finals"
    }
  ],
  "asOfDate": "2025-12-20",
  "metadata": {
    "category": "sports",
    "subcategory": "cricket",
    "topic": "cricket-world-cups",
    "articleCount": 3,
    "warning": "Sports statistics and records may change. Data accurate as of fetch date."
  }
}