[
  "What does Joey drink from the fridge, thinking it's cider?",
  "How much time does Ross say they have to get dressed before they have to leave?",
  "What is Phoebe's reaction when Joey flings dip onto her dress?",
  "Why does Monica call Richard's answering machine?",
  "What does Ross offer to do to prove his love for Rachel?",
  "What is the reason for Rachel's initial reluctance to attend the banquet?",
  "What does Monica accidentally record on Richard's answering machine?",
  "What does Chandler say is the 'essence of the chair'?",
  "Why does Joey take all of Chandler's clothes?",
  "What does Rachel reveal to Ross at the end of the episode?",
  "What is the name of the person Ross meets at the banquet?",
  "What is the topic of Ross's paper that impresses Sherman Whitfield?",
  "Why does Chandler get into an argument with Sherman Whitfield?",
  "What does Phoebe use to cover up the stain on her dress?",
  "What does Ross say to Rachel when she's trying to decide what shoes to wear?",
  "What is the reason for Monica's phone call to Michelle?",
  "What does Joey do when Chandler hides his underwear?",
  "What is the result of Monica's phone call to Richard's answering machine?",
  "What does Ross do when Rachel says she's not going to the banquet?",
  "What is the reason for Phoebe's initial reluctance to wear Monica's green dress?",
  "What does Chandler say to Joey when he's sitting in the chair?",
  "What is the result of Monica's conversation with Michelle on the phone?",
  "What does Ross say to Rachel when she's getting dressed?",
  "What does Joey do when Chandler tries to take the chair from him?",
  "What is the reason for Monica's initial call to Richard's answering machine?",
  "What does Phoebe say when she's trying on Monica's green dress?",
  "What does Ross say to Rachel when she says she's not going to the banquet?",
  "What does Chandler say when Joey is wearing all of his clothes?",
  "What does Monica do when she realizes she's recorded her outgoing message on Richard's answering machine?",
  "What does Ross do when Rachel says she's going commando?"
]