[
  "What is the reason for Mr. Heckles' complaint to Monica?",
  "What does Ross say is 'scientific fact, like, like, like the air we breathe, like gravity'?",
  "Why did Joey initially think women had Adam's apples?",
  "What does Phoebe sense in the building after Mr. Heckles' death?",
  "What is the name of Mr. Heckles' attorney?",
  "What does Mr. Heckles leave to Monica and Rachel in his will?",
  "Why does Chandler reject many women he dates?",
  "What does Ross try to convince Phoebe of?",
  "What does Phoebe compare the possibility of evolution to?",
  "What does Chandler find in Mr. Heckles' apartment that makes him realize they have things in common?",
  "Why does Chandler want to keep Mr. Heckles' yearbook?",
  "What does Monica suggest the friends do to honor Mr. Heckles' memory?",
  "What does Chandler decide to do after his conversation with Janice?",
  "What is Alison's major in college?",
  "What does Chandler think about Alison's head size when he meets her?",
  "Why does Chandler want to take risks and be vulnerable with someone?",
  "What does Monica give to Rachel to make up for breaking her lamp?",
  "What does Phoebe say about Ross' need to make everyone agree with him?",
  "What does Chandler decide to call himself if he ends up alone?",
  "What does Ross show Phoebe to prove the validity of evolution?",
  "What does Phoebe say about the possibility of evolution being wrong?",
  "What does Joey find in Mr. Heckles' apartment that he wants to keep?",
  "What does Monica say about Chandler being different from other men?",
  "What does Rachel accuse Monica of doing to her lamp?",
  "What does Phoebe say about the idea that 'you can touch someone's life without even knowing it'?",
  "What does Chandler say about his date with Alison?",
  "What does Ross say about the fossils he shows Phoebe?",
  "What does Phoebe say about the idea of evolution being 'one of the possibilities'?",
  "What does Joey say about Chandler's chances of finding someone?",
  "What does Monica say about Mr. Heckles' apartment?",
  "What does Chandler say about his relationship with Janice?",
  "What does Phoebe say about Ross' briefcase of facts?",
  "What does Monica say about Chandler's decision to ask out Alison?",
  "What does Chandler say about his fear of ending up alone?"
]