[
  "What is Ross watching on TV at Chandler and Joey's apartment?",
  "What is the name of the woman who leaves a message on Ross's answering machine?",
  "What is the reason for Monica's celebration at the restaurant?",
  "What is the name of the band that Ross's friends want to see in concert?",
  "Why do Rachel, Phoebe, and Joey feel uncomfortable about Ross's birthday celebration?",
  "What is the outcome of Monica's job after she receives a call from her boss?",
  "What does Chandler tell Jade when she asks him about the guy she had sex with?",
  "Who does Monica run into at the concert?",
  "Why does Phoebe decline the invitation to the concert?",
  "What is the name of the person who gives Monica a hickey?",
  "What is the reason for the group's discussion about money?",
  "What is Chandler's response to Jade's message on Ross's answering machine?",
  "What is the outcome of Chandler's conversation with Jade?",
  "What is the name of the restaurant where the group celebrates Monica's promotion?",
  "What is the reason for Joey's reluctance to order food at the restaurant?",
  "What is Phoebe's order at the restaurant?",
  "What is the name of the person who represents the band Hootie and the Blowfish?",
  "What is the outcome of Monica's conversation with her boss?",
  "What is the reason for Rachel's sarcasm when she says 'Hi, Julie'?",
  "What is the name of the song that Chandler requests the waiter to sing?",
  "What is the amount that each person owes for Ross's birthday celebration?",
  "What is the reason for Phoebe's reluctance to pay $33.50 for Ross's birthday celebration?",
  "What is the name of the dish that Monica brings home for dinner?",
  "What is the reason for Joey's joke about selling his kidney?",
  "What is the outcome of Chandler's date with Jade?",
  "What is the reason for the group's decision to not attend the concert?",
  "What is the name of the person who gives Monica a job opportunity?",
  "What is the reason for Ross's friends' decision to buy him concert tickets?",
  "What is the outcome of Monica's conversation with Steve?",
  "What is the reason for Phoebe's decision to not attend the concert?"
]