[
  "What does Rachel say Ross did that is 'pretty appalling'?",
  "What does Phoebe ask Rachel about Ross's kiss?",
  "What is the name of the song Phoebe sings about a love triangle?",
  "What does Monica taste at Mr. Ratstatter's office?",
  "What is Ross's profession?",
  "Why does Ross break up with Julie?",
  "What does Chandler suggest Ross and Joey do to help Ross decide between Rachel and Julie?",
  "What does Rachel see on Chandler's computer screen?",
  "What is the name of the product Mr. Ratstatter is trying to market?",
  "What is Phoebe's reaction to Ross's list?",
  "What does Ross do to try to win Rachel back?",
  "What is the reason why Mr. Ratstatter's FDA approval didn't come through?",
  "What does Monica tell Mr. Ratstatter about the Mockolate?",
  "What does Joey suggest Ross do to solve his love triangle problem?",
  "What is the name of the new computer Chandler has?",
  "What does Phoebe sing about in her song 'Two of Them Kissed Last Night'?",
  "What does Rachel say to Ross when he tries to win her back?",
  "What does Monica make for Phoebe and Rachel to taste?",
  "What is the problem with the Mockolate, according to Monica?",
  "What does Ross read to Rachel from his list?",
  "What is the name of the product Mr. Ratstatter introduces to Monica in his second appearance?",
  "Why does Ross climb up the fire escape to Rachel's apartment?",
  "What does Monica say to Mr. Ratstatter when he asks if she ate a lot of Mockolate while cooking?",
  "What is the reaction of the radio host when Rachel calls in and tells him about Ross's list?",
  "What does Rachel say about her ankles when Monica tells Ross that Rachel said her ankles are weighing her down?",
  "What does Phoebe call Ross when she finds out about his list?",
  "What does Chandler say to Ross when Ross is trying to decide between Rachel and Julie?",
  "What is the result of Mr. Ratstatter's FDA approval for Mockolate?",
  "What does Ross say to Rachel when she's upset about his list?",
  "What does Monica offer to Ross when he's wet and cold after climbing up the fire escape?",
  "What is the final outcome of Ross's attempts to win Rachel back?"
]