{
  "show": "Friends",
  "season": 2,
  "episode": 8,
  "title": "The One With the Last",
  "transcript": "The One With the List\nOriginally written by Marta Kauffman and David Crane\nTrascribed by Mindy Mattingly Phillips [mmatting@indiana.edu]\nMinor additions and adjustments by Dan Silverstein.\n[Scene: Monica and Rachel's apartment. Phoebe, Monica, and Rachel are there, discussing\nthe night before.]\nRACH: Ross kissed me.\nMNCA: Oh my god, oh my god, oh my god!\nRACH: It was unbelievable!\nMNCA: Oh my god, oh my god, oh my god!\nPHOE: Ok, all right. We want to hear everything. Monica, get the wine and unplug the\nphone. Rachel, does this end well or do we need to get tissues?\nRACH: Oh, it ended very well.\nPHOE: Oh.\nMNCA: [getting the wine] Do not start without me. Do not start without me.\nPHOE: Ok, all right, let's hear about the kiss. Was it like, was it like a soft brush\nagainst your lips? Or was it like a, you know, a \"I gotta have you now\" kind of\nthing?\nRACH: Well, at first it was really intense, you know. And then, oh, god, and then we\njust sort of sunk into it.\nPHOE: Ok, so, ok, was he holding you? Or was his hand like on your back?\nRACH: No, actually first they started on my waist. And then, they slid up, and then,\nthey were in my hair.\nPHOE/MNCA: Ohhhh.\n[Scene: Ross' apartment. Ross, Chandler, and Joey are there eating pizza.]\nROSS: And, uh, and then I kissed her.\nJOEY: Tongue?\nROSS: Yeah.\nJOEY: Cool.\nOpening Credits\n[Scene: Central Perk. Joey, Phoebe, Monica, and Chandler are there; Chandler is\nshowing everyone his new computer.]\nCHAN: All right, check out this bad boy. 12 megabytes of ram. 500 megabyte hard drive.\nBuilt-in spreadsheet capabilities and a modem that transmits at over 28,000 b.p.s.\nPHOE: Wow. What are you gonna use it for?\nCHAN: [doggedly] Games and stuff.\nMNCA: [reading the paper] There are no jobs. There are no jobs for me.\nJOEY: [reading over her shoulder] Wait, here's one. Uh, would you be willing to cook\nnaked?\nMNCA: There's an ad for a naked chef?\nJOEY: No, but if you're willing to cook naked, then you might be willing to dance\nnaked. And then... [rubs his fingers together]\n[Ross enters, distraught.]\nROSS: Hi.\nPHOE: Hey, oh, so, um...how'd you make out last night?\nROSS: That, that is funny. That is painfully funny. No, wait. Wait, yeah, that's just\npainful\nMNCA: Wait a minute. I thought last night was great.\nROSS: Yeah, it was, but...I get home, ok, and I see Julie's saline solution on my night\ntable. And I'm thinking to myself, oh my god, what the hell am I doing? I mean, here I am,\nI am with Julie, this incredible, great woman, who I care about and who cares about me,\nand I'm like, what, am I just gonna throw all that away?\nJOEY: You got all that from saline solution?\nMNCA: We are talking about Rachel here. You and Rachel.\nROSS: Believe me, I've been dreaming about me and Rachel for ten years now. But now,\nI'm with Julie, so it's like me and Julie, me and Rachel, me and Julie, me and... [Rachel\nenters, carrying a tray]... Rachel. Rachel, Rachel.\nRACH: [to Ross] Hey, you.\nROSS: How are you?\nRACH: Good. How are you?\nROSS: Good.\n[Julie enters.]\nJULIE: Hi, honey.\nROSS: Hi, Julie. [nervous] Hi, Julie. Julie, um, how are you?\nJULIE: Good.\nROSS: [uncomfortable] Good, so everybody's here. Everybody's good. So, were you gonna\nplay something, Phoebe?\nPHOE: Oh, well, actually.\nROSS: [impatient] Play it.\nPHOE: Ok, all right.\nJOEY: Hey, Julie, I didn't know you wore lenses.\nJULIE: What?\nROSS: [to Joey] Ssshh.\nPHOE: Ok, um, hi, hello, hi, ok, so, um, this is a song about a love triangle between\nthree people that I made up. Um, it's called, um, \"Two of Them Kissed Last\nNight\".\n[Ross and Rachel look at each other and then at Phoebe, realizing the song is about\ntheir situation.]\nPHOE: [singing] There was a girl, we'll call her Betty, and a guy let's call him Neil.\nNow I can't stress this point too strongly, this story isn't real. Now our Neil must\ndecide, who will be the girl that he casts aside. Will Betty be the one who he loves\ntruly? Or will it be the one who we'll call Ju...Loolie? He must decide, he must decide,\neven though I made him up, he must decide!\n[Scene: Mr. Ratstatter's (RTST) office. Monica is there about a job.]\nRTST: This is a nice resume. Nice, nice, nice. Muy impressivo.\nMNCA: So, Mr. Rastatter, what exactly does this job entail? The ad wasn't too clear.\nRTST: Mockolate.\nMNCA: I'm sorry?\nRTST: Mockolate. It's a completely synthetic chocolate substitute.\nMNCA: Ohh.\n[He pulls out a piece of Mockolate.]\nRTST: Go ahead. Try a piece. Yeah, we think that Mockolate is even better than\nchocolate.\nMNCA: All right. Mmm-mmm.\n[She tastes it, and obviously hates it.]\nRTST: Yeah?\nMNCA: [disgusted, trying not to show it] I love how it crumbles. Now see, your\nchocolate doesn't do that.\nRTST: No, ma'am. Well, anyhoo, we should be getting our F.D.A. approval any day now,\nhopefully, in time for Thanksgiving. See, the way we look at it, chocolate already\ndominates most of your major food-preparation holidays: Easter, Christmas, what have you.\nMNCA: [still chewing] Mmm-mmm.\nRTST: But, we're thinking, given the right marketing, we can make Thanksgiving the\nMockolate holiday.\nMNCA: Wow.\nRTST: Aren't you going to swallow that?\nMNCA: Just waiting for it to stop bubbling.\nRTST: Yeah, isn't that great?\nMNCA: [with false enthusiasm] Mmm.\nRTST: Well, anyhoo, um, we are looking for a couple of chefs who can create some\nThanksgiving-themed recipes. You think you might be interested?\nMNCA: Abso...[swallows hard]...lutely. See, I love creating new recipes. I love\nThanksgiving. And, well, now, I love Mockolate.\nRTST: Really?\nMNCA: Especially the after taste, you know, I'll tell ya, that'll last ya till\nChristmas.\n[Scene: Monica and Rachel's apartment. Monica and Phoebe are there. Monica is\nsuggesting Mockolate recipes to Phoebe.]\nMNCA: How about Mockolate mousse?\nPHOE: It's not, it's not very Thanksgiving-y.\nMNCA: Ok, how about pilgrim Mockolate mousse?\nPHOE: What makes it pilgrim?\nMNCA: We'll put buckles on it.\n[Rachel enters.]\nRACH: Hey.\nPHOE: Hey.\nMNCA: Hey.\nRACH: Did uh, Ross call?\nMNCA: No, I'm sorry.\nRACH: Why didn't he call? He's gonna stay with Julie, isn't he? He's gonna stay with\nher and she's going to be all, \"Hi, I'm Julie, Ross picked me, and we're gonna to get\nmarried, have a lot of kids and dig up stuff together.\"\nPHOE: No offense, but that sounds nothing like her.\n[Scene: Chandler and Joey's apartment. Ross is up in arms about the Rachel/Julie\nsituation.]\nROSS: I don't know what to do. What am I gonna do? I mean, this, this is like a\ncomplete nightmare.\nCHAN: Oh, I know. This must be so hard. Oh, no. Two women love me. They're both\ngorgeous and sexy. My wallet's too small for my fifties, and my diamond shoes are too\ntight.\nJOEY: Hey, here's a thought, Ross. [reaches for the computer]\nCHAN: Don't touch the computer. Don't ever touch the computer.\nJOEY: Ross, listen. I got two words for you. Threesome.\n[Ross gives him an insulted look.]\nCHAN: Ok, all right, look. Let's get logical about this, ok? We'll make a list. Rachel\nand Julie, pros and cons. Oh. We'll put their names in bold, with different fonts, and I\ncan use different colors for each column.\nROSS: Can't we just use a pen?\nCHAN: No, Amish boy.\nJOEY: Ok, let's start with the cons, 'cause they're more fun. All right, Rachel first.\nROSS: I don't know. I mean, all right, I guess you can say she's a little spoiled\nsometimes.\nJOEY: You could say that.\nROSS: And I guess, you know, sometimes, she's a little ditzy, you know. And I've seen\nher be a little too into her looks. Oh, and Julie and I, we have a lot in common 'cause\nwe're both paleontologists, but Rachel's just a waitress.\nCHAN: Waitress. Got it. You guys wanna play Doom? Or we could keep doing this. What\nelse?\nROSS: I don't know.\nJOEY: Oh, her ankles are a little chubby.\nCHAN: Ok, let's do Julie. What's wrong with her?\nROSS: [long pause] She's not Rachel.\n[Scene: Monica and Rachel's apartment. Monica has made food for Phoebe and Rachel to\ntaste.]\nMNCA: Ok, this is pumpkin pie with mockolate cookie crumb crust. This is mockolate\ncranberry cake, and these are mockolate chip cookies. Just like the Indians served.\n[Rachel takes a bite.]\nRACH: Oh my god.\nMNCA: Oh my god good?\nRACH: Oh my god, I can't believe you let me put this in my mouth.\n[Rachel runs to the sink to spit it out.]\nPHOE: Oh, oh sweet Lord! This is what evil must taste like!\n[Scene: Chandler and Joey's apartment. Chandler is on the phone with a computer\nhotline.]\nCHAN: I'm telling you this thing won't print. Yes, I pressed that button like 100\ntimes. You know, for a hot line you are not so hot. What? What is that in the background?\nAre you watching Star Trek?\n[Ross enters with a melancholy look.]\nJOEY: [to Ross] Hey, so how'd it go with Julie? Did you, did you break her heart?\nROSS: Yes, it was horrible. She cried. I cried. She threw things, they hit me. Anyway,\nI did the right thing.\nCHAN: [in phone] So, Spock actually hugs his father?\n[Rachel enters.]\nRACH: Hey, do you guys have...[sees Ross, pauses]...hi.\nROSS: Hi.\nRACH: [sees his coat on] Where you goin'?\nROSS: I uh, I just got back from uh, from Julie's.\nRACH: [dejected] Oh.\nROSS: No, no, uh, it's not what you think. It's um the other thing.\nRACH: Well, what's the other thing, what do I think?\n[Joey is looking at Rachel, smiling, and gesturing his head towards Ross.]\nROSS: Well, uh.\nJOEY: He broke up with Julie. Well, go hug her, for god's sakes.\nRACH: Really?\nROSS: Really. It's always been you, Rach.\n[Ross and Rachel hug.]\nRACH: Oh, god.\nJOEY/CHAN: Ohhh.\nRACH: Oh, oh, this is good, this is really good.\nROSS: I know, I know, it's, it's almost...[turns around, sees Chandler and Joey] What\ndo you say we go take a walk, just us, not them?\nRACH: Let me get my coat.\nROSS: Ok. No, hey, whoa, whoa, I'll get your coat.\n[Ross leaves.]\nRACH: Ok, he's goin' to get my coat. He's goin' to get my coat. Oh my god, you guys. I\ncan't believe this. This is unbelievable. [notices Chandler's computer screen] What's\nthat?\nCHAN: [nervous] What? Nothing.\n[Chandler closes up the laptop computer screen.]\nRACH: What's that? What? I saw my name. What is it?\nCHAN: No, no, see? See? [the printer starts to run] Hey, it's printing. [to Joey,\nrattled] Hey, it's printing!\n[Chandler rips off the sheet of paper from the printer.]\nRACH: Well what is it? Let me see.\n[Ross walks back in, Rachel's coat in hand.]\nROSS: Hey, someone order a coat?\nRACH: Ross, Chandler wrote something about me on his computer and he won't let me see.\nROSS: He won't? [remembers what it is] He won't! Because, isn't that, isn't that the,\nthe short story you were writing?\nCHAN: Yes, yes it is, short story, that I was writing.\nRACH: And I'm in it? Then let me read it.\nCHAN, JOEY, ROSS: No!\nRACH: Come on.\nJOEY: Hey, uh, why don't you read it to her?\n[Ross and Chandler stare angrily at Joey, who thinks he has come up with a good idea.]\nCHAN: [through gritted teeth] Alright. [clears his throat] \"It was summer, and it\nwas hot. Rachel was there. A lonely gray couch. 'Oh, look,' cried Ned, and then the\nkingdom was his forever. The end.\"\nROSS: That's it? That's all you wrote? You're the worst writer in the whole world.\nRACH: All right, you know what? This isn't funny anymore. There's something about me on\nthat piece of paper and I want to see it.\nROSS: No, you don't.\nRACH: All right, you know what, that's fine. If you guys want to be children about\nthis, that's fine. I do not need to see it. [Rachel grabs the paper and runs across the\nroom, reading it to herself.]\nRACH: What is this? Ross, what is this?\nCHAN: Good luck.\n[Chandler and Joey leave quickly.]\nROSS: Ok, just, just remember how crazy I am about you, ok?\nRACH: Kind of ditzy? Too into her looks? Spoiled?\nROSS: Now that's a little spoiled. He was supposed to type \"little\", the\nidiot.\nRACH: Just a waitress?\nROSS: No, that, that was, I mean, as opposed to uh, the uh, ok. Is this over yet Rach?\nRACH: Oh! I do not have chubby ankles!\n[Rachel leaves, and Ross follows her into the hall.]\nROSS: No, no, wait, ok, ok, look at the other side. Look at Julie's column.\nRACH: She is not Rachem. What the hell's a Rachem? Is that some stupid\npaleontology word that I wouldn't know because I'm just a waitress.\n[She goes into her apartment and slams the door.]\nROSS: No, Rach, come on. Rach! Rach, no, no! She's not Rachel, she is, she is not,\nRa--Rachel?\n[Scene: Central Perk. Chandler, Monica, Joey, and Phoebe are there.]\nCHAN: My diary! My diary, that's brilliant. I should have told her it was my diary, she\nnever would have made me read her my diary.\nMNCA: You know, that's true. You'd be a great person to have around the day after an\nemergency.\nPHOE: I... I cannot believe Ross even made this list. What a dinkus.\nJOEY: Hey, cut him some slack. It was Chandler's idea.\nPHOE: What?\nMNCA: What?\nCHAN: Oh good, I was hoping that would come up.\nMNCA: This was your idea?\nPHOE: What were you thinking?\nCHAN: [squirming] All right, let's get some perspective here, ok? These things, they\nhappen for a reason.\nMNCA: Yeah. You!\nCHAN: All right, Pheebs, back me up here, ok? You believe in that karma crap, don't\nyou?\nPHOE: Yeah, by the way, good luck in your next life as a dung beetle.\n[Scene: Monica and Rachel's apartment. Rachel is sitting on the couch, eating candy. It\nis raining out. Ross climbs up the fire escape and is knocking on the window.]\nROSS: Rach! Whoops! Rach, hey, open up, please!\nRACH: [coldly] When somebody does not buzz you in, Ross, that means go away. That\ndoesn't mean please climb up the fire escape.\nROSS: I just wanna read something. It's your pro list.\nRACH: Not interested.\n[Rachel closes the drapes over the window, goes into her bedroom and closes the door.]\nROSS: [reading his list] Ok, ok, number one: The way you cry at game shows. Number two:\nhow much you love your friends. Number three: the way you play with your hair when you're\nnervous. Number four: how brave you are for starting your life over. Number five: how\ngreat you are with Ben.\n[Monica, Chandler, Joey, and Phoebe enter, confused.]\nROSS: Number six: the way you smell.\nJOEY: [opens the drapes] Hey, Ross! What are you doin'?\nROSS: Hey, Joey. You wanna open the window?\nJOEY: Oh, yeah, I do.\n[He opens the window, Ross comes in, soaked.]\nCHAN: What are you doing out there?\nROSS: I am, uh, I am...\nMNCA: Oh, you must be freezing. You know what you need? How about a nice steaming cup\nof hot Mockolate?\n[Ross runs to Rachel's bedroom, knocking on the door.]\nROSS: Rach, come on, open up. Rach, come on, come on, Rach. You got to give me another\nchance.\n[Rachel opens the door.]\nRACH: No.\nROSS: No?\nRACH: That's what I said.\nCHAN: Look, maybe we should go?\nRACH: No, you guys, you really don't have to go, we're done talking.\nROSS: Rach, come on, look, I know how you must feel.\nRACH: [near tears] No, you don't, Ross. Imagine the worst things you think about\nyourself. Now, how would you feel if the one person that you trusted the most in the world\nnot only thinks them too, but actually uses them as reasons not to be with you.\nROSS: No, but, but I wanna be with you in spite of all those things.\nRACH: Oh, well, that's, that's mighty big of you, Ross. [to the others] I said don't\ngo!\nROSS: You know what? You know what? If, things were the other way around, there's\nnothing you could put on a list that would ever make me not want to be with you.\nRACH: Well, then, I guess that's the difference between us. See, I'd never make a list.\n[She closes the door in his face. Ross walks sullenly back to the couch and sits down.\nA moment of silence ensues.]\nJOEY: [quietly] I never know how long you're supposed to wait in this type of a\nsituation before you can talk again, you know? [Ross stares blankly at him] Maybe a little\nlonger.\n[Scene: Mr. Ratstatter's office. Monica is there.]\nMNCA: Now, in some of these recipes, the quantities may seem just a little unusual, uh,\nlike these coconut mockolate holiday nut bars. I've indicated four cups of coconut, and\nfour cups of crushed nut, and only, uh, one tablespoon of mockolate.\nRTST: Doesn't matter.\nMNCA: What?\nRTST: Our FDA approval didn't come through. Something about laboratory rats.\nMNCA: Oh, gosh, I'm sorry.\nRTST: Yeah, well, anyhoo, here is your check. [hands it to her] Thank you for all the\ntrouble you went through. Um, listen, you didn't eat a lot of it while you were cooking,\ndid you?\nMNCA: Well, uh, I ate some.\nRTST: Oh, some, that's fine. Some is fine. Some is not a lot. So, it doesn't burn when\nyou pee, does it?\n[Scene: Monica and Rachel's apartment. Monica and Rachel are there.]\n(phone rings)\nMNCA: Hello?\n[Ross is at his apartment.]\nROSS: Hi.\nRACH: [to Monica] Is that him again? Tell him I'd come to the phone, but my ankles are\nweighin' me down.\nMNCA: [to Ross] Listen, I... I don't think this is the best time.\nROSS: Look, can, can you do something for me?\nMNCA: Sure, what? Ok, ok. [hangs up the phone] [to Rachel] Music?\n[Monica turns on the radio.]\nRADIO: The next one's dedicated to Rachel from Ross. Rachel, he wants you to know he's\ndeeply sorry for what he did and he hopes you can find it in your heart to forgive him. (With\nor Without You plays)\n[Rachel seems touched. She pauses for a moment, then picks up the phone and starts to\ndial. Cut to Ross at his apartment.]\nRADIO: Uh, we've just gotten a call from Rachel, and she told us what Ross did. It's\npretty appalling, and Ross, if you're listening, I don't wanna play your song anymore. Why\ndon't we devote our time to a couple that stands a chance? Avery, Michelle's sorry she hit\nyou with her car and she hopes you two will work it out.\n[Scene: Mr. Ratstatter's office. Monica is there.]\nRTST: Hi, thanks for coming in again.\nMNCA: Oh, not at all. I have no morals and I need the cash.\nRTST: It's like I'm lookin' in a mirror. Anyway, they're called\n\"fishtachios\". They taste exactly like pistachios, but they're made primarily of\nreconstituted fish bits. Here, try one. You're not allergic to anything, are you?\nMNCA: Cat hair.\nRTST: Oh, sorry.\nEND",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0208.html",
  "scrapedAt": "2025-12-17T14:26:47.866Z",
  "wordCount": 3256,
  "hasCharacterNames": true
}