[
  "What does Joey say is the reason he wanted to be a veterinarian when he was little?",
  "What is the name of the talent agency where Joey has an audition?",
  "What is the name of the woman Ross mentions who is the curator of moths and other winged things?",
  "What does Rachel say she will not be doing with Ross?",
  "What does Russ do for a living?",
  "What is the name of the character Joey plays on Days of Our Lives?",
  "Why does Fun Bobby break up with Monica?",
  "What does Phoebe think Rachel sees in Russ?",
  "What does Joey decide to do about the casting lady's offer?",
  "What is the name of the bar where the gang hangs out?",
  "What does Chandler compare Ross's problem with Russ to?",
  "What does Monica use to make Fun Bobby's stories more amusing?",
  "What does Joey's agent tell him about the audition?",
  "What does Rachel say to Ross when he asks her about her date with Russ?",
  "What does Phoebe think is the reason why Rachel is dating Russ?",
  "What does Joey decide to do after the casting lady offers him a bigger part?",
  "What is the name of the museum where Ross works?",
  "What does Chandler say is the reason why Ross is jealous of Russ?",
  "What does Monica tell Fun Bobby when he says he thinks she has a drinking problem?",
  "What does Russ say to Rachel when she breaks up with him?",
  "What does Joey's agent tell him about the casting lady?",
  "What does Rachel say to Phoebe when Phoebe asks her if she sees the resemblance between Russ and Ross?",
  "What does Chandler compare the situation between Ross and Russ to?",
  "What does Monica tell the gang when Fun Bobby breaks up with her?",
  "What does Joey decide to do after the casting lady offers him a bigger part?",
  "What does Ross say to Rachel when she breaks up with Russ?",
  "What does Phoebe think is the reason why Rachel is not interested in Ross?",
  "What does Monica use to make Fun Bobby's stories more amusing when he is sober?",
  "What does Chandler say to Joey when he decides not to sleep with the casting lady?",
  "What does Ross say to Russ when they meet for the first time?",
  "What does Phoebe think is the reason why Rachel is dating Russ?",
  "What does Joey decide to do after the casting lady offers him a bigger part?"
]