[
  "What does Ross say is 'amazing' about a guy's ability?",
  "What does Joey say women can see anytime they want?",
  "What is the reason Ross gives for not doing his laundry in his own building?",
  "What is the name of the laundry detergent Ross uses?",
  "What happens to Rachel's clothes after she does her laundry?",
  "Who does Joey ask to pretend to be his girlfriend?",
  "What does Chandler compare himself to when talking to Janice about their relationship?",
  "What is the reason Rachel gives for feeling like she can't live on her own?",
  "What does Phoebe compare breaking up with someone to?",
  "What does Ross do after Rachel kisses him?",
  "What is the name of the woman who keeps causing trouble for Rachel at the laundromat?",
  "What does Monica say about Bob?",
  "What does Joey say about Angela's eating habits?",
  "What does Chandler give as a reason for breaking up with Janice?",
  "What does Phoebe do to help Chandler break up with Janice?",
  "What is the outcome of Rachel and Ross's laundry adventure?",
  "What does Monica say about Bob's emotional age?",
  "What does Joey say about his plan to win Angela back?",
  "What does Chandler do after he breaks up with Janice?",
  "What does Phoebe say about breaking up with someone?",
  "What does Ross say about doing laundry?",
  "What does Monica say about Angela and Bob's relationship?",
  "What does Joey say about Angela's new boyfriend?",
  "What does Chandler do to prepare for his break-up with Janice?",
  "What does Phoebe do after Chandler breaks up with Janice?",
  "What is the result of Rachel's confrontation with the woman at the laundromat?",
  "What does Ross say about the laundry detergent he uses?",
  "What does Monica say about her experience with Joey's cousin?",
  "What does Joey say about his plan to break up Angela and Bob?",
  "What does Chandler say about his relationship with Janice?",
  "What does Phoebe say about her break-up with Tony?",
  "What does Ross do to help Rachel with her laundry?",
  "What does Monica say about Bob's personality?",
  "What does Joey say about Angela's new boyfriend Bob?",
  "What does Chandler do after he breaks up with Janice?"
]