{
  "show": "Friends",
  "season": 6,
  "episode": 4,
  "title": "The One Where Joey Loses His Insurance",
  "transcript": "The One Where Joey Loses His Insurance\nWritten by: Andrew Reich & Ted Cohen\nTranscribed by: Eric Aasen\n[Scene: Monica and Rachel's, Rachel is packing her belongings to move to Ross’s.\nShe’s standing in the kitchen.]\nRachel: So, which of this kitchen stuff is mine?\nMonica: This bottle opener. (She grabs it off of the freezer door.)\nRachel: And?\nMonica: And it’s a magnet!\nRachel: Look at that!\nRoss: How weird is that? Y’know? You’re moving in with me and have the\none thing I don’t have. It’s like uh, in a way you-you complete me\n(Phoebe glares at him) kitchen.\nRachel: What?!\nRoss: (in an Australian accent) You complete me kitchen, matey!\nPhoebe: Ross, I know what you’re thinking.\nRoss: What?\nPhoebe: That she’s gonna move in with you and maybe then she’ll fall\nin love with you and then when she finds out you’re already married, she’ll just\nbe happy. Y’know? You’re just, you’re very sad.\nRoss: Oh…my…God! I-I see what this is! You are in love with\nRachel!\nPhoebe: What?!!\nRoss: Of course! It all adds up! I mean you you’re obsessed with her.\nIt’s always, \"Ross, what are you gonna do about Rachel?\" \"Ross,\nwhy-why are you moving in with Rachel?\" \"When are you gonna confess your secret\nmarriage to Rachel?\" You want her!\nPhoebe: No! (Ross’s phone rings.)\nRoss: (answering it) Uh-oh, saved by the bell. (On phone) Hello?\n[Cut to the living room where Monica is helping pack a box.]\nMonica: Hey Rach, aren’t these candlesticks (holds up a pair) mine?\nRachel: No-no, I bought those.\nMonica: Ohh! Yeah, I forgot.\nRachel: Yeah. (Rachel walks away.)\nMonica: (under her breath) That you’re a liar. (Hides the candlesticks in a\ndrawer.)\nRoss: (on phone) No-no-no, that’s great! I’ll be there Monday. And\nthank you again! (Listens) Okay. (Hangs up) (To All) Umm, that was the head of the\nPaleontology department at N uh, Y, uh U!\nMonica: Wow! Uh what, did he uh, say?\nRoss: Well remember that paper I had published last year on sediment flow rate,\nhuh? They loved it.\nRachel: Well, who wouldn’t?!\nRoss: I know! Anyway, they asked me to be a guest lecturer! I mean it’s\ntemporary, but uh, if they like me it could lead to a full time job. How great would that\nlook great on a mailbox, huh? \"Professor Geller.\"\nPhoebe: Yeah, Professor and Mrs.\nRachel: And Mrs.?!\nPhoebe: Oh! Yeah, y’know you and Ross are still married.\nRachel: What?!!\nPhoebe: Just kidding!\nRachel: Ohh! Oh God! (Laughs her way into the living room.)\nPhoebe: (To Ross) Saved your ass.\nOpening Credits\n[Scene: Central Perk, Joey, Monica, Rachel, and Chandler are all there as Phoebe enters\ndejectedly.]\nChandler: Hey!\nPhoebe: Hi.\nMonica: Hey!\nChandler: Oh, what’s the matter?\nPhoebe: Well, you know that psychic I see?\nChandler: Yeah?\nPhoebe: Well, she told me that I’m gonna die this week, so I’m kinda\nbummed about that.\nChandler: What?!\nPhoebe: Yeah, and I know you guys don’t know a lot about psychic readings,\nbut that one is pretty much the worse one you can get.\nMonica: Phoebe that’s crazy!\nJoey: I can’t believe she would say that too you.\nRachel: Yeah honey you don’t believe her do you?\nPhoebe: I don’t—she said y’know that I’d have triplets! But\nshe also said one of them would be black.\nChandler: Just out of curiosity did she tell you how you’re gonna go?\nPhoebe: No, ‘cause she didn’t tell me I was gonna die until the very\nend of the session, and I was not gonna waste a whole another hour there! I mean I’ve\nonly got a week left, y’know? I’ve really gotta start living now! (So she\npicks up the latest copy of Car and Driver (a U.S. auto magazine), leans back, and\nstarts reading.)\nRoss: (entering) Hey everyone!\nChandler: Oh hi!\nRoss: Hey uh, well, today’s my first lecture and I kinda wanted to try it\nout on you guys, do you, do you mind?\n(They pause to think about it.)\nAll: Oh that’d be great. Sure!\nRoss: (he starts reading directly from his cards word for word very quietly)\n\"There are three primary theories concerning sediment flow rate. Each of these\ntheories can be further subcategorized into two distinct…\"\nPhoebe: Oh, this is it. This what’s gonna kill me.\nRoss: (continuing) \"…subcategories. The first of these subcategories\nis…\"\nJoey: (interrupting him) Uh Ross! Are there uh, are there naked chicks on that\npiece of paper?\nRoss: No! Why?\nJoey: Well, I’ve just never seen a guy stare so hard at a piece of paper\nthat didn’t have naked chicks on it.\nRoss: Ohh! Okay! Okay. (Resumes reading word for word from the card) \"There\nare three (pauses and looks at Joey) primary theories concerning sediment flow rate.\n(Pauses and darts his eyes between Chandler and Rachel.) (Rachel starts laughing) Each of\nthese theories (glances at Phoebe) can be further subcategorized (glances at Chandler)\ninto…\"\nChandler: Why don’t you open with a joke?\nRoss: Open with a joke? It’s a university, not a comedy club!\nChandler: Wait a minute, hold the phone! You’re not talking about\nChuckles University?!\nRoss: (gets up) Okay!\nAll: Ohh! We’re kidding! Oh, we’re kidding!\nRachel: Ross, hey you know what might make it less boring?\nRoss: Thank you!\nRachel: Some uh, some visual aides.\nJoey: Oh-ooh-ooh! Y’know what’s a good visual aide?\nRoss: Please don’t say naked chicks.\nJoey: Why not?!\nRoss: I-I-I don’t even know why I bother to talk to you guys about it.\nY’know what? I’m just gonna do it on my own with no naked chicks.\nChandler: That’s the way I did it ‘til I was 19.\n[Scene: Chandler and Joey's, Joey is playing that string game with the two hands and\nthe weird crossing patterns as Chandler enters with the mail.]\nChandler: Hey.\nJoey: Hey! Any good mail?\nChandler: Yes, you got something from the Screen Actor’s Guild.\nJoey: Ooh, it’s probably a residual check, hey can you open it for me,\nI’m kinda….\nChandler: (opens and reads it) \"Benefits lapsed.\"\nJoey: Hmm that’s weird. I don’t remember being in a move called\nbenefits lapsed.\nChandler: Okay, it’s not a check. They’re saying your health insurance\nexpired because, you didn’t work enough last year.\nJoey: Let me see that!\nChandler: All right.\nJoey: (reads it) Oh, I can’t believe this! This sucks! When I had insurance\nI could get hit by a bus or catch on fire, y’know? And it wouldn’t matter. Now I\ngotta be careful?!\nChandler: I’m sorry man, there’s never a good time to (pauses) stop\ncatching on fire.\nJoey: All right well, I guess I gotta go get a job. I’m gonna go see my\nagent.\nChandler: Okay, make sure you look both ways before you cross the street.\nJoey: (mocks him, in a whiney voice) …look both ways before you cross the\nstreet. (Turns and walks headlong into the closed door.)\n[Scene: Monica and Rachel's, Phoebe enters to find Rachel still packing.]\nPhoebe: Hey!\nRachel: Hey Pheebs, you’re still alive! How are you doing?\nPhoebe: Ugh, it’s so exhausting waiting for death. Ohh, by the way,\ndo you think you could—(Groans, hacks, and then freezes with her eyes open and her\ntongue hanging out.)\nRachel: Pheebs, what-what are you doing?\nPhoebe: I was preparing you for my—didn’t you think I was dead? Did\nthat not come off?\nRachel: Oh yeah, scared the hell out of me. I thought we’d lost you\nforever. Pheebs, you lie down?\nPhoebe: Yeah, thanks. And listen, can you do me a favor? Could you just umm,\nwake me up in a couple hours, y’know if you can.\n(Phoebe goes and lies down as Rachel opens the drawer Monica hid the candlesticks in\nand as Monica walks out of her room.)\nRachel: Monica!\nMonica: Hmm? (Rachel holds up the candlesticks.)\nRachel: Did-did you take these back?\nMonica: No-no, I-I just, I liked them so much that I went out and bought some\nfor myself.\nRachel: Oh yeah, they’re really great! Aren’t they?\nMonica: I loved them!\nRachel: Yeah. (Monica walks away) Nice try! (Rachel puts them in a box.)\nRoss: (entering) Hello!\nMonica: Hey!\nRachel: Hey!\nMonica: How’d the lecture go?\nRoss: It went great! And I didn’t need any jokes or naked chicks either!\nRachel: Wow, that’s great Ross, I’m sorry we weren’t more\nsupportive before.\nRoss: I knew all I had to do was let the material speak for itself.\nEveryone’s all, \"Ross you have to be funny and sexy.\" Well, I proved them\nwrong! And now, I’m gonna pass the news onto Joey and Chandler.\nMonica: That you’re not funny or sexy?\nRoss: That’s right!\n[Scene: Estelle Leonard Theatrical Agency, Joey is there to see his agent.]\nJoey: (entering) Hey Estelle, listen…\nEstelle: Well! Well! Well! Joey Tribbiani! So you came back huh? They think\nthey can do better but they all come crawling back to Estelle!\nJoey: What are you talkin’ about? I never left you! You’ve always been\nmy agent!\nEstelle: Really?!\nJoey: Yeah!\nEstelle: Oh well, no harm, no foul.\nJoey: Estelle, you gotta get me some work. I-I lost my health insurance.\nEstelle: All right, first thing we gotta do, damage control.\nJoey: Why?\nEstelle: Well, I think uhh, someone out there may have been bad mouthing you all\nover town.\nJoey: Bastard!\n[Scene: Chandler and Joey's, Chandler enters to find Joey lying in the fetus position\non the floor.]\nChandler: Hey!\nJoey: (in obvious pain) Hey! So Estelle lined up a bunch of auditions for me\ntomorrow and I’ll have my health insurance back in no time.\nChandler: That’s great, but shouldn’t you be on the toilet right now?\nJoey: What?!\nChandler: What’s wrong with you?\nJoey: Nothing! Well, I-I got this blinding pain in my stomach when I was lifting\nweights before, then I uh passed out and uh, haven’t been able to stand up since. But\num, I don’t think it’s anything serious.\nChandler: This sounds like a hernia. You have to—you-you go to the doctor!\nJoey: No way! ‘Kay look, if I have to go to the doctor for anything\nit’s gonna be for this thing sticking out of my stomach! (Rolls over and shows\nChandler.)\nChandler: That’s a hernia.\nJoey: Why did I have to start working out again? (Looks at the weights he was\nusing.) Damn you 15s!\n[Scene: a NYU lecture hall, Rachel and Monica are arriving to talk to Ross after the\nlecture, but are there early.]\nRachel: Well, we’re a little early, the lecture doesn’t end for 15\nminutes.\nMonica: Yeah, but y’know we could sneak in and watch.\nRachel: Yeah, we could. Oh hey look! There’s some Kappa Kappa Deltas! I was\na Kappa. (to them) Hey sisters! (They ignore her.) (To Monica) Wow, we really are bitches.\n(They enter the lecture hall to find Ross speaking in an English accent for some\nunknown reason.)\nRoss: (to the class) Right! So when Rigby got his samples back from the\nlaboratory he made a startling discovery! What he believed to be igneous, was in fact\nsedimentary. Imagine his consternation when—(sees Monica and Rachel.) Oh bloody hell.\nCommercial Break\n[Scene: a NYU lecture hall, the scene is continued from earlier, only Ross has\ndismissed the class and is now talking to Monica and Rachel.]\nMonica: What the hell are you doing?!\nRoss: Look, I was nervous! You guys had me all worried I was going to be boring!\nI got up there and they were all like staring at me. I opened my mouth and this British\naccent just came out.\nRachel: Yeah, and not a very good one.\nRoss: Will you-will you please?\n(Another professor walks down from the back of the lecture hall.)\nThe Professor: Dr. Geller, Kurt Rathman, I’m a professor in the\npaleontology department here.\nRoss: Oh.\nThe Professor: Do you have a moment to talk about your lecture?\nRoss: (in his British accent) I’m sorry, I’ve got plans with my\nsister.\nMonica: (in an Irish accent) Monica Gellerrr. (She rolls her ‘R’)\nRoss: (in accent) Right, will you excuse us for one moment? (Takes Monica\naside.) (In his normal voice.) What are you doing?\nMonica: (normal voice) Oh, you can have an accent and I can’t?! (To an\nexiting student in accent.) Top ‘O the morning to ya laddies!\nRoss: Just please stop!\n(They turn back to Rachel and Professor Rathman.)\nRachel: (in an Indian accent) Yes, yes, Bombay is bery, bery nice time of year.\n[Scene: Central Perk, Chandler is reading on the couch while Joey, still suffering from\nhis hernia, is returning with coffee for them both. After a series of grunts and groans he\nmanages to painfully walk back from the counter, sit down, and slide Chandler his coffee.]\nChandler: Hey, will you grab me a cruller? (Joey starts to groan and get up.)\nSit down! Will you go to the hospital?!\nJoey: Dude! Hernia operations cost like, a lot probably. Besides it’s\ngetting darker and more painful, that means it’s healing.\nChandler: I will loan you the money. Just go to the hospital and let’s just\nget that thing…pushed back in.\nJoey: Thank you, but it would take me forever to pay you that money back and I\ndon’t want that hanging over my head. Okay? Besides, as soon as my insurance kicks in\nI can get all the free operations I want! Yeah, I’m thinking I’ll probably start\nwith that laser eye surgery too.\n(Phoebe enters.)\nPhoebe: Hey!\nChandler: Hey.\nJoey: Hey!\nPhoebe: What’s going on?\nChandler: Oh Joey’s got a really bad hernia, but that’s nothing a\nlittle laser eye surgery won’t fix!\nJoey: Look, I’m telling you if I put my hand on my stomach right here (He\nputs his hand down his pants, like Al Bundy on Married…With Children always\nused to do.) it doesn’t hurt that bad.\nPhoebe: Hey! Maybe you’ll die!\nJoey: Sure, now I’m scared.\nPhoebe: No, we can go together! Just don’t wait too long though, okay?\n‘Cause I’m outta here sometime before Friday.\nJoey: Yeah, but I don’t wanna die!\nPhoebe: No-no, it’ll be fun! We can come back and we can haunt these guys!\n[Scene: Monica and Rachel's, Monica and Rachel are having a tug-of-war over the\ndisputed candlesticks.]\nMonica: Gimme ‘em!\nRachel: No! They are mine!\nMonica: You stole them from me!\nRachel: You stole them from me!!\nMonica: Gimme them!\n(With one last mighty tug the combatants lose their grip and split, each holding one\ncandlestick.)\nMonica: You just wanna each take one?\nRachel: Yeah that seems fair. We never use them.\nRoss: (entering) Look, I really need some help, okay? Why? Why did I have to\nspeak in a British accent?! What do I do?\nRachel: Well…\nMonica: Why don’t you phase it out? Yeah, fade the accent out and people\nwill think you’re, y’know, that you’re adjusting to life in America.\nRachel: Yeah, I mean, come on Ross, no one will even notice. I mean they’re\nprobably not even listening!\nRoss: They’re not listening too me?\nRachel: Of course they’re listening to you! Everybody listens to you.\nRoss: Monica you really think I should try this phasing out thing?\nMonica: I think you look fine.\n[Scene: Casting Director #1’s office, Joey is on his first audition. His partner\nis an 8-year-old boy.]\nCasting Director #1: Whenever you’re ready.\nJoey: (in a gravely, painful voice) Okay. \"Hey, Timmy, I’ve got a\nsurprise for you.\"\nCasting Director #1: Hold it. I’m sorry, the surprise is a new swing set,\nif you could play it a little less…intense?\nJoey: Oh yeah, sure, no problem, I’ll just—hold on one second. (He\nturns around and puts his hand in his pants and groans in relief.) (In a relaxed voice.)\n\"Hey Timmy, I’ve got a surprise for you!\"\nCasting Director #1: Oh my God!!\n(Joey pulls his hand out and reverts back to intense pain.)\n[Scene: Casting Director #2’s office, Joey is on his second audition. This one is\nfor Purina One Dog Chow, an actual item. Please note the gratuitous product\nplacement.]\nJoey: So that’s why I feed my dog Purina One! Pick up a bag today!\n(He turns, looks at the bag and realizes he won’t be able to pick it up.)\nCasting Director #2: That’s where you pick up the bag.\nJoey: Exactly.\nCasting Director #2: No, the line is pick a bag, so you need to pick up the bag.\nJoey: Or, I could just point to it! Huh? Blah, blah, blah, Purina One,\npoint to a bag today. (She just looks at him.) I didn’t get it, did I?\nCasting Director #2: No.\nJoey: Yeah, okay. (Leaves)\n[Scene: Casting Director #3’s office, Joey is entering.]\nJoey: Hi. I’m Joey Tribbiani; I’m here to audition for (Groans) man.\nCasting Director #3: You mean dying man?\nJoey: Yes!\n[Scene: Monica and Rachel's, Monica and Rachel are playing phone pranks on Ross.]\nMonica: Okay, come on, do it one more time!\nRachel: Really? Really?!\nMonica: Yes!\nRachel: Okay! (Picks up the phone and starts dialing.) (In an Irish accent)\n\"Hello Ross, this is Dr. McNeeley from the Fake Accent University, we’d like you\nto come on board with us full time! (Hangs up.)\nPhoebe: (entering) Hey!\nRachel: Hey!\nPhoebe: Listen to this! My reading was wrong, I’m not going die!\nRachel: Really?! How do you know?\nPhoebe: Because my psychic is dead! She must’ve read the cards wrong!\nRachel: Oh, I’m sorry.\nPhoebe: Eh, better her than me! Hey, let’s bake cookies!\n[Scene: Silvercup Studios, Joey has won the part of dying man and is now able to play\nthe role he was injured for. Chandler is helping to carry him in.]\nChandler: Listen, I’m really glad you got the part.\nJoey: (barely audible through the pain) Thank you.\nChandler: But are you sure you can do this?\nJoey: Yeah! And hey, thanks for coming with me. And thanks again for helping me\ntake a shower.\n(Chandler steps away quickly.)\nChandler: Now, is that never talking about it again?!\nJoey: (to the director) Hiya!\nThe Director: Hey Joey, we’re ready for ya! (Joey stumbles over) Joey, this\nis Alex he’s going to be playing your son.\nJoey: Hi Alex! (to the director) And uh, as you can see my hands are not in my\npants. (Holds them both up.)\nThe Director: Okay. (to Alex) All right uh, Alex now when Joey says his line,\n\"Take good care of your Momma son,\" that’s your cue to cry. Got it? (Alex\nnods yes.) All right, let’s do this.\n(Joey lies down on the gurney.)\nA Crew Member: (with that board thingy) Scene 5, take 1.\nThe Director: And Action!\nJoey: \"Take could care of your Momma son.\" (Alex just looks at him and\nthe director motions for him to continue so he tries it again.) \"Take could care of\nyour Momma son.\" (Alex does nothing.) \"Come on son! Your Momma’s good\npeople!\"\nThe Director: Cut! Alex, remember you’re supposed to cry. Can you cry for\nus this time?\nAlex: Okay.\nThe Director: All right, from the top.\nA Crew Member: Scene 5, take 2.\n[Time lapse.]\nA Crew Member: Take 36 is up!\nThe Director: All right! Let’s try this again! You ready Joe?\nJoey: Ah, just one thing umm, is it all right with you if I, if I scream right\nup until you say action?\nThe Director: Uh sure.\nJoey: Okay. (Starts screaming.)\nThe Director: Action!\nJoey: (he stops screaming at action) \"Take good care of your Momma\nson.\" (Again Alex does nothing.)\nThe Director: Cut!!!!!!!!!! (Joey starts screaming again.)\n(Chandler decides to help out.)\nChandler: I’m sorry! Hey-hey Joe, why don’t you uh, lift up your\nshirt? (He does.) Take a look at this kiddo. (Alex finally starts crying.) We\nhave a crying child! Roll the damn cameras!\n[Scene: Ross and Rachel’s apartment, Rachel is unpacking as the phone rings.]\nRachel: (answering it) Hello?\nRussell: (Ross’s divorce lawyer.) Hello, is Ross there?\nRachel: Uh no, he’s not. Can I take a message?\nRussell: Yes, this Russell, Ross’s divorce lawyer, just tell him that since\nI haven’t heard from him, I assume he’s decided to give the marriage a try.\nRachel: Ross got married again—Nooooooo!!!!!!!!!\n[Scene: a NYU lecture hall, Ross is trying to phase out his accent.]\nRoss: (in his head) All right, keep going. We are phasing the accent out,\nphasing it out. So without out re-testing the results in the laboratory (pronounced\nthe British way) the team would never have identified (British) the initial errors in\ntheir carbon dating analysis (British). Were there any questions at this point? (One\nstudent raises his hand.) Yes. (Points to him.)\nA Student: What’s happening to your accent?\nRoss: (British) Come again? What’s-what’s this nonsense? (Giggles.)\n(American.) All right, I’m-I’m not English. I’m from Long Island. I was\nreally nervous and the accent just uh, just came out. I’m sorry. So, if we could just\nget back to the lecture. Umm, were there any questions? (Everyone raises their hands)\nAbout paleontology. (They all put their hands down.) All right, look I was just trying to\nmake a good first impression. Obviously, I screwed up. But what you guys think of me is\nreally important because I’m-I’m hoping to get a permanent job here. So if you\njust give me another chance to make a good impression…\n(At this moment Rachel bursts through the door. Needless to say, she’s not in the\nbest of moods having just found out Ross’s dirty little secret.)\nRachel: Ross!! Are you crazy?! I am still your wife!! What, were you just\nnever gonna tell me?!! What the hell is wrong with you?!!!! Ugh, I could just kill you!!!!\nRoss: (in the accent again) Well, hello Rachel!\nEnding Credits\n[Scene: Chandler and Joey's, Joey is holding a football helmet; and apparently, in a\nrather disgusting scene, Joey wants Phoebe to beat him senseless. (Luckily it isn’t a\nlong trip.) Because he’s made a miraculous recovery from his hernia and wants to take\nadvantage of all those free surgeries he can get now since he’s re-established his\nhealth insurance.]\nPhoebe: Have you really done this before?\nJoey: Yeah! Yeah! Yeah! You just take a big, big swing. Now, don’t hold\nback. (He dons his protective helmet (Why, I have no clue.) and Phoebe picks up a wooden\nbaseball bat and starts to swing as Chandler and Monica enter.)\nPhoebe: Hey!\nJoey: Hey-hey-hey!\nChandler: What are you doing?\nPhoebe: We’re just celebrating that Joey got his health insurance back.\nChandler: Oh, all right.\n(Decided that they are less than human as well, Chandler picks up a golf club and\nMonica a frying pan, to join in on the fun of beating their good friend to within an inch\nof his life!)\nEnd",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0604.html",
  "scrapedAt": "2025-12-17T14:32:07.493Z",
  "wordCount": 3807,
  "hasCharacterNames": true
}