{
  "title": "Genetics",
  "content": "## Genetics\n\nGenetics is the study of genes, genetic variation, and heredity in organisms. It is an important branch in biology because heredity is vital to organisms' evolution. Gregor Mendel, a Moravian Augustinian friar working in the 19th century in Brno, was the first to study genetics scientifically. Mendel studied \"trait inheritance\", patterns in the way traits are handed down from parents to offspring over time. He observed that organisms inherit traits by way of discrete \"units of inheritance\". This term, still used today, is a somewhat ambiguous definition of what is referred to as a gene.\n\n---\n\n## DNA\n\nDeoxyribonucleic acid is a polymer composed of two polynucleotide chains that coil around each other to form a double helix. The polymer carries genetic instructions for the development, functioning, growth and reproduction of all known organisms and many viruses. DNA and ribonucleic acid (RNA) are nucleic acids. Alongside proteins, lipids and complex carbohydrates (polysaccharides), nucleic acids are one of the four major types of macromolecules that are essential for all known forms of life.\n\n---\n\n## Gene\n\nIn biology, the word gene has two meanings. The Mendelian gene is a basic unit of heredity. The molecular gene is a sequence of nucleotides in DNA that is transcribed to produce a functional RNA. There are two types of molecular genes: protein-coding genes and non-coding genes. During gene expression, DNA is first copied into RNA. RNA can be directly functional or be the intermediate template for the synthesis of a protein.\n\n---\n\n## Heredity\n\nHeredity, also called inheritance or biological inheritance, is the passing on of traits from parents to their offspring; either through asexual reproduction or sexual reproduction, the offspring cells or organisms acquire the genetic information of their parents. Through heredity, variations between individuals can accumulate and cause species to evolve by natural selection. The study of heredity in biology is genetics.",
  "source": "Wikipedia",
  "sourceUrl": "https://en.wikipedia.org/wiki/Genetics",
  "fetchedAt": "2025-12-20T12:10:41.313Z",
  "citations": [
    {
      "text": "Genetics",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Genetics"
    },
    {
      "text": "DNA",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/DNA"
    },
    {
      "text": "Gene",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Gene"
    },
    {
      "text": "Heredity",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Heredity"
    }
  ],
  "metadata": {
    "category": "science",
    "subcategory": "biology",
    "topic": "genetics",
    "articleCount": 4
  }
}