[
  "Why did Monica's mom say she and Ross couldn't play football?",
  "What did Ross's dad do with the Geller Cup?",
  "What was the score when Monica and Ross decided to make the game about the guys against the girls?",
  "Why did Chandler want to ask Margha for her number?",
  "What did Phoebe do to distract Chandler during the game?",
  "What was the final score of the game?",
  "Why did Monica tackle Chandler during the game?",
  "What did Rachel do when she was given the opportunity to throw the ball?",
  "What was the name of the trophy that Ross and Monica's dad threw in the lake?",
  "Why did Margha decide not to choose either Joey or Chandler?",
  "What did Phoebe say to Monica when Monica asked her to do a button-hook again?",
  "What did Ross say to Monica when she said she was going to win the game?",
  "What did Joey say to Chandler when Chandler said he was going to ask Margha for her number?",
  "What did Monica say to Ross when he made a comment about her team being better?",
  "What did Phoebe do when she got the ball during the game?",
  "What did Rachel say when Monica asked her to go long during the game?",
  "What did Monica say to Phoebe when she asked her to do a button-hook?",
  "What did Joey say to Chandler when Chandler tackled him during the game?",
  "What did Ross say to Monica when she said she was going to beat him?",
  "What did Monica say to Ross when he made a comment about her winning the game?",
  "What did Phoebe do when she scored her first touchdown?",
  "What did Joey say to Margha when he met her?",
  "What did Chandler say to Joey when Joey said he would let Chandler have Margha?",
  "What did Monica say to Ross when he said the game was over?",
  "What did Phoebe do when she was tackled by Ross during the game?",
  "What did Joey say to Chandler when Chandler said he was going to ask Margha out?",
  "What did Monica say to Phoebe when Phoebe asked her to let Rachel throw the ball?",
  "What did Ross say to Monica when she said she was going to win the game?",
  "What did Phoebe do when she got the ball during the game?",
  "What did Rachel say when Monica asked her to go long during the game?"
]