[
  "What does Phoebe want to check in yesterday's daily news?",
  "What is Monica's initial reaction when she sees the guy behind them?",
  "What happens to the guy after Monica shouts 'Woo-woo!'?",
  "What is the name of the book written by Nora Tyler Bing that Rachel loves?",
  "Why does Ross kiss Mrs. Bing?",
  "What is the name of the song Phoebe sings at Central Perk?",
  "What is the Coma Guy's reaction when he wakes up and sees Monica and Phoebe?",
  "What does Chandler tell his mom after she kisses Ross?",
  "What is the name of Rachel's book that she is writing?",
  "What does Monica get for the Coma Guy while Phoebe gets him an Etch-a-Sketch?",
  "What is Phoebe's reaction when the Coma Guy says 'See you around'?",
  "What does Joey think about Ross kissing Mrs. Bing?",
  "What does Mrs. Bing say to Ross after he kisses her?",
  "What is the reason for Ross's kiss with Mrs. Bing, according to Joey?",
  "What does Chandler do after finding out about Ross's kiss with his mom?",
  "What does Phoebe do for the Coma Guy while he is in the hospital?",
  "What is the name of the restaurant where the gang goes to eat with Mrs. Bing?",
  "What does Mrs. Bing say about her book 'Euphoria Unbound' on TV?",
  "What is the reaction of the gang when they find out about Ross's kiss with Mrs. Bing?",
  "What does Joey say about his mother, Gloria Tribbiani?",
  "What is the reason for Chandler's conversation with his mom at the end of the episode?",
  "What does Ross say to Chandler after Chandler finds out about the kiss?",
  "What does Phoebe do when she sees Monica sneaking out of the Coma Guy's hospital room?",
  "What is the Coma Guy's first question when he wakes up and sees Monica and Phoebe?",
  "What does Monica say to the Coma Guy when he says 'See you around'?",
  "What does Joey do when he finds out about Ross's kiss with Mrs. Bing?",
  "What does Mrs. Bing say to Ross about her writing?",
  "What is the final scene of the episode?",
  "What does Chandler's mom say to him about Ross's kiss?",
  "What does Ross say to Chandler about his kiss with Mrs. Bing?",
  "What does Joey think about Ross's excuse for kissing Mrs. Bing?",
  "What does Phoebe do when she is at the hospital with the Coma Guy?",
  "What is the name of the game that Ross and Joey were supposed to play?",
  "What does Chandler say to his mom after she kisses Ross?"
]