{
  "title": "Mahabharata",
  "content": "## Mahabharata\n\nThe Mahābhārata is a smriti text from ancient India, one of the two important epics of Hinduism known as the Itihasas, the other being the Ramayana. It narrates the events and aftermath of the Kurukshetra War, a war of succession between two groups of princely cousins, the Kauravas and the Pāṇḍavas. It contains philosophical and devotional material, such as a discussion of the four \"goals of life\" or puruṣārtha (12.161). Among the principal works and stories in the Mahābhārata are the Bhagavad Gita, the story of Damayanti, Shakuntala, Pururava and Urvashi, Savitri and Satyavan, Kacha and Devayani, Rishyasringa and an abbreviated version of the Rāmāyaṇa.\n\n---\n\n## Bhagavad Gita\n\nThe Bhagavad Gita, often referred to as the Gita, is a Hindu scripture, likely composed in the second or first century BCE, which forms part of the epic poem Mahabharata. The Gita is a synthesis of various strands of Indian religious thought, including the Vedic concept of dharma ; Sankhya-based yoga and jnana (knowledge); and bhakti (devotion). Among the Hindu traditions, the Gita holds a unique pan-Hindu influence as the most prominent sacred text and is a central text in the Vedanta and Vaishnava traditions.\n\n---\n\n## Kurukshetra War\n\nThe Kurukshetra War, also called the Mahabharata War, is a war described in the Hindu epic poem Mahabharata, arising from a dynastic struggle between two groups of cousins, the Kauravas and the Pandavas, for the throne of Hastinapura. The war is used as the context for the dialogues of the Bhagavad Gita.\n\n---\n\n## Pandava\n\nThe Pandavas is a patronymic referring to the five legendary brothers, Yudhishtira, Bhima, Arjuna, Nakula, and Sahadeva, who are central figures of the ancient Hindu epic Mahabharata. They are acknowledged as the sons of Pandu, the King of Kuru, but were fathered by different Devas (gods) due to Pandu's cursed inability to naturally sire children. In the epic, the Pandavas married Draupadi, the princess of Panchala, and founded the city of Indraprastha after the Kuru Kingdom was split to avoid succession disputes. After the split, the other part of the kingdom was ruled by their cousins, the Kauravas. However, the Pandavas lost their kingdom to Duryodhana when Yudhishthira gambled it away during a game of dice. The bet Yudhishtira agreed to was that the Pandavas would hand the kingdom over to the Kauravas and go into exile for 12 followed by an year in hiding. After this time the Kauravas refused to return the kingdom. As a result, the Pandavas waged a civil war against their extended family, and this conflict is known as the Kurukshetra War. With the help of the god Krishna, the Pandavas eventually won the war with the death of the Kauravas, albeit at great cost.",
  "source": "Wikipedia",
  "sourceUrl": "https://en.wikipedia.org/wiki/Mahabharata",
  "fetchedAt": "2025-12-20T12:15:44.844Z",
  "citations": [
    {
      "text": "Mahabharata",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Mahabharata"
    },
    {
      "text": "Bhagavad Gita",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Bhagavad_Gita"
    },
    {
      "text": "Kurukshetra War",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Kurukshetra_War"
    },
    {
      "text": "Pandava",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Pandava"
    }
  ],
  "metadata": {
    "category": "general-knowledge",
    "subcategory": "indian-epics",
    "topic": "mahabharata",
    "articleCount": 4
  }
}