[
  "What does Joey say is a problem after kissing a guy during an audition?",
  "What does Phoebe say to Joey after he kisses her to practice for his audition?",
  "What is Rachel wearing to Barry and Mindy's wedding?",
  "Why does Ross tell the guests at Barry and Mindy's wedding that Rachel didn't run out on Barry?",
  "What song does Rachel sing at Barry and Mindy's wedding reception?",
  "What does Monica want to have, but Richard is hesitant about?",
  "Who is Chandler's cyberchick that he's been talking to online?",
  "What is the reason Barry's parents told people about Rachel after she ran out on their wedding?",
  "What does Ross do to make Joey feel better after he didn't get the audition?",
  "What does Phoebe suggest Chandler do to find out more about his cyberchick?",
  "Why does Monica throw a piece of candy at Richard at the wedding reception?",
  "What does Richard agree to do if it means being with Monica?",
  "What is the name of the museum that Chandler's cyberchick likes?",
  "What does Chandler's cyberchick reveal about herself online?",
  "What does Joey want to do to help Chandler with his cyberchick?",
  "What does Phoebe think about Chandler's situation with his cyberchick?",
  "What does Ross do when he sees Rachel's dress is bunched up at the wedding?",
  "What does the wedding planner say to Rachel at the wedding?",
  "What does Monica say to Richard about having children?",
  "What does Richard say to Monica about having children?",
  "What does Chandler do when he finds out his cyberchick is married?",
  "What does Phoebe tell Chandler about his cyberchick?",
  "What does Joey do when he sees Rachel in her bridesmaid dress?",
  "What does Ross do when Joey tries to kiss him?",
  "What does Monica say to Richard about their future together?",
  "What does Richard say to Monica about their future together?",
  "What does Chandler's cyberchick say to him online?",
  "What does Phoebe think about Chandler meeting his cyberchick in person?",
  "What does Joey do to try to get the part in the play?",
  "What does Ross do when Rachel's dress is bunched up at the wedding?"
]