[
  "What is the gift that Monica brings for Ben?",
  "Why do Chandler and Joey leave the room when Carol starts breastfeeding?",
  "What is the name of the perfume that Joey is trying to sell?",
  "Why does Phoebe taste the breast milk?",
  "What is the reaction of Ross when he finds out that Joey tasted the breast milk?",
  "What is the name of the store where Monica and Julie go shopping?",
  "Why is Rachel upset with Monica?",
  "What is the job that Joey is considering switching to?",
  "What is the outcome of the showdown between Joey and the Hombre man?",
  "What is the reaction of Ross when he finally tastes the breast milk?",
  "What is the name of the woman who Joey asks out for coffee?",
  "Why does Phoebe join in on the hug between Monica and Rachel?",
  "What is the outcome of the conversation between Rachel and Julie?",
  "What is the reason for Ross's initial discomfort with the breast milk?",
  "What is the name of the character who says 'You won't even taste it?'",
  "What is the reason for Monica's phone call to Rachel's workplace?",
  "What is the object that Joey misfires with during the showdown?",
  "What is the reaction of the customer who gets sprayed with perfume?",
  "What is the name of the character who says 'I'm gonna do it'?",
  "What is the reason for Phoebe's comment 'You guys, um I know that this really doesn't have anything to do with me'?",
  "What is the outcome of the conversation between Monica and Rachel at the end of the episode?",
  "What is the reason for Ross's comment 'My mommies love me'?",
  "What is the name of the character who says 'I'd do anything for you'?",
  "What is the reason for Chandler's comment 'You should see this guy, Chandler, he goes through two bottles a day'?",
  "What is the outcome of the conversation between Julie and Rachel at Central Perk?",
  "What is the reason for Phoebe's comment 'I love you guys too'?",
  "What is the name of the character who says 'I don't know what else to say'?",
  "What is the reason for Joey's comment 'These new kids, they never last'?",
  "What is the outcome of the showdown between Joey and the Hombre man at the department store?"
]