[
  "What does Phoebe say she would want if she were omnipotent for a day?",
  "Why does Joey say he would kill himself if he were omnipotent?",
  "Why did Phoebe not get any sleep the night before?",
  "What does Rachel receive in the mail?",
  "What is Ross's reaction when he sees the boots in the store window?",
  "Why does Ross decide to go to the hockey game with the guys?",
  "What happens to Ross at the hockey game?",
  "Why does Phoebe bring Operation to Monica and Rachel's apartment?",
  "What does Monica see when she looks at George Stephanopoulos' apartment with binoculars?",
  "Why does Ross reveal that his first time with Carol was also his first time ever?",
  "What does Rachel tell the Visa card people on the phone?",
  "What is the reason for Ross's visit to the Emergency Room?",
  "What is Phoebe's reaction when she sees the woman with George Stephanopoulos?",
  "Why does Chandler try to convince Ross to stay and watch the hockey game?",
  "What is the name of the game that Monica and the girls play during their slumber party?",
  "What does Rachel give up when she leaves her fiancé at the altar?",
  "What is the reason for the fight between Ross and the kid in the Emergency Room?",
  "What does Monica see when she uses the binoculars to look into George Stephanopoulos' apartment?",
  "What is the significance of the date for Ross?",
  "Why does Rachel's friend Leslie visit Central Perk?",
  "What does Phoebe compare Rachel's situation to?",
  "What does Monica offer to make for Rachel and their friends during the slumber party?",
  "Why does Chandler pretend to be Rachel when talking to the Visa card people?",
  "What is the name of the pizza delivery guy who comes to Monica and Rachel's apartment?",
  "What does Ross do when the kid refuses to give him back his hockey puck?",
  "What is the outcome of Ross's fight with the kid over the hockey puck?",
  "What does Monica say about George Stephanopoulos when she sees him through the binoculars?",
  "Why does Phoebe yell at the woman with George Stephanopoulos through the binoculars?",
  "What does Rachel tell her friends about her job as a waitress?"
]