{
  "show": "Friends",
  "season": 6,
  "episode": 1,
  "title": "The One After Vegas",
  "transcript": "The One After Vegas\nWritten by: Adam Chase\nTranscribed by: Eric Aasen\n[Scene: The Wedding Chapel, continued from last season. Chandler and Monica are about\nto get married.]\nChandler: Okay! (Stands up) This is it! (Claps his hands) We're gonna get\nmarried!\nMonica: Are you sure you wanna do this?\n(Suddenly the doors burst open, and ROSS AND RACHEL COME OUT ARM-IN-ARM!!!!! And\nRachel's carrying a bouquet!!! THEY GOT MARRIED!!!!)\nRoss: Well, hello, Mrs. Ross! (Throws some rice.)\nRachel: Well, hello, Mr. Rachel! (Throws some more rice.)\n(They storm out into the street.)\nRachel: Wait! (Gets her bearings) Okay!\n(She goes one way; he goes the other. The camera pans back to Chandler and Monica, and\nneedless to say, they're standing there dumbstruck.)\nMonica: Whoa!\nChandler: Oh my God!\nJoey: (entering with Phoebe) Come on Pheebs! Hurry! Hurry! Hurry! Hurry!\nPhoebe: Okay! Okay! Okay! (They run into the chapel.)\n(Chandler and Monica are stunned again.)\nChandler: Oh my God!! Is everybody getting married?!!\n(Phoebe and Joey run back out and head towards the street.)\nAttendant: (scolding them) N-No running in the chapel!\nPhoebe: (to her) Hey! Don’t you give me any of your—Hey! (Sees\nChandler and Monica standing there.)\nChandler: Hey!\nJoey: Hey!\nMonica: What are you guys doing here?\nJoey: Ross and Rachel left us a message saying they were getting married!\nIsn’t that why you guys are here?\nChandler: Yes! Well that-yes.\nMonica: Why else would we be here?\nJoey: Well! What happened?! Did we miss it?\nChandler: We actually missed it.\nPhoebe: Well, maybe you wouldn’t have had you (turns to the attendant) run\nin the chapel!\nMonica: This is insane!\nPhoebe: What’s the big deal, y’know? It’s not like it’s a\nreal marriage.\nChandler: What?!\nPhoebe: Yeah, if you get married in Vegas, you’re only married in Vegas.\nMonica: What are you talking about? If you get married in Vegas you’re\nmarried everywhere.\nPhoebe: (shocked) Really?!\nMonica: Yeah!\nPhoebe: Oh my God!—Eh! Well…\nOpening Credits\n{Transciber’s note: In case you haven’t heard, Courteney Cox got married to\nDavid Arquette during hiatus and changed her name to Courteney Cox Arquette. But David was\na busy boy during the off season for not only did he marry but everyone else as well. For\nthey’re all listed as Jennifer Aniston Arquette, Lisa Kudrow Arquette, in an\ninteresting twist Matt LeBlanc Arquette, Matthew Perry Arquette, David Schwimmer Arquette,\nand even the creators of the show are now David Crane Arquette and Marta Kauffman\nArquette. I just wonder what the new sleeping arrangements are…}\n[Scene: Rachel’s hotel room, she’s waking up with a horrendous hangover.]\nRachel: Ohhh! (Looks in the mirror and sees that she still has her mustache and\ngroans.)\n(Suddenly, there’s movement beside her, startling her. It’s Ross! He wakes up\nand they both start screaming in terror. Then they both grab their heads having aggravated\ntheir hangovers.)\nRoss: Why are we in bed together?\nRachel: I don’t know. Do-do you have any clothes on?\nRoss: (checks) Yeah.\nRachel: Really?!\nRoss: No! But we-we didn’t have…sex-uh, did we? I mean, I don’t\nremember much about last night, it was such a blur.\nRachel: Oh! I remember laughing! I laughed a lot.\nRoss: And we didn’t have sex.\n(Rachel agrees with him and starts to get out of bed.)\nRachel: Ohh, I mean, we were really drunk. I’m just glad we didn’t do\nanything stupid.\nRoss: (getting up) Tell me about it. (He sits up on the edge of the bed and has\n\"Just Married\" written on his back.)\n[Scene: The breakfast buffet, Phoebe is already sitting at the table as Joey enters.]\nJoey: Mornin’ Pheebs. (Sits down.) Well, my movie has officially been\ncanceled.\nPhoebe: Oh Joey, I’m so sorry. You want some of my breakfast?\nJoey: Nah, I’m too depressed to eat. I’ll probably eat in like 5\nminutes. So I guess I’ll just fly home with you guys, what time’s your flight?\nPhoebe: What about my cab?\nJoey: I don’t need that anymore.\nPhoebe: No, Joey! You borrowed my cab; you have to drive it back.\nJoey: I don’t want to drive all the way back by myself, I get so lonely.\n(Gets an idea.) Oh—ooh! How about you come with me?\nPhoebe: I don’t know, it’s such a long trip.\nJoey: It’ll be great! We-we could talk, and play games! Huh? This could be\nour chance to like renew our friendship.\nPhoebe: Are you asking me to have a frenaissance?\nJoey: Sure?\nPhoebe: All right. Although I don’t think we need one, I never stopped\nloving you.\n(Chandler and Monica enter.)\nChandler: Hi!\nJoey: Hey.\nMonica: Hey.\nChandler: So, has anyone talked to Dr. and Mrs. Geller yet?\nPhoebe: Um-hmm, yeah. They left me a message; they should be here any minute.\nJoey: Where is the waitress?! I’m starving!\nChandler: It’s a buffet man.\nJoey: Oh, here’s where I win all my money back! (Gets up and heads for the\nbuffet table with Chandler in tow.)\nChandler: Listen, I gotta talk to you.\nJoey: Sure! What’s up? (He grabs a plate and proceeds to load it with a\nhuge pile of scrambled eggs. Chandler just stares at him and Joey reluctantly gives him a\nspoonful.)\nChandler: Monica and I almost got married last night.\nJoey: Oh my God! That’s huge! (Hugs him.) Wait a minute, why come I\nwasn’t invited? And who was going to be your best man? Don’t say,\n\"Ross.\" Do not say, \"Ross.\"\nChandler: Look, I just don’t think Monica and I are ready to get married\nyet! Y’know? I mean, I love her and everything but seeing Ross and Rachel coming out\nof that chapel was like a, like a wake-up call that Monica and I are moving so fast.\nY’know? And, how do I tell her without crushing her?\nJoey: Oh! Tell her she’s not marriage material.\nChandler: What?!\nJoey: Girls say it to me all the time! And believe me, if she’s anything\nlike me, she’s just gonna be relieved.\n[Pan to Monica and Phoebe having the same conversation.]\nMonica: How do I tell Chandler that it’s too soon. It’s gonna break\nhis heart, he’s not gonna think that I don’t love him anymore.\nPhoebe: Well you don’t.\nMonica: Yes I do!\nPhoebe: Good! Good! I was just testing you.\nChandler: (returning with Joey) Hi.\nMonica: Oh hi! Hi! Y’know, we were just talking about bacon.\nPhoebe: No, we were talking about tennis. Tennis is more believable.\n(Ross and Rachel enter.)\nRoss: Hey!\nThe Girls: Hey!\nChandler: Hey!\n(They both sit down and Rachel pours them both some coffee. They’re acting like\nnothing’s happened and everyone is just staring at them.)\nRoss: What?\nChandler: Are we gonna talk about what you guys did last night? Or…\nRachel: (To Ross) I don’t know. (To the gang.) What do you mean last night?\nNothing, nothing uh, happened last night.\nRoss: Yeah!\nPhoebe: Uh-huh! Ross invited us all to watch.\n(Rachel turns to Ross stunned.)\nMonica: Rach! We weren’t gonna miss our friends getting married!\nRachel: (gasps) Who got married?! (Ross is as surprised to hear this as she is.)\nChandler: (not quite sure) You did.\nRoss: What?! Hello! We didn’t get married.\nRachel: No, we didn’t get married! That’s ridiculous!\n(They turn to look at each other and suddenly remember that they did in fact get\nmarried.)\nRoss: We-we-we—I remember being in a chapel.\nRachel: Oh my God.\nRoss: I—They would not let us get married when we were that drunk!\nRachel: No!\nJoey: They let you get married when you’re drunk! Most people who get\nmarried in Vegas are drunk!\nPhoebe: Hell, I’m drunk right now! (They all turn and look at her.) What? I\ncan’t have a mimosa with breakfast?! I’m on vacation!\nMonica: What are you guys gonna do?\nRachel: Well, I guess we just find a divorce lawyer? (Looks at Ross.)\nChandler: Well, I think, I think, Ross already has one. Now, this one’s\nfree, right? Because you paid for the first two, so the third one’s free.\nRoss: Laugh it up, but the joke’s on you. Because we don’t need to get\ndivorced, okay? We we’re just gonna get an annulment.\nJoey: An annulment? Ross! I don’t think surgery’s the answer here.\nPhoebe: Oh-oh, that’s your thing.\nRoss: What?\nPhoebe: You’re thing. You’re thing. Y’know? You’re the guy\nwho gets divorced.\nAll: Oh yeah!\nRoss: No-no, that’s-that’s not my thing! I do not love getting\ndivorced!\nPhoebe: Yes you do! This is your third divorce! You love divorce so much\nyou’re probably gonna marry it! Then it won’t work out and you’re gonna\nhave to divorce it, divorcing guy. (Pause) I’m so drunk.\n[Scene: The casino floor, Chandler and Monica are walking through it.]\nMonica: So, what do you think we should do?\nChandler: I don’t know. But I-I-I know I love you!\nMonica: I know I love you! (They hug.)\nChandler: So where are we on the whole going back to the place where they have\nall the marriages thing? I love you.\nMonica: That’s a good question. Look umm, last night we let the dice\ndecide. Maybe we should leave it up to fate again. I love you!\nChandler: Yes, we don’t get married unless there’s a sign! Okay, so\nsay uh, say you roll another eight (motions to the craps table) then there’s a definite\nsign that we should get married.\nMonica: All right, eight we get married, but 2, 3, 4, 5, 6, 7, 9, 10, 11, 12 we\ndon’t get married.\nChandler: Sounds great.\nMonica: Okay. (They approach the craps table.)\nCroupler: Coming in, we got a shooter! Money please.\nMonica: Ready?\nChandler: Ready!\nMonica: (sarcastic) Come on eight.\nChandler: (deadpan) Yes, yes eight.\n(Monica rolls the dice.)\nCroupler: Eight! Easy eight. (She rolls a 3 and a 5 and they’re stunned.)\nMonica: Wow! I can’t believe I actually rolled an eight.\nChandler: That was so unlikely. Well, let’s get married! I guess.\nMonica: Wait a minute. That wasn’t a hard eight! Last night I rolled a hard\neight.\nChandler: That’s right! It was the wrong kind of eight, no wedding! Damnit!\nMonica: I wanted it so bad! (Pause) Wanna go pack?\nChandler: Yeah. (They go pack.) We’re doing the right thing, right?\nMonica: Ohh, of course we are! (They walk up to the elevators.) We left it up to\nfate. (Pushes the elevator button.) If we were supposed to get married there would be a\nclear-cut sign. (The elevator door opens to a priest reading from a bible with Chandler\nand Monica standing side-by-side holding each other’s hands.)\n[Scene: Phoebe’s cab, Phoebe and Joey are driving back. Phoebe is driving while\nJoey is sleeping.]\nPhoebe: Okay, you have 19 questions left. Use them wisely. (Joey groans.) Come\non Joey! You can’t win if you don’t ask any (sees that he’s asleep) QUESTIONS!!!\nJoey: (wakes up) What?!\nPhoebe: Well, you promised me a fun road trip! We’ve been on the road six\nhours and you’ve been asleep for five and a half! We are switching at the next rest\nstop and you are going to drive all the way back! That will be your punishment, you\ngreedy sleeper!\nJoey: All right. All right.\nPhoebe: Yeah! And until then you are going to sing to me because the\nradio’s broken and you are selfish but have a nice voice.\nJoey: Really? I don’t…\nPhoebe: Sing!!\nJoey: (starts singing) I wanna rock and roll all night! (Falls asleep.)\n[Time lapse, Phoebe is asleep, Joey’s driving and having a hard time staying\nawake.]\nJoey: (to himself) Man, this is a long drive! Are my eyes open? No! (He opens\nhis eyes and sees a hitchhiker.)\n[Time lapse, Phoebe is still asleep only Joey is now passed out next to her and the\ncar’s still moving. She wakes up, sees Joey, and screams.]\nHitchhiker: (driving) Morning! (Phoebe screams again.)\n[Scene: Central Perk, Rachel is on the couch as Ross enters.]\nRoss: Hey!\nRachel: Hey, hubby!\nRoss: Yeah. Yeah, actually um, I wanted to talk to you about that whole\nannulment thing?\nRachel: Uh-huh.\nRoss: I’m not going to do that. (Rachel glares at him.)\nCommercial Break\n[Scene: Central Perk, continued from earlier. Rachel starts laughing.]\nRachel: Okay! So, we’ll just stay married.\nRoss: Yes, exactly!\nRachel: And I will make everyone call me Mrs. Geller!\nRoss: Wow! This is so amazing. I uh, I really thought I’d have to talk you\ninto this more.\nRachel: Okay, see now I’m scared because I don’t actually think\nyou’re kidding.\nRoss: I’m-I’m not kidding. Look I-I, I can’t have three\nfailed marriages. I can’t. Okay? I-I am not gonna be that guy!\nRachel: What-wh-what so we’ll just stay married forever?!\nRoss: Okay, look, how is this gonna affect you? Really? I mean you fill some\nform out once and a while and instead of checking the box that says Ms you check the box\nthat says Mrs.! It’s right next to it!\nRachel: Ohh, okay, I’m sorry. You’re right. Y’know what? We\nabsolutely can stay married, because I was under the impression that the boxes were far away\nfrom each other. All right, look, just please, take a moment here and think about what\nyou’re asking of me.\nRoss: I’m asking you to do me a favor.\n{Note: Does anyone else want to smack Ross right about now? Raise your hands. Okay, put\nthem down before you stink out the person next to you.}\nRachel: You are asking me to be your wife!\nRoss: And as my wife I think you should grant me this favor.\n[Scene: The hallway, Chandler is helping Monica to the door.]\nMonica: That kid really kicked me hard on the plane.\nChandler: Well you did pull his hair.\nMonica: He took my snack!\nChandler: I’m not getting into this again!\nMonica: Okay! Oh God, y’know what? It’s really bad.\nChandler:  Well, I told you not to walk. Here. (Picks her up.) There. Okay.\n(He opens the door, carries her across the threshold, stops, backs out, and lets go of\nMonica who is only holding on by his neck.)\nMonica: This doesn’t mean anything, does it?\nChandler: No!\nMonica: Okay.\n[Scene: Phoebe’s cab, she’s driving, Joey’s in the back seat, and the\nhitchhiker is riding up front with Phoebe.]\nPhoebe: (To Joey) How could you pick up a hitchhiker?! He could be a\nrape—(She holds her hand in front of the hitchhiker’s face), a rapist or a\nkiller or something!\nJoey: Don’t you think I asked him that before he got in?!\nPhoebe: Y’know what? I’m not talking to you! You go back to sleep! (To\nthe hitchhiker) And you, are you a rapist?!\nHitchhiker: No!\nPhoebe: Do you like car games?\nHitchhiker: Yeah, y’know the license plate game?\nPhoebe: I love the license plate game!\nJoey: Ooh, I’ll play! I’ll play!\nPhoebe: No-No! You need your sleep. Night-night! Shh! (She closes the\npartition.)\n[Scene: Monica and Rachel's, Ross is entering.]\nRoss: Hey!\nRachel: Hey!\nRoss: Listen, I know you wanted to talk to me, but I have an idea that may make\nyou want to stay married. (Rachel shakes her head.) We register, and you get to\nkeep all the presents!\nRachel: (thinks about it for a second) No! Ross, come on! No! Listen, look I\nthought a lot about how to tell you this and the bottom line, Ross, is we can not stay\nmarried.\nRoss: I don’t know if it’s true.\nRachel: Oh b-b-but it is!\nRoss: Oh, okay, y’know what this is? This is a difference of\nopinion. And when that happens in a marriage...\nRachel: Oh Ross, come on! This is not, this is not a marriage!! This is the\nworld’s worst hangover! Ross, listen, if you do not get this annulment, I\nwill!\nRoss: All right. All right, I’ll do it.\nRachel: Thank you. (He goes to leave.) Hey-hey umm, uh, is there, is there any\nsuch thing as an annulment shower?\n(Ross turns and leaves.)\n[Scene: Phoebe’s cab, it’s the same arrangement as before.]\nHitchhiker: Wait! Wait! There is the train station!\nPhoebe: Oh, okay.\nHitchhiker: This is where I get off. Well, I have your address and phone number.\nPhoebe: And I have your name and the fact that you’re a drifter, so the\nball’s pretty much in your court.\nHitchhiker: All right, see ya Pheebs. (Gets out and Phoebe drives away.)\nJoey: Come on Pheebs! I can’t take this anymore! Let-let me make it up to\nyou. Huh? (Starts singing.) Ground control to Major Tom. Commencing countdown, engines\non. Take your protein pills and put your helmet on!\nPhoebe: Stop it! Stop it no! That’s not fair! Y’know I can’t\nresist that beautiful voice!\nJoey: Pheebs, I am so sorry! I know I promised you a fun road trip with your\nfriend and I didn’t deliver. But-but-but now I know that you think being awake is an\nimportant part of friendship! So, so, so I will strive to-to stay awake for as long as I\nknow you.\nPhoebe: You can still sleep at night and stuff.\nJoey: Well, thank you. So, can we play 20 Questions now? I’ve got a really\ngood one! I’ve been thinking about it since Kansas.\nPhoebe: Okay. Is it a kind of hot sandwich?\nJoey: Yes.\nPhoebe: Is it a meatball sub?\nJoey: That is incredible! You are the master!\n[Scene: Monica and Rachel's, Chandler and Monica are there and Rachel is arranging a\nbouquet of flowers, pricks her finger on a thorn, throws the bouquet over her head, and\nthose you who are quicker than some already know that Monica is the one who catches it.]\nRachel: Huh, that’s funny. You look like you’re gonna be the…\nMonica: No, don’t say it! Don’t even think it!\nRachel: All right. Okay Chandler, enjoy your handful. (Exits.)\nChandler: All right, should we just, should we just get married? Y’know? I\nmean should we just do it? All the signs are telling us to do it.\nMonica: I’m sick of the signs! It’s too fast, I’m happy the way\nthings are!\nChandler: Me too!\nMonica: I don’t want things to change! Do you?\nChandler: No!\nMonica: All right then, then nothing changes! Everything is great! Everything\nstays the same! And you go unpack because it’s been three days and it’s driving\nme insane!\nChandler: Jeez, relax! It’s not like we’re mar-ah-ah!! (Runs out.)\nChandler: (entering, slowly) Y’know I was thinking, what if I uh, unpack\nhere?\nMonica: Then all your stuff would be here.\nChandler: Well, what if all my stuff was here?\nMonica: Then you’d be going back and forth all the time, I mean it\ndoesn’t make any sense.\nChandler: Okay. What if we lived together and you understand what I’m\nsaying?\nMonica: Live together? There have been no signs for that.\nChandler: Me asking is kind of a sign.\nMonica: YES!!!!!!!!\nChandler: Okay!!!!!\n(And the crowd goes wild! Well, at least the live studio audience.)\nMonica: Yes! Okay! Okay! Wait-wait-wait!\nChandler: Okay.\nMonica: Here’s your key (Gets him one.)\nChandler: Oh thanks.\nMonica: Here’s your key. All right, you have to christen it! Now, go out\nand come back in!\nChandler: The door hasn’t been locked in five years, but okay! (Runs out.)\nReady?!\nMonica: Ready!\n(He tries, but something happens.)\nChandler: Okay, a little problem. The key broke in the lock and I can’t get\nin!\nMonica: Wait! Oh my God! I can’t get out!\nChandler: This is not a sign!\nMonica: No, it’s not a sign! It’s a very old key!\nChandler: It’s an old key!\nMonica: Oh my God it’s old!\nChandler: I love you!\nMonica: I love you!\nChandler: Are you hugging the door right now.\n(Pause)\nMonica: No.\nChandler: Yeah-yeah, me neither.\n[Scene: Central Perk, Rachel and Phoebe are on the couch as Ross enters.]\nRoss: Hey!\nRachel: Hey, so did everything go all right with the annulment?\nRoss: Oh, yeah, no problems. It’s all taken care of.\nRachel: Ross, thank you. Hey, do you guys wanna go see a movie?\nRoss: Oh yeah, why not?\nRachel: Pheebs?\nPhoebe: No thanks, I’ve already seen one.\nRachel: Okay, umm, I’m gonna get my sweater. (Walks away.)\nRoss: Okay. (Sits down next to Phoebe.) You uh, you wanna hear something weird?\nPhoebe: Always.\nRoss: I didn’t get the annulment.\nPhoebe: What?!\nRoss: We’re still married! Don’t tell Rachel. See you later. (He gets\nup leaving Phoebe in shock.)\nEnding Credits\n[Scene: The hallway, Joey is coming up the stairs and sees Chandler trying to open the\nlock.]\nJoey: What are you doing?\nChandler: The key’s stuck in the lock.\nJoey: I can fix it. Hold on. (He goes and gets a screwdriver from his apartment)\nLook out. Look out. (Pries at the door a little bit.)\nChandler: (trying the handle) It still doesn’t work.\nJoey: I’m not finished.\nChandler: Oh.\n(Joey goes back into the apartment, runs back into the hallway, throws his shoulder\nagainst the door, and knocks it down off it’s hinges.)\nChandler: Nice job Joe! You’re quite the craftsmen.\n(Joey pats him on the stomach and heads to bed.)\nEnd",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0601.html",
  "scrapedAt": "2025-12-17T14:32:05.120Z",
  "wordCount": 3526,
  "hasCharacterNames": true
}