[
  "What does Rachel say to her mom on the phone about the safety of the street?",
  "What flies into Monica and Rachel's apartment through the window?",
  "Who does Phoebe reveal she is married to?",
  "What is the reason Phoebe gives for not telling Monica about her marriage to Duncan?",
  "What is the unusual physical feature that Chandler has?",
  "What does Joey reveal he did in the past?",
  "What is the name of the woman that Duncan is getting married to?",
  "Why does Duncan say he pretended to be gay?",
  "What does Phoebe sign at the end of the episode?",
  "What is Ross's concern about having sex with Julie?",
  "What does Rachel suggest Ross do to make his first time with Julie special?",
  "What is the name of the salad that Julie mentions?",
  "What does Ross say to the old ladies on the bench the next morning?",
  "What is the implication of Ross's statement to the old ladies?",
  "What is the name of the song that Ross is singing along to at the end of the episode?",
  "What is the reason for Rachel's curiosity about Julie's life?",
  "What is the reaction of the gang when Joey reveals his past experience in a porno movie?",
  "What is the reason for Phoebe's visit to Duncan's dressing room?",
  "What is the outcome of Ross's conversation with Rachel about his relationship with Julie?",
  "What is the implication of Chandler's statement about his third nipple?",
  "What is the reason for Monica's reaction to Chandler's revelation about her underwear?",
  "What is the outcome of Phoebe's conversation with Duncan about their marriage and divorce?",
  "What is the reason for Julie's lengthy story about her childhood?",
  "What is the reaction of the gang to Julie's story about her childhood?",
  "What is the implication of Ross's statement to Rachel about his relationship with Julie?",
  "What is the reason for Rachel's suggestion to Ross about being spontaneous?",
  "What is the outcome of Ross's conversation with Joey about his relationship with Julie?",
  "What is the implication of the final scene with Ross singing in the rain?",
  "What is the reason for Phoebe's emotional reaction to Duncan's revelation about his sexuality?",
  "What is the outcome of Phoebe's conversation with Duncan about his sexuality?",
  "What is the reason for Monica's reaction to Chandler's joke about her underwear?",
  "What is the implication of the scene with Ross and Rachel talking about his relationship with Julie?",
  "What is the reason for Joey's reaction to Chandler's joke about his past experience in a porno movie?",
  "What is the outcome of the gang's conversation about Julie's life story?"
]