[
  "What does Ross use to approach the woman he likes at Central Perk?",
  "Why does Phoebe suggest doing a cleansing ritual on Valentine's Day?",
  "What is the name of the woman Ross is on a date with at the Chinese restaurant?",
  "What is the reason for the fire at Monica and Rachel's apartment?",
  "Why does Chandler want to dump Janice on Valentine's Day?",
  "What does Ross suggest to Carol at the Chinese restaurant?",
  "What is the name of the woman Joey is set up with on his date?",
  "What do the firemen offer to do for the girls at the end of the episode?",
  "What is the reason for Ross's date with Kristin not going well?",
  "What does Janice give to Chandler as a gift?",
  "Why does Phoebe's friend Abby suggest doing a cleansing ritual?",
  "What does Ross do when he sees his ex-wife Carol at the Chinese restaurant?",
  "What is the outcome of Ross's suggestion to Carol?",
  "What do the girls burn in their boyfriend bonfire?",
  "Why does Joey's date with Lorraine not go as planned?",
  "What is the reason for Chandler's reluctance to dump Janice?",
  "What does Janice say to Chandler when he tries to dump her?",
  "What is the outcome of the girls' boyfriend bonfire?",
  "What do the firemen tell the girls about Valentine's Day?",
  "What is the name of Phoebe's friend who shaves her head?",
  "What does Ross do when he realizes he is still in love with Carol?",
  "What is the outcome of Chandler's attempt to dump Janice?",
  "What do the girls do with the firemen at the end of the episode?",
  "What is the reason for Ross's date with Kristin not going well?",
  "What does Janice do when Chandler tries to dump her?",
  "What is the outcome of the episode for Ross and Carol?",
  "What does Phoebe suggest the girls do to get over their ex-boyfriends?",
  "What is the reason for the fire department's visit to Monica and Rachel's apartment?",
  "What does Joey do when he realizes Lorraine is not interested in him?",
  "What is the outcome of Chandler's conversation with Janice?",
  "What do the girls learn from their experience with the firemen?",
  "What is the reason for Ross's feelings for Carol?",
  "What does Janice do when she leaves Chandler's apartment?"
]