{
  "show": "Friends",
  "season": 10,
  "episode": 6,
  "title": "Friends - 10.06 - The One With Ross' Grant",
  "transcript": "Friends\n1006 - The One With Ross' Grant\nWritten by: Sebastian Jones\nProduced by: Robert Carlock and Wendy Knoller\nTranscribed by: Coffee Mug, Eleonora, Sebastiano & Vanessa\nFinal check by\nKim\n[Scene: Central Perk, everyone except Phoebe is there]\nPhoebe: (she enters) Hey...\nAll: Hey!\nRachel: Hi!\nRoss: Pheebs, what's wrong?\nPhoebe: Oh, I'm just so exhausted from dragging around this...\n(she shows her ring) HUGE engagement ring!\nAll: OH!\nRachel: My God!\nJoey: Hey!\nRachel: Congratulations! Wow!!\nRoss: So, did he get on one knee, did he have a speech prepared,\nor (in a tender way) did he cry? (the guys look at him) Yeah, big surprise,\nI like proposals!\nPhoebe: Well, it was really sweet, and like the\nmost romantic thing ever.\nJoey: Well, hey! Well... (he takes his mug to toast Phoebe)\nHere's to Phoebe, who's found the greatest guy in the world! To Phoebe and...\n(a bit uncertain) I wanna say Mike? (pause) To Phoebe and Mike!\nAll: Whoo!\nPhoebe: Thank you! (to Rachel) Oh, and I have something for\nyou!\nRachel: Mmh-mmh!\nPhoebe: It's, yes, my little black book. It's got the numbers\nof all the guys I've dated.\nRachel: Oh, Pheebs, baby, that's nice but, you know what,\nI think I'm ok. Why don't you give it to one of your other single girlfriends?\nPhoebe: I would, but you're the last one.\nRachel: (angrily) GIVE ME THE BOOK! (she takes it and start\nreading) Pablo Diaz, Brady Smith, huh, \"Guy-in-van\"?\nPhoebe: Oh, my first love!\nRachel: Oh!\nMonica: What does the red X next to Bob Greenmore's name mean?\nPhoebe: Dead. (everyone is a bit upset) Oh, it's OK, no,\nhe  was old, yeah! And he lived a full life, he was in the first wave\nat Omaha Beach.\nChandler: Hey, I'm sorry, I should have given you guys my\nblack book when I got married! Although it wasn't so much a book as a... napkin.\nWith Janice's phone number on it.\nRachel: Phoebe, isn't Jethro Tull a band?\nPhoebe: (proud of herself) Oh yes, they are.\nOPENING CREDITS\n[Scene: Chandler and Monica's apartment]\nChandler: (he enters) Hey honey!\nJoey: (Looking inside the fridge, and we only see his back.\nThen he closes the door, and we see it's Joey.) Hi sweetie!\nChandler: Is Monica not here?\nJoey: No.\nChandler: Oh, then I'll tell you. My agency was bidding for\na big account and they got it! It's my first national commercial!\nJoey: Cool!\nChandler: Yeah, and I don't wanna brag but a lot of the ideas\nwere mine! (silence) Hell, you weren't there? All the ideas were\nmine!!!\nJoey: That's great! Hey, can you cast me in it?\nChandler: Oh... I don't know, I really don't think you're\nright for the part.\nJoey: What do you mean? I can do anything, I'm a chameleon!\nHuh? (he mimes an old man with a beard) I'm old! (then he yawns) I'm tired!\n(then he mimes someone who's hot...) Hey, I'm hot (...and cold) I'm cold!! Huh??\nCome on! What can't I do?\nChandler: First of all. Bravo. Uh, but I really don't think\nyou're right for this. The part calls for a stuffy college professor.\nJoey: I can do that! (in a deeper voice) \"Hello, I'm\nyour professor. When I'm not busy thinking of important things or... professing.\nI like to use...\" Oh, what's the product?\nChandler: Software that facilitates inter-business networking\ne-solutions?\nJoey: (after a long pause he starts miming again) I'm cold!\n[Scene: Central Perk. Charlie is sitting on the couch and Ross\nenters.]\nRoss: (to Charlie) Hey!\nCharlie: Hey!\nRoss: Guess who's a finalist for a huge research\ngrant!  I'll give you a hint, he's looking right at you.\nCharlie: Ah, well, unless it's the creepy guy with his hand\nup his kilt, I'm gonna say congratulations!\nRoss: Oh, I'm so excited, I mean, apparently I beat out hundreds\nof other applicants, included five guys I went to graduate school with. Not\nthat I'm keeping score or anything... five!\nCharlie: Wow, that's great! So, tell me about the grant!\nRoss: Well, ok, it's for 25 thousand dollars. And if I get\nit, I'll finally be able to complete my field research! And there\nwill be  an article about me in the \"Paleontology Review\"! Yeah!\nThat'll be  the first time my name is in there, without people raising serious\nquestions\nabout my work!\nCharlie: Wait. Are you talking about the Dewar grant?\nRoss: Yeah. Why?\nCharlie: Benjamin Hobart is administering that grant.\nRoss: Your ex-boyfriend?\nCharlie: Yeah.\nRoss: So, your ex-boyfriend is gonna determine if your new\nboyfriend gets this grant? Wow, your new boyfriend is screwed!\nCharlie: No, no, we ended up in great terms. I mean, if anything,\nI think this could help you. You know what? Why don't we all go out to dinner\ntogether, and I can introduce you.\nRoss: Well, if you think it would help.\nCharlie: Yes, absolutely. I'll call him.\nRoss: Ok, now, is there anything I can do to... you know,\nbutter him up? Anything he really likes?\nCharlie: Mmh... he does have a pretty serious latex fetish.\nRoss: We'll see how dinner goes.\n[Scene: Phoebe's apartment. She is packing a few tings into boxes.]\nPhoebe: (looking at Monica entering) Hey!\nMonica: Hey, you wanna go to see a movie?\nPhoebe: Well, I told you I had to spend all the day clearing\nout stuff, so Mike could move in.\nMonica: Oh, right.\nPhoebe: Yeah.\nMonica: Oh, well. Now that I'm here I might as well help you\nwith the cleaning and organizing! Just happen to have my label maker!\nPhoebe: Oh, it's so hard to get rid of stuff! Did\nyou and Chandler have to make compromises when you first moved in together?\nMonica: Uh, Chandler did! What does he want you  to give  up?\nPhoebe: A bunch of stuff. And the worst one... he wants me\nto get rid of Gladys.\nMonica: Who's Gladys? (Phoebe shows her a horrific painting\nwith a half-a-body girl dummy coming out of the frame. Monica's frightened and\nshe gasps.) Oh! What a tragic loss!\nPhoebe: Yeah. I really hate to give her up. Oh,\nI know!! Oh, you should take her!\nMonica: (faking happiness) Well, I-I-I-I... I don't know...\nPhoebe: Why, you don't like her?\nMonica: Well, of course I do. What's not to like! I'll\ntake her in a minute! But, you know, I think that you're giving up too\neasy, honey. I think that you need to fight for her!\nPhoebe: Really? You think?\nMonica: Absolutely! Yes, you say to him \"I'm sorry\nMike I can't live without her, she means too much to me!\"\nPhoebe: Ok, I'll fight for her. Ok! Oh, wait, oh I just\nrealized... if I do that, that means you don't get her.\nMonica: Damn it, I did not think this through!\n[Scene: Central Perk. Rachel, Joey and Emma are there.]\nChandler: Hey you guys.\nRachel: Hi!\nJoey: Oh! Any word on casting yet?\nChandler: Joe, I told you, you're just not right for\nthe part.\nJoey: What do you mean? Rach, don't I seem like a professor\nyou'd buy some kind of e-crap from?\nRachel: I'm sorry, this sounds like something I'm never gonna\nbe interested in.\nJoey (to Chandler): Look, c'mon, please? It's\nnot like I'm asking for some crazy favour. This is what I do for a living. I\nam a professional actor! (he glances at his watch and sees the time) Oh, man,\nI'm two hours late for work! (he stands, ready to go). Look, here's a\ncopy of my reels. It's got all the commercials that I've been in.\nChandler: Joe...\nJoey: Just watch it, and if you don't like it, you don't\npass it on to your bosses!\nChandler: Fine!\nJoey: Thank you. (he sits down)\nChandler: Work, Joe!\nJoey: Damn it! (he leaves)\nChandler (to Rachel): What am I gonna do now?\nJoey: Just pass it to your boss!\nChandler: He's not right for the part. So if I suggest\nhim, my bosses are gonna think I'm an idiot! And that's something they should\nlearn on their own!\nRachel: Just tell Joey that you watched the tape and you liked\nit, but your bosses didn't. Then that way, you're the good guy and\nthey're the bad guys.\nChandler: That's good! I liked it, they didn't.\n(he sees Joey out of the window hitting on a girl) Joey, for God's sake,\ngo to work! (Joey runs away).\n[Scene: A restaurant. Ross and Charlie are waiting for her ex-boyfriend,\nBenjamin Hobart]\nRoss: I can't believe I'm about to meet Benjamin Hobart.\nI've always thought of him as one of the people I'd invite to my fantasy dinner\nparty. Do you think there's any chance he'll bring Christie Brinkley\nor C3PO?\nCharlie: (glances over Ross' shoulder) Sorry, looks\nlike it's just him.\nBenjamin: Charlie! My God, you look absolutely stunning!\nRoss: Well, I... I am having a good hair day.\nBenjamin: So good to see you.\nCharlie: Me too. (she and Benjamin are hugging for very long\nand Ross starts pretending to clear his throat, until they stop)\nRoss: I'm ok.\nCharlie: I'm sorry... (introduces them to each other) Ross\nGeller... Benjamin Hobart.\nRoss: It's an honor to meet you. I can't tell\nyou how long I've been an admirer of your work, I mean, that Nobel prize,\n(he thumbs up) whoooo! I mean, I have to tell you that, you're one of\nthe reasons I got into the field.\nBenjamin: Oh, well, likewise. Actually, not likewise. I've\nnever heard of you until this morning, but, it's nice to be nice!\nCharlie: Shall we? (they sit down and Benjamin takes Ross'\nchair).\nBenjamin: (to Ross) Thank you! (to Charlie). I can't\nbelieve that you chose this restaurant! Do you remember the night?\nCharlie: Oh my God, I completely forgot! (they laugh) Oh\nmy  God! I can't believe they let us back in this place! (they laugh\nmore, and Ross start laughing too).\nBenjamin (to Ross): You weren't there!\nRoss: No, but, it's, you know, it's just a funny image,\nyou know, the two of you, in this restaurant, with... (laughs nervously)tzz-zzz,\nmmm.\nCharlie: Ross, why don't you tell Benji about your proposal,\nwhile I go to the ladies room?\nBenjamin: So, tell me about it.\nRoss: Ok well, I would like to do a dig in the painted desert.\nBenjamin: M-m.\nRoss: See, there are still several areas that haven't\nbeen fully excavated.\nBenjamin: Break up with Charlie!\nRoss: What?\nBenjamin: What?\nRoss: Did you just say \"break up with Charlie\"?\nBenjamin: Well, yes, and now. Yes I did say it, and no, I\ndidn't not say it.\nRoss: Kind of inappropriate, don't you think?\nBenjamin: I'm sorry. I just haven't seen her for so\nlong! All these feelings are rushing back! I'm starting to realize how much\nI missed her, and I'm gonna need you to break up with her.\nRoss: Are you serious?\nBenjamin: If you say yes then I'm serious, if you say no then\nI'm joking!\nRoss: No!\nBenjamin: Joking it is!\n[Scene: Monica's apartment. Phoebe enters the room.]\nPhoebe: Hi! Sorry, I'm late.\nMonica: Hey, how did it go with Mike, is he gonna let you\nkeep the painting?\nPhoebe: No, he really hates it. But he's gonna let me\nkeep my box of human hair! So you got to pick your battles. But the good news\nis, Gladys is yours!\nMonica: Wow, what's the bad news!\nRachel: Who's Gladys?\nPhoebe: Oh, she's that work of art I made, you know,\nwith the woman coming out of the frame.\nRachel: (sarcastic) Oh, and Monica gets to keep her?\nIn her house? I am so jealous!\nPhoebe: Oh, I didn't know you wanted her too!\nMonica: Huh!\nRachel: Well, I mean, sure, of course. But... you already\ngave that to Monica, so...\nMonica: You know, I would give her up, for you.\nRachel: No, I couldn't let you do that.\nMonica: But I want to.\nRachel: But I don't want you to.\nMonica: But I insist!\nRachel: But I insist harder!\nPhoebe: Girls, girls, stop, ok? We'll flip a coin. Heads,\nshe's Rachel's, tails she's Monica's. (she flips the\ncoin). Tails! Monica, she's yours!\nMonica: No, that landed in your food!\nRachel: (sarcastic) No, no, that's ok. You won fair\nand square. I'm so sad!\n[Scene: Chandler walks into Joey's apartment]\nChandler: Hey Joe!\nJoey: What's up?\nChandler: Bad news. I watched the tape and passed it along\nto my bosses and they weren't interested.\nJoey: (sounds disappointed) Oh.\nChandler: (Hands the tape back to him) I'm sorry man.\nJoey: (looks at him suspiciously) But, ehm... you watched\nthe tape?\nChandler: (sounds nervous) Yeah! I... I... I liked it! (Joey\ncontinues to look at him suspiciously) But, ehm... my bosses didn't go for it.\nStupid sons of bitches!\nJoey: (sounds confident) You didn't watch the tape.\nChandler: (looks surprised) What!? Of course I did!\nJoey: Look, it's one thing not to cast me, but to lie to me?\nChandler: I'm not lying to you, I watched it!\nJoey: Well, you lied again! (Rachel comes out of her room\nand is observing the conversation)\nChandler: I watched it!\nJoey: Keep going Pinocchio!\nChandler: (now yelling) (pretending to look shocked) I did!\nJoey: (yelling back) No you didn't! (turns and goes towards\nhis room)\nChandler: (following him) I'm telling you, I watched the tape.\n(Reaches Joey's room and Joey slams the door in his face)\nRachel: Did you watch the tape?\nChandler:(In a sarcastic \"of course not\"!-tone)\nNo!\n[Scene: Interview room. Ross and two other professors (one man,\none woman) are sitting on one side of a long desk. Benjamin Hobart is sitting\non the other side]\nBenjamin: The selection committee has chosen the three of\nyou as our finalists today. The ultimate decision will be based upon the answers\nyou give to the questions I ask here. I'm gonna start with Dr. Li. Dr. Li, you\nclaim the field is too reliant on the Linnaean taxonomic system. How do you\npropose to correct this problem?\nDr. Li: Well, I believe that the answers lie in the osteological\nevidence. I plan to begin there.\nBenjamin: (nods) Interesting.\nRoss: (Rolls his eyes) I guess!\nBenjamin: Dr. Biely, your proposal includes some field work.\nWhere might that take place?\nDr. Biely: Primarily in the Pierre Shale region of South Dakota.\nBenjamin: Certainly. Very well. And Dr. Geller, when is my\nbirthday?\nRoss: (shocked and confused by the question) What? I... I...\n(Benjamin looks at him as if to say \"What's wrong? Answer the question\")\nBenjamin: Care to venture a guess?\nRoss: (annoyed) May 12th?\nBenjamin: (looks surprised and un-impressed) That's not even\nkinda close! (Ross looks around confused) Dr. Li, how many graduate students\nyou'd be needing?\nDr. Li: Half a dozen.\nBenjamin: I see, and Dr. Biely?\nDr. Biely: Three for excavation and two for analysis.\nBenjamin: Certainly. Dr. Geller, which 1965 Shirelles hit\nwas later covered by a popular British invasion band?\nRoss: (even more shocked) Wha..? I need 6 graduate students.\nBenjamin: No! I'm sorry, we were looking for \"Baby It's\nYou\". Baby It's You.\nRoss: Wha...? Wait, wait, wait, just a minute. None of my\nquestions have anything to do with Paleontology.\nBenjamin: You're right, I apologize. Scratch the last question.\nSpell \"Boscodictiasaur\".\nRoss: (annoyed) um... I've never heard of a \"Boscodictiasaur\".\nBenjamin: Yeah, I just made it up. Spell it.\nRoss: (stares at him angrily) Ok. (determined to spell it\ncorrectly) B - O - S ...\nBenjamin: No, it starts with a silent \"M\".\nRoss: Oh come on!!\n[Scene: Joey and Rachel's apartment. Chandler and Rachel are\ntalking.]\nChandler: I can't believe Joey. I hate being called a liar!\nRachel: But you are a liar.\nChandler: What did I just say?\n(Joey comes out of his room)\nJoey: You still here?\nChandler: Yes, and I have to say, I am not just hurt. I am\ninsulted. When I tell somebody I did something...\nJoey: Ok whoah-hey... Let me just stop you right there, ok?\nFirst, you lied, right? Then, you lied about lying, ok? Then you lied about\nlying about lying, ok? So before you lie about lying about lying about lying\nabout... lying... (loses count and begins to count the number of 'lyings' in\nthe air but gives up.) (yelling) Stop lying!\nChandler: Why are you so sure I didn't watch this tape?\nJoey: (very angry) You wanna know wh...? You wanna know why?\n(goes back into his room)\nRachel: Well, this is going well. (Chandler looks worried)\nJoey: (comes out holding the tape) Here's how I know you didn't\nwatch the tape, ok? (puts it into the vcr) If you had seen what was on this\ntape, believe me, you would have some comments. Alright, now remember, I\ngot paid a lot of money for this and it only aired in Japan. (presses play\nand he appears on the TV screen and a TV commercial begins)\n(The commercial:\nJoey says \"Ichiban\". It displays a few girls dancing around and Joey\nfills most of the screen, he puts something blue on his lips and smacks them\nsaying \"Lipstick For Men!\" It goes on to show him playing a guitar\nand putting on more blue lipstick. In the end he says seductively \"Ichiban...\nLipstick For Men\" and \"Sahiko\" and it ends. Chandler and Rachel\nare speechless.)\nJoey: (Yelling at Chandler) And that's how I know you\ndidn't watch the tape! (goes back to his room and slams the door).\n(Silence)\nChandler: He really is a chameleon.\n[Scene: Monica's apartment. Phoebe enters carrying the horrific\n'painting' of Gladys. Monica and Rachel are sitting on the couch.]\nPhoebe: (smiling from ear to ear) Well, Gladys say hello to\nyour new home! (she holds out the 'painting')\nMonica: (faking happiness) Oh, my!\nRachel: (surprised by how ugly it is) Wow! (sarcastic) Oh,\nshe's so nice and big! Oh, Monica, where are you going to display Gladys oh\nso proudly? (looks around for a spot)\nMonica: (sounds desperate, knowing what Rachel is trying to\ndo) I haven't really settled on a spot yet!\nRachel: Well, hey! How about right above the TV? (Points to\nthe spot where her famous French poster is hanging). That way, it will be\nthe first thing that you see when you walk in the door!\nPhoebe: (genuinely excited about it) Yeah, yeah! And you can\nget rid of that French poster.\nMonica: (offended) I like that poster!\nPhoebe: Really? It doesn't have anything coming out of it.\nOr maybe there is some place for her in your bedroom?\nRachel: (jumps at the chance to make that happen) Oh! There's\nnothing above your bed!!\nMonica: (Impatient with Rachel) Are you still here?\n[Scene: Ross' office. Ross is pacing and Benjamin enters]\nRoss: Oh hi! Hello! Uh, have you come to ask me some more paleontology\nrelated questions? Uhm... your grandmother's nickname, perhaps? (Now yelling)\nAunt Margaret's pants size?\nBenjamin: I've come here to apologize. I think I may have\nlet my feelings for Charlie interfere with the interview process.\nRoss: (Sarcastic) No! Stop!\nBenjamin: Anyway, I've decided to offer you the grant.\nRoss: (Skeptical) Really?\nBenjamin: Well... there is just one small... stipulation...\nRoss: I have to break up with Charlie?\nBenjamin: Hey, you got one right!\n(Ross shakes his head)\nRoss: You're crazy.\nBenjamin: Crazy, or... romantic?\nRoss: Crazy!\nBenjamin: Ooor...\nRoss: (Yelling) Get out! (Benjamin leaves)\n[Scene: Joey and Rachel's apartment.]\n(Rachel enters, checking the mail, then looks up and sees Gladys placed on\nthe barcalounger.)\nRachel: O-oh my God!\nJoey: (enters from his bedroom) What?\nRachel: Joey, what... is... this...thing... doing here?\nJoey: I got it from Monica. She sold it to me for a very\nreasonable price.\nRachel: Joey, we're not keeping this!\nJoey: But it's an original Buffay...\nRachel: Alright, fine. You can keep it. As long as you don't\nmind that she's haunted.\nJoey: Hey? what? what? wey! whoo! what? what!?\nRachel: Well, legend has it Joey, that... she comes alive\nwhen you're asleep.\n(Joey's eyes are twice their size now, and looks nervously from Rachel to Gladys\nand back.)\nRachel: She climbs out of the frame, and then drags her half-a-body\nacross the floor, just looking for legs to steal. (in a spooky, slow voice)\nAnd then with her one good hand, she slo-o-owly re-e-a-aches up and turns your\ndoorknob.\nJoey: GET THAT LEGLESS WITCH OUT OF HERE!\n(Joey leaves for his bedroom, and Rachel grins. She then takes Gladys and enters\nMonica's apartment.)\nMonica: Hey! I sold that to Joey.\nRachel: Well, why I told him it's haunted. Two can play at\nthis game. (gives Gladys to Monica)\nMonica: No, too late. You can't give it back! (she pushes\nthe painting back to Rachel)\nRachel: Yes I can! (pushes her back again)\nMonica: No you can't. She's yours!\nRachel: She's yours!\nMonica: SHE'S YOURS!\nRachel: She's yours!\n(While they are both pushing the painting towards each other, Phoebe enters)\nPhoebe: Hey! (there's a pause)\nRachel: She's mine!\nMonica: She's m-i-i-ne!\nRachel: She's mine!\nMonica: She's mine!\nPhoebe: You guys! You guys! You don't have to fight over her\nanymore. (she goes out into the hallway and enters with an even more hideous\npainting/collage. One of those faceles mannequins heads wearing a blueish dress\nand orange gloves reaching out into the room. Around the head 3 small dolls\nare hovering.) Whoever doesn't get Gladys gets Glynnis. (Rachel and Monica are\ngasping for air at the sight of this monstrous piece of art.)\nRachel: I want Gladys!\nMonica: She's mine!\nRachel: She's mine!\nMonica: She's mine!\nRachel: She's mine!\n[Scene: Rachel and Joey's. Joey's home alone, reading a Sports\nIllustrated magazine when Chandler enters.]\nChandler: Look, I'm sorry I didn't give them your tape. And\nI promise, next time to submit you whether I think you are right for the part\nor not.\nJoey: That's not the point Chandler. The point is that you\nlied.\nChandler: I know. You're right. What's it gonna take for you\nto forgive me?\n[Scene: Central Perk. Monica, Phoebe and Rachel are on the couch.]\nMonica: Oh my God!\n(we see Joey and Chandler standing there, and Chandler is wearing the blue\nIchiban lipstick!)\nRachel: Excellent!\nJoey: Now, what do you say?\nChandler: Lying is wrong!\nJoey: And?... AND?\nChandler: I'm a pretty little girl.\nPhoebe: I knew it!\n[Scene: Central Perk. Some time later that day. The group has\nleft and Charlie is there when Ross enters.]\nRoss: Your ex-boyfriend is insane.\nCharlie: Did you get the grant?\nRoss: No I didn't, and you want to know why? Because your\nex-boyfriend is still in love with you.\nCharlie: What?\nRoss: Yeah. He wouldn't give me the grant, because I wouldn't\ngive you up.\nCharlie: Benji isn't in love with me. I mean, he broke up\nwith me. And besides, he's a very ethical man.\nRoss: Really? Is it ethical to ask someone in a grant review,\nwho was the voice of \"Underdog\"?\nCharlie: I'm sure he was just joking, Ross.\nRoss: If you don't believe me, let's go talk to him, okay?\nI'm telling you, he didn't ask me one paleontological question.\nCharlie: Seriously?\nRoss: Oh, I'm sorry, no. He did ask me one. Uhm... How do\nyou spell Mboscodictiosaur?\nCharlie: Well, if it's like the lake Mbosco in Congo, then\nM-B-O...\nRoss: Damnit!\n[Scene: Benjamin's office. Ross and Charlie are entering.]\nBenjamin: Dr. Geller...? Charlie... What are you... what are\nyou doing here?\nRoss: I want you to tell her everything. About the deal you\ntried to make with me, about the crazy questions you... Wally Cox! That's the\nvoice of Underdog!\nBenjamin: Like I tried to tell you in the interview Ross,\nthis grant is not based on your knowledge of pretty useless trivia.\nRoss: No, no, no. Don't do that! I want you to look her in\nthe eyes, and tell her the truth.\nCharlie: Benji?\nBenjamin: Alright, it's true. I behaved horribly. But it's\nonly because I still love you. And I would do anything to have you back in\nmy life.\nRoss: Too little, too late, Benji!\nCharlie: I can't believe this.\nBenjamin: I never should have broken up with you. I think\nabout you all the time. I mean, do you ever still think about me?\nRoss: (indignant) No!\nCharlie: Yes!\nRoss: What?\nCharlie: I don't know what to say, Benji. This is all so....\nromantic.\nRoss: or...\nBenjamin: Listen, I know, I may be way out of bounds here,\nbut is there any chance you will take me back?\nCharlie: Maybe...\nRoss: Sweetie, this conversation is starting to make me a\nlittle uncomfortable.\nCharlie: Oh God! I am so sorry, but... (she puts her hand\non Ross's cheek) I mean it's... there's so much history between us, you know...\nBenjamin: (puts his hand on Ross's other cheek) I'm sorry\ntoo...\n(Charlie and Benji both let their hands slide down Ross's face, until their\nhands meet, and they hold hands.)\nBenjamin: I love you!\nCharlie: I love you too! (and they start to kiss)\nRoss: Okay, that's it. WE ARE SEEING OTHER PEOPLE!\nCOMMERCIAL BREAK\n[Scene: Joey's bedroom. Joey's asleep with Hugsy, the penguin\nright next to him.]\n(There are scratching and squeaking noises coming from the living room, and\nJoey wakes up, terrified. He pulls his blanket higher. The doorknob is turning.)\nJoey: Gladys?\n(The door opens, and there is Gladys, still in her frame though. Joey panics\nand moves frantically, screaming. Then there is laughing, and the painting is\nlowered. It was Rachel holding Gladys.)\nRachel: Ha ha ha, third time this week. Man, this does not\nget old.\nJoey: You're mean!\nRachel: Oh, don't be such a baby!\n(She closes his door again, and turns around. Then she starts screaming, terrified.\nThere is Glynnis... And Monica holding her up, laughing.)\nend",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/1006.html",
  "scrapedAt": "2025-12-17T14:34:01.212Z",
  "wordCount": 4322,
  "hasCharacterNames": true
}