{
  "title": "Marvel Mcu",
  "content": "## Marvel Cinematic Universe\n\nThe Marvel Cinematic Universe (MCU) is an American media franchise and shared universe centered on a series of superhero films produced by Marvel Studios. The films are based on characters from American comic books published by Marvel Comics. The franchise also includes several television series, short films, digital series, and literature. The shared universe, much like the original Marvel Universe in comic books, was established by crossing over common plot elements, settings, cast, and characters.\n\n---\n\n## List of Marvel Cinematic Universe films\n\nThe Marvel Cinematic Universe (MCU) centers on a series of American superhero films produced by Marvel Studios based on characters that appear in publications by Marvel Comics. The MCU is the shared universe in which all of the films are set. The films have been in production since 2007, and in that time Marvel Studios has produced and released 37 films, with at least 8 more in various stages of development. It is the highest-grossing film franchise of all time, having grossed over $32.4 billion at the global box office. This includes Avengers: Endgame, which became the highest-grossing film of all time at the time of its release.\n\n---\n\n## Avengers (film series)\n\nThe Avengers are a team of superheroes and the protagonists of the Marvel Cinematic Universe (MCU) media franchise, based on the eponymous team from Marvel Comics created by Stan Lee and Jack Kirby in 1963. Founded by S.H.I.E.L.D. director Nick Fury, the team is a United States–based organization composed primarily of superpowered and gifted individuals, described as \"Earth's Mightiest Heroes\", who are committed to the world's protection from a variety of threats.",
  "source": "Wikipedia (Movies)",
  "sourceUrl": "https://en.wikipedia.org/wiki/Marvel%20Cinematic%20Universe",
  "fetchedAt": "2025-12-20T12:10:57.677Z",
  "citations": [
    {
      "text": "Marvel Cinematic Universe",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Marvel_Cinematic_Universe"
    },
    {
      "text": "List of Marvel Cinematic Universe films",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films"
    },
    {
      "text": "Avengers (film series)",
      "source": "Wikipedia",
      "url": "https://en.wikipedia.org/wiki/Avengers_(Marvel_Cinematic_Universe)"
    }
  ],
  "metadata": {
    "category": "movies",
    "subcategory": "franchises",
    "topic": "marvel-mcu",
    "articleCount": 3
  }
}