[
  "What does Joey say when Chandler asks which recliner is his?",
  "What does Phoebe say when Monica asks her to be a waitress?",
  "What is the name of the TV show that Chandler and Joey are watching when Ross enters?",
  "Why does Rachel start laughing when Ross puts his hands on her butt?",
  "What does Ross say when Rachel asks him to grab her ass?",
  "What is the name of the restaurant that Ross and Rachel were supposed to go to for dinner?",
  "What does Monica say when Phoebe suggests she ask Dr. Burke out?",
  "What does Dr. Burke give Monica at the end of her eye appointment?",
  "What is the name of the display that Ross is working on at the museum?",
  "What does Rachel do when she's waiting for Ross to finish work at the museum?",
  "Where do Ross and Rachel end up having their romantic dinner?",
  "What does Ross use as a blanket in the planetarium?",
  "What is the reaction of the church youth group when they see Ross and Rachel in the morning?",
  "What is the name of the TV show that Chandler and Joey are watching at the end of the episode?",
  "Why does Monica go to Dr. Burke's office?",
  "What is the reason for the fire alarm going off in Chandler and Joey's apartment?",
  "What does Phoebe say when she's pretending to be a waitress?",
  "What is the name of the friend who used to be 'so...' according to Dr. Burke?",
  "What does Dr. Burke give to Monica at the end of their conversation at his apartment?",
  "What does Ross say when Rachel asks him to put his hands on her butt again?",
  "What is the reason for Monica's eye appointment with Dr. Burke?",
  "What does Chandler say when Joey asks him what to do if they have to pee?",
  "What is the name of the music that Ross plays in the planetarium?",
  "What does Rachel say when Ross asks her why she's laughing?",
  "What does Phoebe say when Monica asks her to cover for Rachel at the catering event?",
  "What is the reason for Ross's beeper going off?",
  "What does Joey say when Chandler asks him what to do if they have to get up from their recliners?",
  "What does Monica say when Phoebe asks her if she's going to ask Dr. Burke out?",
  "What does Dr. Burke say when Monica asks him how he's doing?",
  "What does Ross say when Rachel asks him why he can't put his hands on her butt again?",
  "What does Phoebe say when she's talking to Monica about Dr. Burke?",
  "What does Dr. Burke say when Monica asks him about his divorce?",
  "What does Rachel say when Ross asks her why she's checking if Monica is home?"
]