{
  "show": "Friends",
  "season": 4,
  "episode": 21,
  "title": "The One With the Invitation",
  "transcript": "The One With The Invitation\nWritten by: Seth Kirkland\nTranscribed by: Eric Aasen\nWith Help from: Darcy Partridge\nEpisodes Orginally Transcribed by: guineapig,\nRuth Curran, Mindy Mattingly Phillips, Josh\nHodge,  Dan Silverstein, and Eric Aasen.\n[Scene: Central Perk, Joey and Chandler are sitting and talking.]\nChandler: Y’know what? It seems like all of the sudden; so much has\nhappened.\nJoey: I know. Ross is getting married.\nChandler: Phoebe is, making people.\nJoey: Everybody’s doing stuff!\nChandler: And we just sit here. I mean if I die the only way people would even\nknow I was here, would be by the ass print on this chair! Look, we have to do something.\nOkay? Something huge!\nJoey: (snaps his fingers) We could climb Mt. Everest!\nChandler: No-no, not something stupid, something huge.\nJoey: No-no-no-no-no, I saw an ad for this video, people climb that thing\neveryday! We could totally do that!\nChandler: Why not?! I mean it’s just, it’s just climbing! It’s\njust, it’s just steep!\nJoey: Yeah!\nChandler: We’re going to Everest! Okay, it would be nice to leave an ass\nprint on Everest!\nPhoebe: (entering) Hey!\nJoey: Hey!\nPhoebe: What-what’s up?\nJoey: We’re gonna climb Mt. Everest!\nChandler: Yeah baby!\nPhoebe: Really?! I looked into that. Yeah, but, I mean it costs like $60,000 and\ny’know you can die. And, you would die!\nChandler: (dejected) Yeah, well…\nJoey: We could get that Everest video though.\nChandler: Yeah, we could do that without y’know risking our lives at all!\nJoey: And while we’re down at the video store, you know what else we could\nrent? Die Hard! (Chandler’s excited.) Oh, y’know what? I just remembered,\nthat Everest thing is only available through mail order.\nChandler: (dejected) Oh, well…\nPhoebe: So you guys’ll stay here and hang out with me?\nChandler: Yeeeeahhhh.\nJoey: Yeah. Yeah.\nChandler: But I’ll tell you something. One of these days we’re get off\nof our buts and rent Die Hard again!\nJoey: Yeah we are!\nOpening Credits\n[Scene: Ross’s apartment, he and Emily are addressing their invitations.]\nEmily: So what did he decide? Does your Uncle Nathan get an invite or not?\nRoss: Ohh, God, nobody likes him, and he’s so cheap, he’d never fly to\nLondon in a million years. Yeah, invite him? Hey, did I do these neat enough? (Hands her\nsome envelopes.)\nEmily: Yeah, they’re fine.\nRoss: Yeah?\nEmily: If anyone asks, we’ll just say Ben addressed them. (Looking through\nthe envelopes.) Oh! So you invited Rachel then?\nRoss: Sure. Why not?\nEmily: Really?\nRoss: Yeah?\nEmily: I don’t think I’d be comfortable with any of my old lovers\nthere.\nRoss: Wait-wait-wait, do you, do you think, maybe we shouldn’t invite her?\nEmily: Oh, no-no, y’know I absolutely adore Rachel it’s just that,\nwell it might be a awkward for you. But it’s absolutely your decision. (Gets up.)\nMore tea?\nRoss: Yeah sure.\nEmily: Earl Grey?\nRoss: Huh? Yeah, fine, invite whoever you want.\n[And with that we start off on a series of clips from the entire history of Ross and\nRachel, from Ross’s point of view. The first clip is from The Pilot.]\n[Scene: Central Perk, Ross is complaining about Carol.]\nRoss: I don't want to be single, okay? I just... I just- I just wanna be married\nagain!\n(A woman enters wearing a wet wedding dress and frantically starts to look around.)\nChandler: And I just want a million dollars! (He extends his hand hopefully.)\nMonica: Rachel?!\nRachel: Oh God Monica hi! I just went to your building and you weren't there and\nthen this guy with a big hammer said you might be here and you are, you are!\n[cut to later]\nMonica: Okay, everybody, this is Rachel, another Lincoln High survivor. (To\nRachel) This is everybody, this is Chandler, and Phoebe, and Joey, and- you remember my\nbrother Ross?\nRachel: Hi, sure!\nRoss: Hi.\n(They go to hug but Ross' umbrella opens.  He sits, defeated again.)\n[cut to later]\n[Scene: Monica and Rachel's, Ross and Rachel are finishing up some cookies.]\nRoss: You know you probably didn't know this, but back in high school, I had a,\num, major crush on you.\nRachel: I knew.\nRoss: You did! Oh.... I always figured you just thought I was Monica's geeky\nolder brother.\nRachel: I did.\nRoss: Oh. Listen, do you think- and try not to let my intense vulnerability\nbecome any kind of a factor here—but do you think it would be okay if I asked you\nout? Sometime? Maybe?\nRachel: Yeah, maybe...\nRoss: Okay... okay, maybe I will...\n[The next clip is from The One With The Blackout.]\n[Scene: Monica and Rachel's, Ross and Rachel are talking about passion.]\nRoss:  See, I see.... big passion in your future.\nRachel: Really?\nRoss: I do.\nRachel: Oh Ross, you're so great. [she playfully rubs his head and gets up]\n[Ross gets up, pleased with himself and starts to walk past Joey.]\nJoey: It's never gonna happen.\n[cut to later]\n[Scene: Monica and Rachel's balcony, Ross is about to be attacked by Paulo's cat.]\nRoss: Hey, I have a question. Well, actually, it's not so much a question as..\nmore of a general wondering... ment.\nRachel: Okay.\nRoss: Okay. Umm, for a while now, I've been wanting to, um....\nRachel: Ohhh!!!! [looking at something behind Ross]\nRoss: Yes, yes, that's right...\nRachel: Oh, look at the little cat! [a small kitten is on the roof behind Ross]\nLook at it!\nRoss: What? [the cat jumps on his shoulders] Ow!\n[Cut to inside, Monica, Joey and Phoebe are singing while outside, Ross and Rachel are\ntrying to get the cat off of Ross' shoulder.]\nMonica, Joey, and Phoebe: [singing] I'm on top of the world,\nlooking down on creation and the only explanation I can find...\n[The next clip is from The One With The East German Laundry Detergent.]\n[Scene: The Laundromat, Rachel is fighting with that old, annoying woman for a cart.]\nRachel: All right, listen, missy. If you want this cart, you're gonna have to\ntake me with it!\n(She thinks it over, and then walks away.)\nRachel: (to Ross) Yes! Did you see that?\nRoss: You were incredible! Brand new woman, ladies and gentlemen.\nRachel: I could not have done this without you.\n(Rachel stands up and kisses Ross. He is stunned. A moment of silence follows.)\nRoss: Ok, um, uh, more clothes in the dryer? (Ross turns and bangs his head on\nan open dryer door.) I'm fine, I'm fine.\n[The next clip is from The One Where Ross Finds Out]\n[Scene: Central Perk, I'm sure you've guessed, it's the famous fight scene between Ross\nand Rachel.]\nRoss: You had no right to tell me you ever had feelings for me.\nRachel: (hurt) What?\nRoss: I was doing great with Julie before I found out about you.\nRachel: Hey, I was doin' great before I found out about you. You think it's easy\nfor me to see you with Julie?\n[cut to later]\nRoss: The point is I... I don't need this right now, OK. It, it's too late, I'm\nwith somebody else, I'm happy. This ship has sailed.\n[cut to later]\nRachel: Alright, fine, you go ahead and you do that, alright Ross.\nRoss: Fine.\nRachel: 'Cause I don't need your stupid ship.\nRoss: Good.\nRachel: Good. (Ross leaves)\n[cut to later]\n(Rachel slams the door and locks it. She sits down, visibly upset. She puts her head in\nher hands and begins to cry. Ross comes back and is standing outside the window. When\nRachel regroups and gets back up to finish closing, she sees him.)\n[cut to later]\n(She opens the door and they kiss.)\n[The next clip is the second famous fight in The One Where Ross and Rachel Take A\nBreak.]\n[Scene: Monica and Rachel's, Ross and Rachel are arguing.]\nRachel: Ross do you realise this is the first time in my life I’m doing\nsomething I actually care about. This is the first time in my life I’m doing\nsomething that I’m actually good at. I mean. if you don’t get that...\nRoss: No, hey, I get that, okay, I get that big time. And I’m happy for ya,\nbut I’m tired of having a relationship with your answering machine! Okay, I\ndon’t know what to do anymore.\nRachel: Well neither do I!\nRoss: Is this about Mark?\nRachel: (shocked) Oh my God.\nRoss: Okay, it’s not, it’s not.\nRachel: Oh my God. I cannot keep having this same fight over and over again,\nRoss, no, you’re, you’re, you’re making this too hard.\nRoss: Oh I’m, I’m making this too hard. Okay, what do you want me to\ndo.\nRachel: I don’t know, I don’t know. Urrrgh! Look, maybe we should take\na break.\nRoss: Okay, okay, fine, you’re right. Let’s ah, let’s take a\nbreak, (goes to the door) let’s cool off, okay, let’s get some frozen yogart, or\nsomething.. (opens the door)\nRachel: No. (Ross is standing in the doorway.) A break from us.\n(Ross looks at her, then leaves slamming the door behind him.)\n[The next clip is from The One The Morning After]\n[Scene: Ross's apartment, Ross is hurrying Chloe out the door.]\nChloe: Do I know why we’re rushing?\nRoss: Yeah, y'know the ah, the girlfriend I told you about last night?\n(He’s frantically throwing the cushions off of the couch looking for her other shoe)\nWell it turns out she ah, she wants to get back together with me. Oh, I found it!!\nChloe: That’s so great for you guys!\nRoss: Yeah!\n[cut to later]\nChloe: Good luck, with your girlfriend.\nRoss: Oh, thank you. (She goes to kiss him, but he holds her coat up between\ntheir faces to stop her.) Hey, hey. (opens the door, sees Rachel, and hides Chloe behind\nthe door) Rachel!!!!\nRachel: Hi. Ohhh, you got my message.\nRoss: Yeah, oh hey, you are right on time.\nRachel: So what do you say? Can I be your girlfriend again?\nRoss: Yes, you can, very much.\n(Chloe gives Ross the thumbs up while still standing behind the door.)\nRoss: (seeing the thumbs up) Ahhhh!! (Hugs Rachel tighter.)\n[cut to later]\n[Scene: Monica and Rachel's, Rachel has just found out about Chloe and is screaming at\nRoss.  The rest of the gang is trapped in Monica's bedroom.]\nRachel: (opening the door) Y'know what, I want you to leave! Get outta here!\nRoss: No!!\nRachel: Just get out! Now!!\nRoss: No!! No!! I wanna stay. I wanna talk about this.\nRachel: Okay! All right! How was she?\n[Cut to Monica's bedroom]\nChandler: Uh-oh.\n[Cut to Living Room]\nRoss: What?\nRachel: Was she good?\n[Cut to Monica's bedroom]\nJoey: Don’t answer that.\n[Cut to Living Room]\nRachel: Come on Ross! You said you wanted to talk about it, let’s talk\nabout it!! How was she?\nRoss: She was...\n[Cut to Monica's bedroom]\nJoey: Awful! Horrible!\nChandler: She was not good. Not good.\nJoey: She was nothing compared to you.\n[Cut to Living Room]\nRoss: She, she was different.\n[Cut to Monica's bedroom]\nJoey: Ewwwww!\nChandler: Uh-oh.\n[Cut to Living Room]\nRachel: Good different?\nRoss: Nobody likes change.\n(Rachel picks up a newspaper and starts beating him with it.)\nRoss: What? Okay, okay, okay, okay.\n[The next clip is from The One With The Jellyfish.]\n[Scene: Rachel's bedroom, Rachel, entering selfish mode, is thanking Ross for wrongly\ntaking the entire blame of the breakup; as if she had absolutely nothing to do with it.]\nRachel:  ...the way you owned up to everything, it just showed me how much\nyou’ve grown. Y'know?  I mean my Mom never thought this would work out.\nIt was all, “Once a cheater, always a cheater.”  Ooh, I just wish we\nhadn’t lost those four months, but if time was what you needed just to gain a little\nperspective...\nRoss: WE WERE ON A BREAK!!!!!!!\n[Cut back to the present.]\n[Scene: A mailbox, Ross is mailing the invitations.  He throws a bunch into the\nmailbox, but pauses with Rachel's.  And it starts another round of clips.]\n[The One With The Fake Party]\n[Scene: The hallway, Rachel is convincing Ross that Emily is good for him.]\nRachel: You seem to really like her.\nRoss: Yeah, I really do. Yeah, but what am I gonna do, I mean we-we both agreed\nthat it was gonna be a two-week thing, y’know no commitment.\nRachel: Ross, that girl just spent the entire evening talking to your friends,\nasking to hear stories about you, looking through Monica’s photo albums, I mean you\ndon’t do that if you’re just in it for two weeks.\nRoss: You think?\nRachel: Yeah, you got like 14 hours until she has to be at the airport, and\nyou’re sitting here in the hallway with a 28-year-old cheerleader with a fat lip.\nRoss: Hey, you’re right.\nRachel: Yeah.\n[Cut back to the present, Ross is still looking at Rachel's invitation.  Finally,\nhe makes up his mind and mails it.]\nCommercial Break\n[Scene: Monica and Rachel's, Joey, Monica, and Phoebe are opening their invitations.]\nMonica: Ohh, this is soo amazing! I can’t believe my brother’s getting\nmarried! And in London! It’s so romantic!\nJoey: (taking apart the invitation) Hey, pretty smart! Tissue paper! You’re\nat the wedding, you have to cry, \"Handkerchief?\" \"No-no, I got my\ninvitation.\"\nPhoebe: Oooh look! Isn’t this adorable, Ross let Ben address mine!\nChandler: (entering) Hello!\nJoey: Hey!\nMonica: Hey!\nPhoebe: Hey! Hey, did you get your invitation to Ross’s wedding?\nChandler: (sarcastic) Noo.\nJoey: Don’t worry man, I get to bring a guest. We’ll show him.\nPhoebe: I’m so jealous you’re all going! I can’t believe I never\nknew that you can’t fly in your third trimester!\nChandler: I didn’t know that.\nMonica: I never knew that either.\nJoey: I knew that! (They all look at him) I sooo didn’t know that, but you\nshould see your faces.\nRachel: (entering) Hey guys! What’s up?\nJoey: Heyyy. (They all try and hide their invitations.)\nMonica: We’re hanging out.\n(Rachel starts going through her mail, and come across her invitation.)\nRachel: What’s this? Is this Ross’s wedding invitation?\nChandler: See, maybe that’s the one we should’ve actually hidden.\nRachel: Oh, no! No you guys! Come on, you don’t have to do that! I’m\nhappy for him! I am! I really—I’m-I’m happ—I’ll work on it.\nMonica: I’m sorry honey.\nRachel: Yeah.\nMonica: Rach, you’re gonna come though aren’t you?\nRachel: Oh, honey, I don’t know. I…\nChandler: This isn’t one of those uh, y’know \"If she doesn’t\ncome, we-we don’t, we don’t come?\" Right? Because I already bought my\nticket…\nMonica: You know what would be real weird? Is if you weren’t there. Just\nsay you’ll think about it, okay?\nRachel: No, I’ll think about it. Yeah.\n[And with that, we go into another set of clips, this time from Rachel’s point of\nview.]\n[The first clip is from The One Where Rachel Finds Out.]\n[Scene: Monica and Rachel's, it's Rachel birthday party and Chandler is about to spill\nthe beans.]\nRachel: Who's this from?\nChandler: Oh, that's Ross's.\nRachel: Oh... (opens it and sees it is a pin) Oh my God. He remembered.\nPhoebe: Remembered what?\nRachel: It was like months ago. We were walking by this antique store, and I saw\nthis pin in the window, and I told him that it was just like one my grandmother had when I\nwas a little girl. Oh! I can't believe he remembered!\nPhoebe: Oh, it's so pretty. This must have cost him a fortune.\nMonica: I can't believe he did this.\nChandler: Come on, Ross? Remember back in college, when he fell in love with\nCarol and bought her that ridiculously expensive crystal duck?\n(Everyone looks at him. He realizes he just spilled the beans about Ross's crush on\nRachel.)\nRachel: What did you just say?\nChandler: (stuttering incoherently) F-hah.... flennin....\nRachel: Oh.... my God.\n[The next clip is from The One With Ross's New Girlfriend.]\n[Scene: The airport, Ross is about to walk off of the plane with Julie.]\nRachel:  (seeing Ross come off the plane with another woman.) Oh my God.\n[cut to later]\n[Scene: Monica and Rachel's, Ross is introducing Julie to the gang.]\nJulie: Well, Ross and I were in grad school together.\nRoss: But we haven't seen each other since then. Well I land in China, guess\nwho's in charge of the dig.\nRachel: Julie! Julie, isn't that great? I mean, isn't that just kick-\nyou-in-the-crotch, spit-on-your-neck fantastic?\n[cut to later]\n[Scene: Monica and Rachel's, Ross is trying to hang up on Julie.]\nRoss: Oh, that is so sweet.(listens) No, no, ok, you hang up. Ok, ok, one, two,\nthree.(He doesn't hang up and motions for Rachel to be quiet.) Well you didn't hang up\neither.\nRachel:  She didn't hang up either...\nRoss:  Ok, no, no, you hang up. You, you, y—(Rachel grabs the phone\nand hangs it up for him.)\n[The next clip is from The One Where Ross Finds Out.]\n[Scene, A Restaurant, Rachel is on her date, drunk, and is leaving that answering\nmachine message.]\nRachel: (on phone) Ross, hi, it's Rachel. I'm just calling to say that um,\neverything's fine and I'm really happy for you and your cat...(cut)...I\nam over you. I am over you and that, my friend, is what they call closure. (She hangs up\nand tosses phone in the ice bucket.)\n[cut to later]\n[Scene, Monica and Rachel's, the next morning, Ross is checking his messages.]\nRoss: Rach, I got a message from you.\n(Rachel comes out of her room, suddenly she remembers leaving the message.)\nRachel: Oh my God. Oh my God Ross, no, hang up the phone, give me the phone\nRoss, give me the phone, give me the phone, give me the. . . (She jumps the couch and\nlands on Ross's back, finally getting the phone from him. Ross has a confused expression\non his face.)\nRoss: You're over me?\nRachel: Ohhhhhhhh God. (climbs off his back)\nRoss: Wha... you're uh, you're, you're over me?\nRachel: Ohh, ohh.\nRoss: When, when were you... under me?\nRachel: Well, basically, lately, I've uh, I've uh, sort of had feelings for you.\n[cut to later in the same scene]\nRoss: OK, I need to lie down.\n[The next clip is from The One With The List.]\n[Scene: Chandler and Joey's, Ross has just broken up with Julie and is about to get\nwith Rachel.]\nJoey: He broke up with Julie. Well, go hug her, for god's sakes.\nRachel: Really?\nRoss: Really. It's always been you, Rach.\nRachel: Oh, god.\n(Ross and Rachel hug.)\nChandler and Joey: Ohhh.\n[The next clip is from The One Where Ross and Rachel.... You Know.]\n[Scene: The Auditorium, Ross and Rachel are about to... you know.]\nRoss: I've no idea, could be. Listen, I'm sorry I had to work tonight.\nRachel: Oh it's OK. You were worth the wait, and I don't just mean tonight.\n(They kiss and start undressing. As Rachel tries to pull off Ross's tie she catches it\nin his mouth. Then they roll across the fur rug.)\nRachel: Ah, oh God. Oh, honey, oh that's OK.\nRoss: What. Oh no, you just rolled over the juice box.\n[The next clip is from The One The Morning After.]\n[Scene: Central Perk, Ross is trying to prevent Gunther from spilling the beans.]\nRoss: Gunther! Gunther. Gunther, please tell me you didn’t say anything to\nRachel about me and the girl from the Xerox place.\nGunther: I’m sorry. Was I not supposed to?\n(Ross turns around and sees Rachel sitting by the window. She is just glaring at him.)\n[The next clip is from The One At The Beach.]\n[Scene: The beachhouse, Ross and Rachel are argueing about the breakup.]\nRoss: Y'know, hey! You’re the one who ended it, remember?\nRachel: Yeah, because I was mad at you, not because I stopped loving you!\nRoss: You still love me?\nRachel: Noo.\n[cut to later]\nRoss: What does this mean? What do you, I mean do you wanna, get back together?\nRachel: Noo! Maybe! I, I don’t know.\nRoss: What?!\nRachel: I just, I feel, I-I just...\n(Ross leans in and kisses her. They both look at each other for a moment, and then\nembrace in a more passionate kiss.)\n[The next clip is from The One With The Jellyfish.]\n[Scene: Monica and Rachel's, Rachel and Ross are finally breaking up for good, or is\nit?]\nRachel: Y'know I can’t believe I even thought about getting back\ntogether again! We are so over!!\nRoss: (starts to cry) FINE BY ME!! (he opens the door and traps Chandler behind\nit)\n[cut to later]\nRachel: And hey! Just so you know, it’s not that common! It doesn’t\nhappen to every guy! And it is a big deal!!\nChandler: I KNEW IT!!!!\n[cut back to the present.]\n[Scene: Central Perk, Rachel is deciding on whether or not to go to the wedding.]\n[cut to another clip, this one is from The One With The Prom Video]\n[Scene: Monica and Rachel's, the gang is watching the Prom Video and Rachel is about to\nmake her entrance on the video.  The italics are portions of the prom video.]\nMrs. Geller: Rachel's coming up the path.  Doesn't she look\npretty. Jack... (Rachel enters with a huge nose)\nRachel: Oh my God.\nMonica: You know what this is, this is us getting ready for the prom.\nRachel: Oh.\nRoss: You know what, you guys, we don't have to watch this.\nAll: Oh yeah we do. C'mon.\nMrs. Geller: Get a shot of Monica. Where's Monica.\nMr. Geller: Wait, how do you zoom out? (zooms out and we see an\nextremely overweight Monica eating a big sandwich) There she is.\nMonica: Shut up, the camera adds ten pounds.\nChandler: Ahh, so how many cameras are actually on you?\n[cut to later]\nMonica: Oh, dad, turn it off.\nMr. Geller: It is off.  Right Ross? (pans over to see Ross with\nan afro and moustache)\nJoey: Lookin' good Mr. Cotter.\n[cut to later]\nRachel: I can't go to my own prom without a date, I can't, it's too\nlate.\nMonica: If you're not going then I don't want to go either.\nMrs. Geller: (to Ross on the stairs) I have a wonderful idea. You\nshould take Rachel to the prom.\n[cut to later]\nRoss: Y'know what?  I think we've seen enough, let's turn it off.\nAll: No, no, no.\nRoss: OK, fine, well I'm not gonna watch, alright.\nMr. Geller: C'mon kid, let's go.\nMrs. Geller: Ahh, are you hadsome.\nMr. Geller: Let's show 'em.\nRoss: (walks down the stairs and grabs the flowers out of the vase on\nthe endtable) Okay dad.\nMr. Geller: (going downstairs) Rachel, ready or not, here comes your\nknight in shining—Oh no. (Chip has shown up and the four are leaving.)\nRachel, Monica, Roy, and Chip: Bye.\nMrs. Geller: Oh, dear. Jack, how do I turn this off?\nMonica: (to Ross) I can't believe you did that.\nRoss: Yeah, well.\n[Rachel, seeing what he did for her, gets up, walks across the room, and kisses Ross]\nPhoebe: See, he's her lobster.\n[Cut back to the present, Rachel has made her decision.]\nMonica: (seeing the decision) Nooooo. You’re really not going?\nRachel: Yeah. It’s just gonna be too hard. Y’know? I mean, it’s\nRoss. How can I watch him get married? Y’know it’s just, it’s for the best,\ny’know it is, it’s… Y’know, plus, somebody’s got to stay here\nwith Phoebe! Y’know she’s gonna be pretty big by then, and she needs someone to\nhelp her tie her shoes; drive her to the hospital in case she goes into labour.\nMonica: You don’t have a car. And your license expired.\nRachel: I know. (Starts to cry) Yeah, see, there’s so much to do and I have\nso little time to do it in.\nClosing Credits\n[Scene: Central Perk, Chandler, Joey, and Phoebe are reading a book about things to do\nwhilst in London.]\nChandler: All right, check it out. Check this out. It says here that\nthere’s a place you can go to rent videos of all the museums! (Reading from the\nbook.) \"It’s almost as good as being there.\"\nJoey: It’s better! You can’t go to a museum in your underwear!\nChandler: Well, You could, but... probably just the one\ntime.\nJoey: I bet we could get videos of all the sites, get a VCR in our\nhotel room... we'd never even have to go outside!\nChandler: If we do that, we gotta get Die Hard.\nJoey: Oh-ho! I bet the British version is gooooood!\nEnd",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0421.html",
  "scrapedAt": "2025-12-17T14:29:35.333Z",
  "wordCount": 4111,
  "hasCharacterNames": true
}