[
  "What is the topic Sheldon and another character discuss at the beginning of the episode?",
  "Why do Leonard and Sheldon go to the high-IQ sperm bank?",
  "What is Penny's job?",
  "What is the name of the song playing in the background when Penny meets Leonard and Sheldon?",
  "Why does Sheldon not want Penny to sit in his spot?",
  "What is the reason for Leonard and Sheldon's visit to Penny's ex-boyfriend's place?",
  "What is Howard's profession?",
  "What is the outcome of Leonard and Sheldon's visit to Penny's ex-boyfriend's place?",
  "What does Sheldon say about the possibility of a romantic relationship with Penny?",
  "What is the activity that Leonard and Penny decide to do together at the end of the episode?",
  "What type of cuisine does Raj suggest for dinner?",
  "What is the reason Sheldon gives for not being able to carry a TV?",
  "What does Howard say about his work?",
  "What is Penny's astrological sign?",
  "What does Sheldon say about Penny's astrological sign?",
  "What is the name of the restaurant where Penny works?",
  "What is the reason for Sheldon's hesitation to have Penny use their shower?",
  "What is the outcome of Penny's use of the shower?",
  "What does Sheldon say about his relationship with Penny?",
  "What is the activity that Leonard and Penny do together at the end of the episode?",
  "What type of cuisine does Sheldon object to having for dinner?",
  "What is the name of the song that Leonard and Penny sing at the karaoke bar?",
  "What is Howard's comment about his work?",
  "What does Sheldon say about his intelligence?",
  "What is the name of the character who says 'I'm a vegetarian, no, except for fish, and the occasional steak'",
  "What does Sheldon say about the concept of astrological signs?",
  "What is the reason for Leonard's visit to Penny's ex-boyfriend's place?",
  "What is the outcome of Leonard's visit to Penny's ex-boyfriend's place?",
  "What does Sheldon say about the possibility of a romantic relationship with Penny?",
  "What is the activity that Leonard and Penny decide to do together at the end of the episode?",
  "What type of cuisine does Raj suggest for dinner?",
  "What does Howard say about his work?",
  "What is Penny's astrological sign?",
  "What does Sheldon say about Penny's astrological sign?",
  "What is the name of the restaurant where Penny works?",
  "What is the reason for Sheldon's hesitation to have Penny use their shower?",
  "What is the outcome of Penny's use of the shower?"
]