[
  "What did Monica plan to poach for Rachel's birthday party?",
  "What type of dessert did Monica decide to have for Rachel's birthday instead of cake?",
  "Why didn't Joey want Shannon Cooper to be invited to the party?",
  "What did Ross say his job was like in comparison to Dr. Greene's job?",
  "What activity did Phoebe help Gunther and two other guests escape to?",
  "What was Monica's instruction to the guests regarding the markers?",
  "What did Ross wear that belonged to Mr. Greene?",
  "What did Chandler compare his experience of his parents' divorce to?",
  "What did Rachel compare her family's dynamic to?",
  "What did Ross do to prevent Mr. Greene from entering Monica's apartment?",
  "What did the guys form to prevent Mrs. Greene and Mr. Greene from meeting in the hallway?",
  "What did Joey do to distract Mrs. Greene while Mr. Greene left?",
  "What did Monica say the flan looked like?",
  "What happened to the flan at the end of the episode?",
  "What type of trees did Mrs. Greene spend $1200 on?",
  "What did Ross say he would do to get Mr. Greene's cigarettes and glasses?",
  "What did Phoebe tell the three guests who wanted to leave Monica's party?",
  "What did Chandler say the party was on when Ross asked him why they had to have parties with committees?",
  "What did Monica say to Gunther when he tried to leave the party?",
  "What did Rachel say her mom spent $1200 on?",
  "What did Ross say to Mr. Greene when he asked for his scotch?",
  "What did Phoebe say to the guests when she was helping them escape from Monica's party?",
  "What did Monica say to the guests when they were leaving her party?",
  "What did Chandler say to Rachel when she was sitting in the hallway after the party?",
  "What did Ross do when Mr. Greene tried to enter Monica's apartment?",
  "What type of drink did Mr. Greene order from Ross?",
  "What did Phoebe create to help Gunther and the other guests escape from Monica's party?",
  "What did Monica say the party was when Mr. Greene asked her what was going on?",
  "What did Ross say to Rachel when she was talking to her mom?",
  "What did Joey do when Mr. Greene was trying to get his coat from Monica's apartment?",
  "What type of game did Monica want to start at her party?",
  "What did Chandler say when Ross asked him why they had to have parties with committees?",
  "What did Phoebe say to the guests when she was helping them escape from Monica's party?"
]