[
  "What does Monica say is 'just some guy I work with'?",
  "What is the name of the item the 'geek' credit card thief spent $69.95 on?",
  "Why does Marcel's humping need to be addressed?",
  "What is the name of the Broadway show that Fake Monica suggests auditioning for?",
  "What does Fake Monica claim she used to be like before changing her life?",
  "Where does Ross plan to take Marcel?",
  "What is the name that Joey considers as a stage name?",
  "What does Phoebe suggest as a stage name for Joey?",
  "Why does Monica visit Fake Monica in jail?",
  "What does the teacher in the tap class say about observing a dance class?",
  "What is the name of the zoo that Ross is considering for Marcel?",
  "What does Rachel do when she finds out that Monica is drunk?",
  "What is the reason why Ross has to give up Marcel?",
  "What does Phoebe give to Marcel as a gift before he leaves?",
  "What does Joey say to Marcel before he leaves?",
  "What does Ross tell Marcel before he leaves?",
  "What is the name of the play that Joey auditions for?",
  "What does Fake Monica say about the movie Dead Poets' Society?",
  "Why does Monica visit Fake Monica in jail?",
  "What does the credit card company tell Monica?",
  "What does Monica say about her experience with Fake Monica?",
  "What does Ross do with Marcel before he leaves?",
  "What does Phoebe do for Marcel before he leaves?",
  "What does Joey do when he finds out that Ross has to give up Marcel?",
  "What does Chandler do when he finds out that Ross has to give up Marcel?",
  "What does Rachel do when she finds out that Monica is acting strangely?",
  "What does Monica say about her experience with Fake Monica?",
  "What does Fake Monica say about Monica's personality?",
  "What does Monica do when she finds out that Fake Monica has been arrested?",
  "What does Ross do when he finds out that Marcel has to be given up?",
  "What does Joey do when he finds out that Ross has to give up Marcel?",
  "What does Chandler do when he finds out that Ross has to give up Marcel?",
  "What does Rachel do when she finds out that Monica is acting strangely?",
  "What does Monica say about her experience with Fake Monica?"
]