[
  "What does Rachel say to Chandler after he sees her naked?",
  "What is Phoebe's boyfriend's profession?",
  "Why does Ross think his marriage failed?",
  "What does Joey's dad do for a living?",
  "What is the name of Joey's dad's mistress?",
  "What does Chandler say about Rachel's breasts?",
  "Why does Ross suggest that Chandler show Rachel his 'peepee'?",
  "What does Phoebe break up with Roger over?",
  "What is the name of the coffee shop where the friends hang out?",
  "What does Ronni do for a living?",
  "Why does Joey want his dad to break up with Ronni or tell his mom about the affair?",
  "How does Joey's mom react to the news of her husband's affair?",
  "What does Chandler say to Joey about his ability to be in a relationship?",
  "What does Phoebe say about Roger's perception of her friends?",
  "Why does Joey try to get revenge on Rachel by looking at her breasts?",
  "What does Monica do when she finds out that Joey's dad is in the shower?",
  "What does Joey's mom say about her husband's mistress?",
  "Why does Phoebe's boyfriend Roger analyze her friends?",
  "What does Joey say to his dad about his mistress?",
  "What does Rachel say to Ross about his marriage?",
  "What does Chandler say about his parents?",
  "What does Joey's mom say about her husband's behavior?",
  "What does Phoebe say about her friends' reaction to Roger?",
  "What does Joey's dad say about his son's behavior?",
  "What does Chandler say about his 'thing'?",
  "What does Rachel say to Chandler about his 'peepee'?",
  "What does Joey say to his mom about his dad's mistress?",
  "What does Phoebe's boyfriend Roger say about her friends?",
  "What does Joey's mom say to her son about his behavior?",
  "What does Chandler say about his relationship with his parents?",
  "What does Phoebe say about her boyfriend Roger's behavior?",
  "What does Joey say to his dad about his behavior?",
  "What does Rachel say to Ross about his wife?",
  "What does Chandler say about his 'thing' being in the shower?"
]