{
  "show": "Friends",
  "season": 6,
  "episode": 2,
  "title": "The One Where Ross Hugs Rachel",
  "transcript": "The One Where Ross Hugs Rachel\nWritten by: Shana Goldberg-Meehan\nTranscribed by: Eric Aasen\n[Scene: Central Perk, it’s the same scene from the end of last week’s show.\nPhoebe and Rachel are sitting on the couch as Ross enters.]\nRoss: Hey!\nRachel: Hey, so did everything go okay with the annulment?\nRoss: Oh, yeah, no problems. It’s all taken care of.\nRachel: Ross, thank you. Hey, do you guys wanna go see a movie?\nRoss: Oh yeah, why not?\nRachel: Okay, umm, I’m gonna get my sweater. (Walks away.)\nRoss: Okay. (Sits down next to Phoebe.) You uh, you wanna hear something weird?\nPhoebe: Always.\nRoss: I didn’t get the annulment.\nPhoebe: What?!\nRoss: We’re still married! Don’t tell Rachel. See you later. (He gets\nup leaving Phoebe in shock.)\n[Cut to outside Central Perk.]\nRoss: (To Rachel) Hey, do you have any gum?\nRachel: Oh? Yeah! Sure!\nPhoebe: (running out) Wait! Wait! Hi! Listen, Ross can I just talk to you for\njust a second?\nRachel: Oh but Phoebe, we’re gonna be late for the movie.\n(A cab pulls up.)\nPhoebe: Oh, there’s a cab! Taxi!! (The cab stops and she opens the door.)\nGood timing, my God, huh? Here you go. (Pushes Rachel in and closes the door.)\nRachel: Yeah, we’re, we’re actually just gonna walk ‘cause\nit’s right up there at the Angelica.\nPhoebe: Oh, the Angelica!! Go! Go! (She bangs on the cab’s roof and it\npulls away.) (To Ross) You didn’t get the annulment?!!\nRoss: I know.\nPhoebe: Ross?!\nRoss: Well, I tried! But when I got to my lawyer’s office all I could hear\nwas, \"Three divorces. Three divorces!\" Look, I just don’t want my tombstone\nto read, Ross Gellar, Three Divorces.\nPhoebe: Don’t be worried about that! Your tombstone can say whatever you\nwant it to say! It could say, Ross Geller, Good at Marriage! Y’know? Mine’s\ngonna say Phoebe Buffay, Buried Alive.\nRoss: Look, all I know is I-I can’t have another failed marriage!\nPhoebe: So okay what? You’re gonna be married to a girl who doesn’t\neven know about it?!—Op, woman! Sorry.\nRoss: Well, okay so, I don’t have it all worked out quite yet. Just\ndon’t say anything to Rachel, please?\nPhoebe: Rachel is one of my closest friends. (Pause) Although, being the only\none who knows anything about this does makes me feel special. Okay!\n(Rachel’s cab backs up.)\nRachel: (to the driver) Okay, stop-stop! Phoebe?!\nPhoebe: Hey Rach!\nRachel: What was that?!\nPhoebe: Sorry, mix up. Hey, how was the movie?\nRachel: I haven’t seen it yet!\nPhoebe: Well then you’d better hurry! The Angelica! Go! Go! (Bangs on the\nroof again and off they go.)\nRachel: Noooooooo!!\nOpening Credits\n{Transciber’s note: In case you’re wondering, and I know you are. Their names\nare all back to normal. Just in a slightly smaller font than usual to allow Courteney Cox\nArquette to fit on one line and not be smaller than the rest of their names. Now, on with\nthe show…}\n[Scene: Monica and Rachel's, Chandler and Monica are cuddling on the couch.]\nChandler: Y’know when we move in together, can I get a gumball machine?\nMonica: Of course! Joey wouldn’t let you have one?\nChandler: No. When it comes to sweets, he’s surprisingly strict.\nMonica: Hey, have you figured out a way to tell him you’re moving out?\nChandler: No, no, I keep trying, y’know? I can get out, \"Joey, I have\ntoo…\" but then I lose my nerve and I always finish with, \"…go to the\nbathroom.\" He may think I’m sick.\nMonica: Y’know, I really have to tell Rachel, but I… We just have to\nget it over with! Y’know, the next time we see them we’re just gonna tell them.\nOkay? That’s it.\nChandler: Oh, so that’s this is gonna work now? You’re just gonna\norder me around all the time?\nMonica: Pretty much.\nChandler: All right.\nJoey: (entering) Hey Monica!\nMonica: Hi!\nJoey: (To Chandler) Hey man, you feeling any better? (Chandler answers him\nwith some guttural sounds that only he can make and that no human can transcribe.)\nMonica: Joey, we have something to tell you.\nJoey: Oh my God! You’re pregnant!\nChandler: No-o-o! (To Monica) No? (She nods no.) No-o-o! Look Joey, here’s\nthe thing, Monica and I have decided to live together, here. So, I’m gonna be moving\nout man.\nJoey: Wow! (Tearing up) Well, uh… Hey! I’m really happy for you guys!\nCongratulations! (Kisses Monica on the cheek) See you later. (Starts for the door on the\nverge of tears as Monica stops him.)\nMonica: Wait! Joey! Joey! Are you okay?!\nJoey: Yeah, I gotta go! I got an acting job. (Turns towards the door, pauses,\nand turns back.) Like you’d believe that. This sucks!\nChandler: Look, I-I’m just gonna be right across the hall and I promise\nyou, the minute Monica and I break up I’m moving right back in with you!\nJoey: (To Monica) Okay! Look-look-look, uh, if you’re gonna be moving in\nwith him I feel it’s my responsibility to tell you the truth about him! Okay?\nHe’s a terrible roommate! Terrible! He uh, forgets to umm… Oh-oh he always, he\nalways umm—Oh, who am I kidding! He’s the best roommate ever! (Hugs Chandler.)\n[Scene: Central Perk, Phoebe is on the couch as Monica enters.]\nMonica: Hey Pheebs!\nPhoebe: Hey!\nMonica: Hey, have you seen Rachel?\nPhoebe: No, why?\nMonica: I have some pretty exciting news!\nPhoebe: (gasps) You’re pregnant!\nMonica: No! Chandler and I are moving in together!\nPhoebe: Ooh! That’s good! Wow! But now if you were pregnant, what would you\nname it? Hint: Phoebe.\n(Ross returns from getting some coffee.)\nRoss: Hey! Hi!\nMonica: Hey!\nRoss: What’s up?\nMonica: Well umm, Chandler and I are moving in together.\nRoss: Oh my God. Ohh, my little sister and my best friend…shaking up. Oh,\nthat’s great. That’s great. (Kisses and hugs her.)\nPhoebe: Guys, I’m happy too.\nMonica: Okay, come here! (Phoebe joins them in the hug.)\nPhoebe: Wow! Big day huh? People moving in, people getting annulled… (Winks\nat Ross.)\nMonica: Okay, I gotta go find Rachel but umm, if you guys see her could you\nplease try to give her some really bad news so that mine doesn’t seem so bad?\n(Exits.)\nRoss: Bye.\nPhoebe: Hmm, something bad to tell Rachel… Bad news for Rachel, what could\nthat be?!\nRoss: Could ya just, could ya just lay off, please? All right? My life is an\nembarrassment! I should go live under somebody’s stairs!\nPhoebe: Ross, it’s not that big a deal! So you’ll been divorced three\ntimes, you’ll still have a life, you’ll go on dates…\nRoss: (interrupting) No! No, I won’t! I’ll be at the bottom of the\ndating barrel now. The only guys below me will be Four Divorce Guy uh, Murderer Guy,\nand-and, Geologists.\nPhoebe: Ross, you’re being ridiculous! Okay? You are cute and smart and\nsweet and that is much more important than three stupid divorces!\nRoss: Oh yeah? Have you ever dated anyone who has been divorced three times?\nPhoebe: Y’know that’s really fair. Y’know? Most guys who have\nbeen divorced three times are like 60. Ross, nobody cares about this except you! This-this\nembarrassment thing is all in your head! Here, I’ll show you! Come here.\nRoss: What?! Why?\n(She grabs his arm and drags him over to a table where three beautiful women are\nsitting. Now, I’m going to go out on a limb and say that their names are Stephanie,\nKarin, and Meg. Okay, so I looked at the credits. Of course, only Meg is named later on,\nso I’ll have to guess who is Stephanie and who is Karin. But, we’ll cross that\nbridge when we come to it.)\nPhoebe: (to the girls) Hi! Hi! Listen, my friend Ross is about to be divorced\nfor the third time, but wouldn’t you date him?\nRoss: And if you wait right here, I’ll go get Ross. (Phoebe grabs his arm\nand prevents him from escaping.)\n[Scene: Monica and Rachel's, Monica is pacing anxiously waiting for Rachel.]\nChandler: (entering) Hey!\nMonica: Ugh, I thought you were Rachel!\nChandler: (looking down) What gave me away?\nMonica: I just tell her, I have to get it over with. I told Ross and Phoebe and\nshe’s the only one left!\nChandler: Okay, so that’s it, everybody knows! It’s official,\nwe’re moving in together. No turning back. Are ya scared? Are ya?\nMonica: No.\nChandler: Wow that was my scariest voice! You’re very brave.\n(They hug as Rachel enters.)\nRachel: Hey!\nChandler: Hey.\nRachel: Ugh, the worse day! Y’know, you think you’re making progress\nat work and then your boss calls you Raquel.\nChandler: Hey listen, for the first four years of my work everybody called me\nSha-la-lap. (Awkward silence ensues.) Seriously.\nRachel: I believe you. So, it was right in the middle of a staff meeting so of\ncourse no one else wants to correct her so everyone else is calling me Raquel! By the end\nof the day, the mailroom guys were calling me Rocky!\nChandler: Well, I-I still think you’re very-very nice and very pretty…\nRachel: What?\nChandler: (To Monica) All yours babe. (Walks away.)\nMonica: Have a seat. (They sit at the table.) Okay, listen umm, Chandler and I\nare going to live together, here.\nRachel: Oh my God! That’s so great! I’m so happy for you guys!\nMonica: Really?!\nRachel: And that was so sweet of you to ask! Oh my God, the three of us are\ngonna have such a good time living together!\nMonica: Yes, we are. (Chandler is frantically trying to get Monica to correct\nher.)\nRachel: And Chandler, you’re gonna have to watch those long showers you\ntake in the morning because you know Raquel can’t be late.\nChandler: Rach…\nMonica: Yeah, he’s gonna work on that.\nRachel: Ohh! This is so exciting! Oh God… (Gasps and starts to sing)\nCome and knock on my door…\nMonica: (singing) We’ll be waiting for you…\n{Transciber’s note: I’ll finish that one for those of you who don’t know\nwhat they’re talking about. Where the towels are Hers and Hers and His,\nThree’s Company too! Yeah, that’s the theme song for Three’s Company.}\nCommercial Break\n[Scene: Central Perk, Phoebe is hosting an impromptu roundtable discussion with\nStephanie, Karin, and Meg about Ross’s three divorces.]\nRoss: …once you know the stories, it’s not that bad. First marriage,\nwife’s hidden sexuality, not my fault. Second marriage, said the wrong name at the\naltar, a little my fault. Third marriage, well they really shouldn’t allow you to get\nmarried when you’re that drunk and have writing all over your face, Nevada’s\nfault.\nPhoebe: Okay, so what do you think ladies? Who wouldn’t be interested? Who\nwouldn’t want to date him?\nStephanie: Well the divorces don’t bother me, I’d date him. But, not\nwhile he’s still married.\nPhoebe: Okay, what about you? (Points to Karin) Wouldn’t you want a date?\nKarin: Actually, I’m dating at all anymore. See, I figured out that I was\nonly dating guys that were like y’know bad for me, so until I work that out…\nPhoebe: (interrupting) Whatever! What about you Meg?\nMeg: Well, I don’t care about the divorces either, but I wouldn’t date\nhim. It’s just that he’s obviously still in love with this Rachel girl.\nRoss: What?!\nPhoebe: (leaning to him) She said, \"He’s obviously still in love with\nthis Rachel girl.\" (He glares at her.)\nRoss: This is crazy! I mean, yes-yes Rachel is my good friend and I-I have loved\nher in the past, but now, she is just my wife! Phoebe, will you-will you help me\nout here?\nPhoebe: Well, I thought you loved her when you-when you married her.\nRoss: We were drunk! I would’ve married uh, Joey with that amount of\nalcohol!\nPhoebe: Hey! You could do a lot worse than Joey Tribbiani!!\nRoss: (to the panel) Look, I’m sorry, but you guys are wrong. I just\ndon’t want to be divorced three times.\nPhoebe: Yes, and now he’s using this three divorces reason because he wants\nto stay married to her because he loves her. I must say, \"Well done!\" Bravo Meg.\nRoss: (getting up) Okay! Fine! Fine! If-if this is what you think, forget about\nthe whole three divorce thing! Okay, I-I’ll go to my lawyer’s office right now\nand get this marriage annulled! Okay?! Because she means nothing to me! Noth—(leans\ndown to Meg’s ear)—Nothing!!\nMeg: Okay now I wouldn’t date you because you seem a little creepy.\nKarin: I am so attracted to him right now.\n[Scene: Monica and Rachel's, Chandler and Monica are still debating about how to tell\nRachel that Chandler’s moving in and she’s moving out.]\nChandler: Okay, when are we gonna tell Rachel what is actually gonna happen?\nMonica: Soon! I-I just couldn’t before. You saw how upset Joey got! I\ncouldn’t do that to her, she’s my best friend!\nChandler: Well, Joey’s my best friend.\nMonica: I’m not your best friend?\nChandler: You just said… Of course you’re my best friend. Would you\nplease tell Rachel though?\nMonica: All right, all right, at least I’m prepared.\nChandler: Okay. (She grabs a tin of freshly baked cookies) Oh yes. (He reaches\nfor one.)\nMonica: (slapping his hand) Hey!\nChandler: Hey-hey!\nMonica: These aren’t for you! Are you upset?\nChandler: I am now!\nRachel: (entering) Hey roomie!\nChandler: Okay, bye! (Exits.)\nMonica: Rach, there’s something uh, important I have to tell you.\nRachel: (gasps) Are you pregnant?!\nMonica: No! But, I’m throwing this shirt away! I think there was a little\nmisunderstanding before.\nRachel: Um-hmm.\nMonica: Umm, when I said that uh, that Chandler and I wanted to umm, live\ntogether we meant alone together.\nRachel: (laughs) Oh my God! Oh, that’s funny, I can’t believe I did\nthat.\nMonica: Oh no sweetie, no! This is my fault, I wasn’t clear! I’m\nreally sorry. And listen, you take as much time as you need to move out okay? There’s\nabsolutely no rush.\nRachel: Okay. (Sits back and resumes her reading.)\nMonica: Okay. Don’t you want a cookie?\nRachel: Sure? (Monica hands her one.) Thanks.\nMonica: Maybe, do you need a tissue?\n(Rachel mumbles uh-huh and spits the half-eaten cookie out onto the tissue.)\nRachel: Monica, where did you get these?!\nMonica: I made them!\nRachel: Ooh, good God, they’re so yummy! (She re-ingests the previously\nexpelled cookie matter from the tissue.)\n[Scene: Chandler and Joey's, Chandler is packing some books and Joey is watching him.]\nJoey: God, it’s gonna so weird like when I come home and you’re not\nhere. Y’know? No more Joey and Chan’s. No more J and C’s. \"You wanna\ngo over to Joey and Chandler’s?\" \"Can’t, its not there.\"\nChandler: Look, I’m just gonna be across the hall, we can still do all the\nsame stuff.\nJoey: Yeah but we won’t be able to like get up in the middle of the night\nand have those long talks about our feelings and the future.\nChandler: Not once did we do that.\nMonica: (entering) Hi.\nChandler: Hey!\nJoey: Hi.\nMonica: So I, I told Rachel it was just gonna be the two of us.\nChandler: Oh yeah? Well, how’d she take it?\nMonica: Really well. Yeah. Surprisingly well. Yeah, she didn’t cry. She\nwasn’t angry or sad. (Sits down, slightly disgusted.)\nChandler: And you’re upset because you didn’t make your best friend\ncry?\nMonica: I mean, all I’m asking for is just a little emotion! Is that too\nmuch to ask after six years?! I mean what? Are-are-are Rachel and I not as close as you\nguys?! I mean do we not have as much fun?! Don’t I deserve a few tears?!! I mean\nwe-we told Joey, he cried his eyes out!\nJoey: Hey! I did not cry my eyes out!! Come on! It’s like the end of an\nera! No more J-man and Channie’s!!\nChandler: Okay, I gotta ask, who calls us that?!\n[Scene: Ross’s lawyer’s office, his name is Russell and has just been told by\nRoss about his current situation.]\nRussell: You got married again.\nRoss: Yes.\nRussell: So that’s your second marriage in two years.\nRoss: Yes, second in two years. Third overall.\nRussell: Ross, I have been a divorce attorney for 23 years and never had I so\nmuch business from one client. Why don’t you tell me what happened.\nRoss: Basically, Rachel and I were in Vegas and we got drunk…\nRussell: (interrupting) I’m sorry, is this the same Rachel who’s name\nyou said at the altar in the second marriage?\nRoss: Yes-yes-yes! But, I-I do not love her.\nRussell: Oh, that’s better then.\nRoss: This was just a drunken mistake and I need to get it annulled.\nRussell: I see. Have you considered therapy?\nRoss: I think just the annulment for today.\nRussell: There are a couple of forms to fill out.\nRoss: Easy.\nRussell: And we’ll need to have witnesses who can testify that you were not\nof uh, sound mind.\nRoss: No problem.\nRussell: And we’ll need you and Rachel to testify before a judge.\nRoss: Ooh! There’s no way to do this without her? ‘Cause I kinda all\nready told her uh, it was, it was already taken care of.\nRussell: Of course you did. Look Ross, you can’t get an annulment unless\nyou and Rachel are both there.\nRoss: Uh-ha, what about someone who looks like Rachel? (Russell glares at him.)\nI will think about the therapy.\n[Scene: Monica and Rachel's, Rachel is painting her toe nails as Monica enters.]\nRachel: Hey!\nMonica: Hey. So um, I was thinking that maybe we should start dividing up our\nstuff.\nRachel: Okay!\nMonica: Y’know, no point in dragging it out. Dragging out the long\nprocess of you moving out and us not living together anymore.\nRachel: Okay.\nMonica: Hey Rach, what about this? (She holds up a chrome 5-point star.) Huh?\nWho-who gets this? See, I don’t know if I want it because it might be y’know,\ntoo many memories!\nRachel: (grabbing the star) What the hell is that?\nMonica: I don’t know. (Picks up a big plate from the coffee table.) Hey,\nRachel, you want the big plate? I want you to have the big plate.\nRachel: Wow! Mon, thanks! I love this plate!\nMonica: Something to remember me by!\nRachel: Mon, honey you’re not dying. I’m just moving out. Y’know,\nI mean we’re gonna see each other all the time.\nMonica: But still, it’s a big change. The end of an era, you might say!\nRachel: Are you okay? You’re not blinking.\nMonica: I’m fine! I just, I’m thinking how much it’s an end of\nera.\nRachel: Oh, all right. But y’know I gotta say, I don’t, I don’t\nthink six years counts as an era.\nMonica: An era is defined as a significant period of time. Now, it was\nsignificant to me, maybe it wasn’t significant to you!\nRachel: What is the matter with you?!\nMonica: What is the matter with you?!! Why aren’t you more upset?!\nAren’t you gonna be sad that we’re not gonna be living together anymore?! I mean\naren’t you gonna miss me at all?!\nRachel: All right, fine, but don’t get mad at me. It’s-it’s just\na little hard to believe.\nMonica: What’s hard to believe?\nRachel: Well y’know, it’s you guys. You-you do this kind of stuff!\nY’know? I mean, you-you were gonna get married in Vegas and then you backed out! I\nguess I’m not upset because I don’t see you guys going through with it. I’m\nsorry.\nMonica: Rachel, it’s going to happen. Chandler is gonna move in here.\nRachel: But I…\nMonica: No-no, wait! Just let me finish, okay? This isn’t something that we\njust, we just impulsively decided in-in Vegas, this is something we both really want. And\nit is going to happen.\nRachel: It is? Really?\nMonica: Yeah, sweetie.\nRachel: (starting to lose her composure) I mean we’re not, we’re not\ngonna live together anymore?\nMonica: No.\nRachel: What? Oh my God! I’m gonna miss you so much! (Starts to cry.)\nMonica: I’m gonna miss you! (They hug.)\nRachel: I mean it’s the end of an era!\nMonica: I know!\n[Scene: The hallway, Ross is coming up the stairs as Phoebe leaves Joey and\nChandler’s.]\nPhoebe: (to Joey and Chandler) Okay, bye!\nRoss: Oh no.\nPhoebe: So? Did you get the annulment?\nRoss: I couldn’t.\nPhoebe: I knew it! Because you love Rachel.\nRoss: It’s not that. Okay? Annulments are more complicated than I…\nPhoebe: Yeah, complicated ‘cause of the love.\nRoss: I… I do, I do not love Rachel. I’m gonna tell her right now\nabout the whole thing so we can get this marriage annulled as fast as possible. Okay?\nWould I do that if I loved her?\nPhoebe: I’ve never been more convinced of your love for her.\nRoss: I do not have feelings for Rachel! Okay?! (He goes into her apartment.)\n[Cut to Monica and Rachel’s as Ross walks through the door. Rachel is holding the\nchrome star and crying.]\nRoss: Ohh, what’s wrong?!\nRachel: Monica and Chandler are really moving in here and I have to move out and\neverything is changing.\nRoss: Oh my—Come here! Come here! (He hugs her.) It’s okay.\nEverything’s gonna be okay.\nRachel: Thank you.\nRoss: Of course.\n(Ross suddenly realizes something.)\nEnding Credits\n[Scene: Central Perk, Joey and Phoebe are talking.]\nJoey: So, Ross and Rachel got married, Monica and Chandler almost got married,\ndo you think you and I should hook up?\nPhoebe: Oh we do, but not just yet.\nJoey: Really?! Well, when?\nPhoebe: Okay umm, well, first Chandler and Monica will get married and be filthy\nrich by the way. Yeah. But it won’t work out.\nJoey: Wow.\nPhoebe: I know. Then, I’m gonna marry Chandler for the money and\nyou’ll marry Rachel and have the beautiful kids.\nJoey: Great!\nPhoebe: But then we ditch those two and that’s when we get married.\nWe’ll have Chandler’s money and Rachel’s kids and getting custody will be\neasy because of Rachel’s drinking problem.\nJoey: Oh-oh, what about Ross?\nPhoebe: I don’t want to go into the whole thing, but umm, we have words and\nI kill him.\nEnd",
  "source": "Friends Transcripts (fangj.github.io)",
  "sourceUrl": "https://fangj.github.io/friends/season/0602.html",
  "scrapedAt": "2025-12-17T14:32:05.922Z",
  "wordCount": 3717,
  "hasCharacterNames": true
}