[
  "What does Phoebe say is the problem with keeping the extra $500 in her bank account?",
  "What does Joey say is the meaning of 'We should do this again' in dating language?",
  "Why does Chandler start smoking again?",
  "What does Monica say is the distance between the tip of a guy's thumb and the tip of his index finger?",
  "What does Phoebe find in her can of soda?",
  "Why does Chandler stop smoking after talking to Alan on the phone?",
  "How much money does Phoebe receive from the soda company for finding the thumb in the can?",
  "Why does Monica decide to break up with Alan?",
  "What is the reaction of the friends when Monica tells them she's breaking up with Alan?",
  "Why does Alan say he's relieved when Monica breaks up with him?",
  "What does Chandler say he will do if Phoebe gives him $7000?",
  "What does Monica say her friends are like when she brings a guy home?",
  "What does Phoebe do with the $1000 she received from the bank?",
  "What does Ross say about speaking correctly?",
  "What does Joey say about his knuckle-cracking habit?",
  "What does Phoebe say about the universe after stepping in gum and receiving $7000?",
  "Why does Chandler want to get cigarettes at the end of the episode?",
  "What is the name of the person Phoebe gives the $1000 to?",
  "What does Monica say about feeling the 'thing' for Alan?",
  "What is the reaction of the friends when they meet Alan for the first time?",
  "What does Chandler say about his flaw of smoking?",
  "What does Ross say about Alan's softball skills?",
  "What does Phoebe do after finding the thumb in her soda?",
  "What does Monica say about her friends' reaction to Alan?",
  "What does Chandler say about his nicotine patch?",
  "What does Phoebe say about the thumb she found in her soda?",
  "What does Monica say about breaking up with Alan?",
  "What does Ross say about Alan's impression of David Hasselhoff?",
  "What does Phoebe say about the universe after receiving $7000 from the soda company?"
]