[
  "What does Rachel wear to her first day at her new job?",
  "Who helps Rachel pick out a purse for her first day of work?",
  "What is the name of Chandler's weird cousin who is getting married?",
  "What is the name of the song Joey plans to sing at his audition?",
  "What is the name of the woman who kisses Mark in Rachel's office?",
  "What is the name of the poem Julio writes about?",
  "What does Ross send to Rachel's office to mark his territory?",
  "What is the name of the diner where Monica works?",
  "Who does Ross have a play date with at the end of the episode?",
  "What does Joey claim to have on his resume?",
  "What does Phoebe think Julio's poem 'The Empty Vase' is really about?",
  "What does Monica give to Julio as a gift?",
  "What does Ross do when he sees Mark kissing another woman in Rachel's office?",
  "What does Joey do during his dance audition?",
  "What does Rachel do when Ross tells her he has a play date with a stripper?",
  "What is the reason for Ross's jealousy according to Chandler?",
  "What does Gunther say when Ross and Rachel are talking at Central Perk?",
  "What does Monica say to Julio when she finds out what his poem is really about?",
  "What does the barbershop quartet sing to Julio at the end of the episode?",
  "What is the name of the song the pianist plays during Joey's dance audition?",
  "What does Chandler buy for the bachelor party?",
  "What does Ross do when he sees Mark kissing another woman in Rachel's office?",
  "What does Joey do when he is asked to teach the dance combination to the other dancers?",
  "What is the reason for Monica's confrontation with Julio?",
  "What does Phoebe think about Julio's poem?",
  "What does Ross say to Rachel when she asks him why he is jealous?",
  "What does Chandler say to Ross when he is trying to decide what to do about Rachel and Mark?",
  "What does Joey say to the director when he is asked to teach the dance combination?",
  "What does Monica say to Julio when she gives him the vase?",
  "What does the director say to Joey when he asks him to teach the dance combination?",
  "What does Ross do when he sees the woman Mark is kissing?"
]